{"london23":{"400m Hurdles Women":{"date":"2023-07-23T14:04","blurb":"Predicted finish and times:\n\n1. Femke Bol (NED) - 52.15\n2. Shamier Little (USA) - 53.20\n3. Janieve Russell (JAM) - 53.60\n4. Viktoriya Tkachuk (UKR) - 54.25\n5. Rushell Clayton (JAM) - 54.50\n6. Jessie Knight (GBR) - 54.80\n7. Gianna Woodruff (PAN) - 55.00\n8. Anna Ryzhykova (UKR) - 55.50\n\nExplanation:\n\nBased on the performances and times listed, Femke Bol is the clear favorite to win the Women's 400m Hurdles at the 2023 London Diamond League track meet. Bol has been dominating the indoor season, consistently running fast times in the 400m and 400m hurdles events. Her personal best of 52.03 and season's best of 52.30 are significantly faster than any other competitor in the field. Furthermore, Bol has shown great consistency and versatility across various distances, indicating her ability to maintain a strong pace throughout the race.\n\nIn second place, Shamier Little is expected to put up a strong challenge. While her personal best of 52.39 is slightly slower than Bol's, Little has been consistently running in the low 53-second range this season. Her recent performances, including a season's best of 53.34, suggest that she is in good form and capable of a strong finish. However, it is unlikely that Little will be able to match Bol's pace and secure the top spot.\n\nJanieve Russell is predicted to take third place. Although her personal best of 53.08 is not as fast as Bol or Little, Russell has shown consistent performances in the mid-53-second range this season. Her recent second-place finish with a time of 53.72 indicates that she is in good shape and capable of challenging for a podium position.\n\nViktoriya Tkachuk is expected to finish in fourth place. While her personal best of 53.76 is respectable, her season's best of 54.71 suggests that she may struggle to keep up with the top contenders. Tkachuk has shown inconsistent performances throughout the season, including a sixth-place finish with a time of 55.77. Her lack of consistent fast times and strong competition from the other athletes make it unlikely for her to finish higher than fourth.\n\nRushell Clayton is predicted to finish in fifth place. With a personal best of 53.33 and a season's best of 53.79, Clayton has shown decent performances this season. However, her recent performances have been inconsistent, including a sixth-place finish with a time of 54.71. While she has the potential to challenge for a higher position, the competition from the top contenders may prove to be too tough for her.\n\nJessie Knight is expected to finish in sixth place. Despite her recent impressive performances, including a personal best of 54.09 and a season's best of 54.32, Knight is still slightly behind the top contenders in terms of overall speed and consistency. While she has shown great improvement this season, it is unlikely that she will be able to challenge for a higher position.\n\nGianna Woodruff is predicted to finish in seventh place. With a personal best of 53.69 and a season's best of 54.46, Woodruff has shown decent performances this season. However, her recent performances have been inconsistent, including a seventh-place finish with a time of 56.43. Woodruff's lack of consistent fast times and strong competition from the other athletes make it unlikely for her to finish higher than seventh.\n\nAnna Ryzhykova is expected to finish in eighth place. While her personal best of 52.96 is respectable, her season's best of 55.41 suggests that she may struggle to keep up with the top contenders. Ryzhykova has shown inconsistent performances throughout the season, including an eighth-place finish with a time of 55.99. Her lack of consistent fast times and strong competition from the other athletes make it unlikely for her to finish higher than eighth.","entrants":[{"firstName":"Femke","lastName":"Bol","id":"14707010","pb":"52.03","sb":"52.30","nat":"NED","hasAvy":true},{"firstName":"Shamier","lastName":"Little","id":"14443767","pb":"52.39","sb":"53.34","nat":"USA","hasAvy":true},{"firstName":"Anna","lastName":"Ryzhykova","id":"14304336","pb":"52.96","sb":"55.41","nat":"UKR","hasAvy":true},{"firstName":"Janieve","lastName":"Russell","id":"14334022","pb":"53.08","sb":"53.72","nat":"JAM","hasAvy":true},{"firstName":"Rushell","lastName":"Clayton","id":"14425208","pb":"53.33","sb":"53.79","nat":"JAM","hasAvy":true},{"firstName":"Gianna","lastName":"Woodruff","id":"14423522","pb":"53.69","sb":"54.46","nat":"PAN","hasAvy":true},{"firstName":"Viktoriya","lastName":"Tkachuk","id":"14426923","pb":"53.76","sb":"54.71","nat":"UKR","hasAvy":true},{"firstName":"Jessie","lastName":"Knight","id":"14430428","pb":"54.09","sb":"54.32","nat":"GBR","hasAvy":true}]},"1500m Men":{"date":"2023-07-23T14:14","blurb":"Predicted Finish and Times:\n\n1. Timothy Cheruiyot (KEN) - 3:28.80\n2. Yared Nuguse (USA) - 3:29.02\n3. Mario García (ESP) - 3:29.18\n4. Azeddine Habz (FRA) - 3:29.26\n5. Narve Gilje Nordås (NOR) - 3:29.47\n6. Oliver Hoare (AUS) - 3:29.60\n7. Stewart McSweyn (AUS) - 3:30.00\n8. Andrew Coscoran (IRL) - 3:30.50\n9. Samuel Tanner (NZL) - 3:31.00\n10. Cole Hocker (USA) - 3:31.30\n11. George Mills (GBR) - 3:31.50\n12. Neil Gourley (GBR) - 3:32.00\n13. Matthew Stonier (GBR) - 3:32.30\n14. Elliot Giles (GBR) - 3:32.60\n15. Adel Mechaal (ESP) - 3:33.00\n16. Erik Sowinski (USA) - 3:34.00\n\nExplanation:\n\nBased on the performances and trends leading up to the London Diamond League track meet, Timothy Cheruiyot is the clear favorite to win. With a personal best of 3:28.28 and a season's best of 3:29.08, he has consistently been one of the fastest middle-distance runners in recent years. His recent victory in Los Angeles, where he ran 3:31.47, shows that he is in great form and capable of running a fast time.\n\nYared Nuguse has also shown impressive performances this season, with a personal best and season's best of 3:29.02. His consistent top-three finishes in various races, including a win in Eugene with a time of 3:35.37, demonstrate his ability to compete at a high level.\n\nMario García has had a solid season, with a personal best and season's best of 3:29.18. While he may not have as many standout performances as some of the other competitors, his consistent finishes in the top five indicate that he is a strong contender.\n\nAzeddine Habz, with a personal best and season's best of 3:29.26, has shown his ability to compete with the best. His victory in Stockholm with a time of 3:38.93 in the indoor season and a fourth-place finish in Rabat with a time of 3:33.90 highlight his potential to challenge for a top spot.\n\nNarve Gilje Nordås has consistently performed well this season, with a personal best and season's best of 3:29.47. His recent victories in Jessheim with times of 3:44.18 and 3:36.45 show his ability to compete at a high level and his potential to challenge for a top finish.\n\nOliver Hoare has a personal best and season's best of 3:29.41, and while he may not have as many standout performances as some of the other competitors, his consistent finishes in the top seven indicate that he is a strong contender.\n\nStewart McSweyn, with a personal best of 3:29.51, has had a mixed season with some strong performances but also some DNFs. However, his recent time of 3:32.85 in Lausanne shows that he still has the potential to compete at a high level.\n\nAndrew Coscoran has consistently performed well this season, with a personal best and season's best of 3:30.42. His recent victory in Nice with a time of 3:32.68 highlights his potential to challenge for a top spot.\n\nSamuel Tanner has shown promise this season, with a personal best and season's best of 3:31.24. His recent third-place finish in Nice with a time of 3:33.15 demonstrates his ability to compete at a high level.\n\nCole Hocker has shown potential this season, with a personal best of 3:31.40. His recent victory in Eugene with a time of 3:39.23 shows his ability to compete at a high level, although his inconsistent performances raise some doubts.\n\nGeorge Mills has consistently performed well this season, with a personal best and season's best of 3:31.54. His recent victory in Manchester with a time of 3:40.57 highlights his potential to challenge for a top spot.\n\nNeil Gourley has had a solid season, with a personal best and season's best of 3:30.88. Although he hasn't had many standout performances, his consistent finishes in the top 10 indicate that he is a strong contender.\n\nMatthew Stonier has shown potential this season, with a personal best of 3:32.50. His recent fourth-place finish in Rehlingen with a time of 3:34.95 demonstrates his ability to compete at a high level.\n\nElliot Giles has had a mixed season, with a personal best of 3:31.56. While he has had some strong performances, his recent 10th-place finish in Chorzów with a time of 3:33.00 raises some doubts about his current form.\n\nAdel Mechaal, with a personal best of 3:30.77, has had a mixed season with some strong performances but also some DNFs. His recent victory in Barcelona with a time of 3:35.67 shows that he still has the potential to compete at a high level.\n\nErik Sowinski, with a personal best of 3:44.82, has not shown the same level of performance as some of the other competitors. His inconsistent finishes and multiple DNFs raise doubts about his ability to compete at a high level.\n\nOverall, Timothy Cheruiyot is the clear favorite based on his consistent performances and recent victory. Yared Nuguse, Mario García, Azeddine Habz, and Narve Gilje Nordås have also shown strong performances and have the potential to challenge for a top spot. The remaining athletes have had mixed performances, with some showing potential but also inconsistencies.","entrants":[{"firstName":"Timothy","lastName":"Cheruiyot","id":"14643526","pb":"3:28.28","sb":"3:29.08","nat":"KEN","hasAvy":true},{"firstName":"Yared","lastName":"Nuguse","id":"14798735","pb":"3:29.02","sb":"3:29.02","nat":"USA","hasAvy":true},{"firstName":"Mario","lastName":"García","id":"14691570","pb":"3:29.18","sb":"3:29.18","nat":"ESP","hasAvy":true},{"firstName":"Azeddine","lastName":"Habz","id":"14640588","pb":"3:29.26","sb":"3:29.26","nat":"FRA","hasAvy":true},{"firstName":"Oliver","lastName":"Hoare","id":"14667553","pb":"3:29.41","sb":"3:29.41","nat":"AUS","hasAvy":true},{"firstName":"Narve Gilje","lastName":"Nordås","id":"14705412","pb":"3:29.47","sb":"3:29.47","nat":"NOR","hasAvy":true},{"firstName":"Stewart","lastName":"McSweyn","id":"14500488","pb":"3:29.51","sb":"3:32.85","nat":"AUS","hasAvy":true},{"firstName":"Andrew","lastName":"Coscoran","id":"14595170","pb":"3:30.42","sb":"3:30.42","nat":"IRL","hasAvy":true},{"firstName":"Adel","lastName":"Mechaal","id":"14376490","pb":"3:30.77","sb":"3:35.67","nat":"ESP","hasAvy":true},{"firstName":"Neil","lastName":"Gourley","id":"14513077","pb":"3:30.88","sb":"3:30.88","nat":"GBR","hasAvy":true},{"firstName":"Samuel","lastName":"Tanner","id":"14785591","pb":"3:31.24","sb":"3:31.24","nat":"NZL","hasAvy":true},{"firstName":"Cole","lastName":"Hocker","id":"14905834","pb":"3:31.40","sb":"3:34.14","nat":"USA","hasAvy":true},{"firstName":"George","lastName":"Mills","id":"14646350","pb":"3:31.54","sb":"3:31.54","nat":"GBR","hasAvy":false},{"firstName":"Elliot","lastName":"Giles","id":"14457638","pb":"3:31.56","sb":"3:31.56","nat":"GBR","hasAvy":true},{"firstName":"Matthew","lastName":"Stonier","id":"14843612","pb":"3:32.50","sb":"3:33.45","nat":"GBR","hasAvy":false},{"firstName":"Erik","lastName":"Sowinski","id":"14360557","pb":"3:44.82","sb":null,"nat":"USA","hasAvy":true}]},"5000m Women":{"date":"2023-07-23T14:27","blurb":"Predicted Finish and Times:\n\n1. Gudaf Tsegay (ETH) - 14:10.00\n2. Sifan Hassan (NED) - 14:15.00\n3. Beatrice Chebet (KEN) - 14:30.00\n4. Alicia Monson (USA) - 14:35.00\n5. Karoline Bjerkeli Grøvdal (NOR) - 14:40.00\n6. Medina Eisa (ETH) - 14:45.00\n7. Mizan Alem (ETH) - 14:50.00\n8. Teresiah Muthoni Gateri (KEN) - 14:55.00\n9. Girmawit Gebrzihair (ETH) - 15:00.00\n10. Maureen Koster (NED) - 15:05.00\n11. Margaret Akidor (KEN) - 15:10.00\n12. Elly Henes (USA) - 15:15.00\n13. Jessica Warner-Judd (GBR) - 15:20.00\n14. Nadia Battocletti (ITA) - 15:25.00\n15. Melknat Wudu (ETH) - 15:30.00\n16. Rose Davies (AUS) - 15:35.00\n17. Megan Keith (GBR) - 15:40.00\n18. Amy-Eloise Markovc (GBR) - 15:45.00\n19. Werkuha Getachew (ETH) - 15:50.00\n20. Birke Haylom (ETH) - 15:55.00\n21. Josette Andrews (USA) - 16:00.00\n\nExplanation:\n\nBased on the available information, Gudaf Tsegay is predicted to win the Women's 5000m at the 2023 London Diamond League track meet. She has shown exceptional performances in various races leading up to the event, including a dominant victory in the 10,000m with a time of 29:29.73. Her consistent strong performances in the 1500m and 3000m events also indicate her readiness for a fast 5000m race. Although her season's best for the 5000m is unknown, her overall form suggests she is in top shape and capable of achieving a time around 14:10.00.\n\nSifan Hassan, the current world record holder in the mile, is expected to challenge Tsegay for the win. While her season's best for the 5000m is also unknown, her recent performances in the marathon and 10,000m demonstrate her endurance and versatility as an athlete. With her speed and ability to close races strongly, she is likely to finish within a few seconds of Tsegay, around 14:15.00.\n\nBeatrice Chebet, the 23-year-old Kenyan, has consistently performed well in the 5000m events this season, including a strong victory in Stockholm with a time of 14:36.52. Her ability to maintain a fast pace and compete against strong fields suggests she will finish in third place with a time of around 14:30.00.\n\nAlicia Monson, the American athlete, has displayed solid performances throughout the season. Her season's best time of 14:34.88 indicates her potential to compete at a high level. However, her recent race in Paris, where she finished eighth with a slower time, raises some concerns about her current form. Nevertheless, she is expected to finish around 14:35.00, securing the fourth position.\n\nKaroline Bjerkeli Grøvdal, the Norwegian athlete, has had mixed results this season. While she finished third in the Half Marathon in New York, her performance in the 5000m in Stockholm, where she did not finish, raises doubts about her readiness for this event. However, her experience and previous personal best of 14:31.07 suggest she can still perform well. She is predicted to finish fifth with a time around 14:40.00.\n\nThe remaining athletes are expected to finish as follows based on their performances and available data:\n\n6. Medina Eisa (ETH) - 14:45.00\n7. Mizan Alem (ETH) - 14:50.00\n8. Teresiah Muthoni Gateri (KEN) - 14:55.00\n9. Girmawit Gebrzihair (ETH) - 15:00.00\n10. Maureen Koster (NED) - 15:05.00\n11. Margaret Akidor (KEN) - 15:10.00\n12. Elly Henes (USA) - 15:15.00\n13. Jessica Warner-Judd (GBR) - 15:20.00\n14. Nadia Battocletti (ITA) - 15:25.00\n15. Melknat Wudu (ETH) - 15:30.00\n16. Rose Davies (AUS) - 15:35.00\n17. Megan Keith (GBR) - 15:40.00\n18. Amy-Eloise Markovc (GBR) - 15:45.00\n19. Werkuha Getachew (ETH) - 15:50.00\n20. Birke Haylom (ETH) - 15:55.00\n21. Josette Andrews (USA) - 16:00.00\n\nThese predictions are based on the athletes' performances throughout the season, their personal bests, and their recent performances in relevant events. However, it's important to note that in long races like the 5000m, athletes' performances may vary, and unexpected results can occur.","entrants":[{"firstName":"Gudaf","lastName":"Tsegay","id":"14595214","pb":"14:13.32","sb":null,"nat":"ETH","hasAvy":true},{"firstName":"Sifan","lastName":"Hassan","id":"14489606","pb":"14:22.12","sb":null,"nat":"NED","hasAvy":true},{"firstName":"Karoline Bjerkeli","lastName":"Grøvdal","id":"14292573","pb":"14:31.07","sb":null,"nat":"NOR","hasAvy":true},{"firstName":"Alicia","lastName":"Monson","id":"14708276","pb":"14:31.11","sb":"14:34.88","nat":"USA","hasAvy":true},{"firstName":"Beatrice","lastName":"Chebet","id":"14749924","pb":"14:34.55","sb":"14:36.52","nat":"KEN","hasAvy":true},{"firstName":"Medina","lastName":"Eisa","id":"14985841","pb":"14:40.02","sb":"14:40.02","nat":"ETH","hasAvy":true},{"firstName":"Josette","lastName":"Andrews","id":"14574966","pb":"14:43.36","sb":"14:43.36","nat":"USA","hasAvy":true},{"firstName":"Margaret","lastName":"Akidor","id":"14798242","pb":"14:44.83","sb":"14:48.91","nat":"KEN","hasAvy":false},{"firstName":"Teresiah Muthoni","lastName":"Gateri","id":"14798246","pb":"14:44.89","sb":"14:57.56","nat":"KEN","hasAvy":true},{"firstName":"Girmawit","lastName":"Gebrzihair","id":"14848733","pb":"14:46.12","sb":"14:46.12","nat":"ETH","hasAvy":false},{"firstName":"Mizan","lastName":"Alem","id":"14848748","pb":"14:46.20","sb":null,"nat":"ETH","hasAvy":true},{"firstName":"Nadia","lastName":"Battocletti","id":"14700830","pb":"14:46.29","sb":"15:01.12","nat":"ITA","hasAvy":true},{"firstName":"Melknat","lastName":"Wudu","id":"14923882","pb":"14:47.48","sb":"14:47.48","nat":"ETH","hasAvy":true},{"firstName":"Elly","lastName":"Henes","id":"14666149","pb":"14:52.87","sb":"14:54.20","nat":"USA","hasAvy":true},{"firstName":"Amy-Eloise","lastName":"Markovc","id":"14404580","pb":"14:56.60","sb":"15:28.66","nat":"GBR","hasAvy":true},{"firstName":"Jessica","lastName":"Warner-Judd","id":"14336301","pb":"14:57.19","sb":"15:06.59","nat":"GBR","hasAvy":true},{"firstName":"Maureen","lastName":"Koster","id":"14372338","pb":"15:00.64","sb":"15:07.11","nat":"NED","hasAvy":true},{"firstName":"Rose","lastName":"Davies","id":"14517594","pb":"15:07.49","sb":"15:10.30","nat":"AUS","hasAvy":true},{"firstName":"Megan","lastName":"Keith","id":"14918707","pb":"15:32.15","sb":"15:32.15","nat":"GBR","hasAvy":true},{"firstName":"Werkuha","lastName":"Getachew","id":"14966550","pb":null,"sb":null,"nat":"ETH","hasAvy":true},{"firstName":"Birke","lastName":"Haylom","id":"15009582","pb":null,"sb":null,"nat":"ETH","hasAvy":true}]},"110m Hurdles Men":{"date":"2023-07-23T14:53","blurb":"Predicted Finish and Times:\n\n1. Grant Holloway (USA) - 12.98\n2. Daniel Roberts (USA) - 13.01\n3. Shunsuke Izumiya (JPN) - 13.04\n4. Hansle Parchment (JAM) - 13.12\n5. Jamal Britt (USA) - 13.14\n6. Freddie Crittenden (USA) - 13.19\n7. Trey Cunningham (USA) - 13.23\n8. Tade Ojora (GBR) - 13.26\n\nExplanation:\n\nGrant Holloway is predicted to win the Men's 110m Hurdles at the 2023 London Diamond League track meet with a time of 12.98. Holloway has had an exceptional season, consistently performing at a high level and securing multiple victories in the event. His personal best of 12.81 is evidence of his speed and technique, and his recent performances, such as his 12.98 in Paris, demonstrate his ability to consistently deliver fast times. With his strong form and experience, Holloway is the favorite to take the top spot.\n\nDaniel Roberts is expected to finish in second place with a time of 13.01. Roberts has also had an impressive season, consistently finishing near the top of the field. His personal best of 13.00 shows his talent and speed, and his recent performances, including his 13.05 in Eugene, highlight his ability to compete at a high level. While he may not have as many wins as Holloway, Roberts' consistent performances and strong personal best make him a strong contender for the second spot.\n\nShunsuke Izumiya is predicted to finish in third place with a time of 13.04. Izumiya has shown great potential this season, with notable wins and strong performances. His personal best of 13.04 is evidence of his speed, and his recent victories, including his 13.04 in Osaka, demonstrate his ability to perform under pressure. While he may not have as much international experience as Holloway and Roberts, Izumiya's consistent performances and strong personal best make him a strong contender for a podium finish.\n\nHansle Parchment is expected to finish in fourth place with a time of 13.12. Parchment, a seasoned athlete with a personal best of 12.94, has had a solid season but has not shown the same level of consistency as the top three contenders. While he has had some strong performances, such as his 13.12 in Kingston, his season's best of 13.12 is slightly slower than the top three contenders. Parchment's experience and talent make him a strong contender, but he will need to deliver a standout performance to challenge for a higher position.\n\nJamal Britt is predicted to finish in fifth place with a time of 13.14. Britt has shown promise this season, with consistent performances and a personal best of 13.08. However, he has not secured as many wins or standout performances as the top contenders. While his recent 13.14 in Atlanta demonstrates his ability to compete at a high level, he will need to deliver a breakthrough performance to challenge for a higher position.\n\nFreddie Crittenden is expected to finish in sixth place with a time of 13.19. Crittenden has had a solid season, with consistent performances and a personal best of 13.00. However, he has not shown the same level of speed and consistency as the top contenders. While his recent performances, including his 13.19 in Phoenix, demonstrate his ability to perform well, he will need to deliver a standout performance to challenge for a higher position.\n\nTrey Cunningham is predicted to finish in seventh place with a time of 13.23. Cunningham has had a decent season, with some strong performances and a personal best of 13.00. However, he has not been as consistent or as fast as the top contenders. While his recent 13.23 in Eugene shows his potential, he will need to deliver a breakthrough performance to challenge for a higher position.\n\nTade Ojora is expected to finish in eighth place with a time of 13.26. Ojora has had a solid season, with consistent performances and a personal best of 13.26. However, he has not shown the same level of speed and consistency as the top contenders. While his recent 13.16 in Manchester demonstrates his ability to perform well, he will need to deliver a standout performance to challenge for a higher position.\n\nOverall, Grant Holloway is the clear favorite to win the Men's 110m Hurdles at the 2023 London Diamond League track meet. His exceptional performances, consistency, and strong personal best make him the athlete to beat. Daniel Roberts and Shunsuke Izumiya are also strong contenders, with their consistent performances and fast times. The remaining athletes, while talented, will need to deliver standout performances to challenge for a higher position.","entrants":[{"firstName":"Grant","lastName":"Holloway","id":"14516985","pb":"12.81","sb":"12.98","nat":"USA","hasAvy":true},{"firstName":"Hansle","lastName":"Parchment","id":"14325570","pb":"12.94","sb":"13.12","nat":"JAM","hasAvy":true},{"firstName":"Freddie","lastName":"Crittenden","id":"14491556","pb":"13.00","sb":"13.19","nat":"USA","hasAvy":true},{"firstName":"Trey","lastName":"Cunningham","id":"14675757","pb":"13.00","sb":"13.23","nat":"USA","hasAvy":true},{"firstName":"Daniel","lastName":"Roberts","id":"14577558","pb":"13.00","sb":"13.01","nat":"USA","hasAvy":true},{"firstName":"Shunsuke","lastName":"Izumiya","id":"14815041","pb":"13.04","sb":"13.04","nat":"JPN","hasAvy":true},{"firstName":"Jamal","lastName":"Britt","id":"14769264","pb":"13.08","sb":"13.14","nat":"USA","hasAvy":true},{"firstName":"Tade","lastName":"Ojora","id":"14720966","pb":"13.26","sb":"13.26","nat":"GBR","hasAvy":true}]},"3000m Steeplechase Women":{"date":"2023-07-23T15:02","blurb":"Predicted Finish and Times:\n\n1. Beatrice Chepkoech (KEN) - 8:58.00\n2. Jackline Chepkoech (KEN) - 9:03.50\n3. Zerfe Wondemagegn (ETH) - 9:05.00\n4. Kristlin Gear (USA) - 9:10.00\n5. Courtney Wayment (USA) - 9:12.00\n6. Elizabeth Bird (GBR) - 9:15.00\n7. Lea Meyer (GER) - 9:18.00\n8. Aimee Pratt (GBR) - 9:20.00\n9. Irene Sánchez-Escribano (ESP) - 9:22.00\n10. Fancy Cherono (KEN) - 9:25.00\n11. Alicja Konieczek (POL) - 9:27.00\n12. Flavie Renouard (FRA) - 9:30.00\n13. Michelle Finn (IRL) - 9:35.00\n14. Poppy Tank (GBR) - 9:40.00\n\nExplanation:\n\nBased on the available data, Beatrice Chepkoech is the clear favorite to win the Women's 3000m Steeplechase at the 2023 London Diamond League track meet. With a personal best of 8:44.32 and consistent performances throughout the season, including victories in several races, Chepkoech has demonstrated her dominance in the event. Her season's best time of 9:05.98 is not indicative of her true capabilities, as she has consistently run faster times in previous races. With her strong finishing kick and experience in the steeplechase, Chepkoech is expected to finish first with a time of around 8:58.\n\nIn second place, Jackline Chepkoech, a rising star at only 19 years old, is predicted to finish with a time of 9:03.50. Although her personal best is slightly slower than Beatrice's, Jackline has shown impressive performances throughout the season, including a second-place finish in the 3000m steeplechase in Italy with a time of 9:04.07. Her consistent top finishes in other races also indicate her potential to challenge for the top spot.\n\nZerfe Wondemagegn from Ethiopia is expected to secure the third-place position with a time of 9:05.00. While her personal best matches Beatrice's, her performances this season have not been as strong. However, her third-place finish in the steeplechase in Italy with a time of 9:04.61 demonstrates her ability to compete at a high level. It is possible that she could challenge for a higher position if she can replicate that performance.\n\nKristlin Gear from the USA is predicted to finish fourth with a time of 9:10.00. Her consistent performances throughout the season, including a first-place finish in the steeplechase in Oregon with a time of 9:12.81, indicate her ability to compete at a high level. However, her personal best is slightly slower than the top three athletes, which puts her in a challenging position to secure a higher finish.\n\nCourtney Wayment, also from the USA, is expected to finish fifth with a time of 9:12.00. While her personal best is faster than Kristlin's, her performances this season have been somewhat inconsistent. However, her second-place finish in the steeplechase in California with a time of 9:11.41 shows her potential to challenge for a higher position if she can replicate that performance.\n\nElizabeth Bird from Great Britain is predicted to finish sixth with a time of 9:15.00. While her season's best time is not available, her performances in other races indicate her competitiveness. Her fourth-place finish in the 1500m in New York with a time of 4:15.81 shows her speed and ability to compete at a high level. However, her personal best in the steeplechase is slower than the top five athletes, which puts her at a disadvantage.\n\nLea Meyer from Germany is expected to finish seventh with a time of 9:18.00. Her season's best time of 9:20.36 is indicative of her capabilities, but she has not shown the same level of consistency as the athletes ranked above her. However, her first-place finish in the 5000m in Germany with a time of 15:26.82 shows her endurance and potential to compete in the steeplechase.\n\nAimee Pratt from Great Britain is predicted to finish eighth with a time of 9:20.00. Her personal best is slightly slower than Lea's, but her performances this season have been more consistent. Her first-place finish in the 3000m in Spain with a time of 8:49.09 shows her speed and ability to compete at a high level. However, her personal best in the steeplechase is slower than the top seven athletes, which puts her at a disadvantage.\n\nIrene Sánchez-Escribano from Spain is expected to finish ninth with a time of 9:22.00. Her season's best time matches her personal best, indicating her potential to compete at a high level. Her first-place finish in the steeplechase in Barcelona with a time of 9:20.04 shows her ability to perform well in the event. However, her performances in other races have not been as strong, which puts her at a disadvantage compared to the athletes ranked above her.\n\nFancy Cherono from Kenya is predicted to finish tenth with a time of 9:25.00. While her personal best is faster than the athletes ranked below her, her performances this season have not been as consistent. However, her third-place finish in the steeplechase in Italy with a time of 9:32.93 shows her potential to challenge for a higher position if she can replicate that performance.\n\nAlicja Konieczek from Poland is expected to finish eleventh with a time of 9:27.00. Her consistent performances throughout the season, including a second-place finish in the steeplechase in California with a time of 9:25.51, indicate her ability to compete at a high level. However, her personal best is slightly slower than the top ten athletes, which puts her at a disadvantage.\n\nFlavie Renouard from France is predicted to finish twelfth with a time of 9:30.00. While her personal best matches the athletes ranked above her, her performances this season have not been as strong. However, her consistent top finishes in other races indicate her potential to challenge for a higher position if she can replicate those performances.\n\nMichelle Finn from Ireland is expected to finish thirteenth with a time of 9:35.00. While her personal best is faster than the athletes ranked below her, her performances this season have not been as consistent. However, her second-place finishes in the steeplechase in Germany and France with times of 9:41.16 and 9:42.56, respectively, show her potential to compete at a high level. \n\nPoppy Tank from Great Britain is predicted to finish fourteenth with a time of 9:40.00. While her personal best is slower than the athletes ranked above her, her performances this season have been inconsistent. However, her first-place finish in the steeplechase in Manchester with a time of 10:02.77 shows her potential to compete in the event.\n\nOverall, Beatrice Chepkoech is the favorite to win based on her impressive personal best, consistent performances, and strong finishing kick. Jackline Chepkoech, Zerfe Wondemagegn, Kristlin Gear, and Courtney Wayment are expected to challenge for the top spots based on their performances throughout the season. The remaining athletes have shown potential in their respective races but may face challenges in competing against the top contenders.","entrants":[{"firstName":"Beatrice","lastName":"Chepkoech","id":"14383286","pb":"8:44.32","sb":"9:05.98","nat":"KEN","hasAvy":true},{"firstName":"Jackline","lastName":"Chepkoech","id":"14989892","pb":"9:02.43","sb":"9:04.07","nat":"KEN","hasAvy":true},{"firstName":"Zerfe","lastName":"Wondemagegn","id":"14894854","pb":"9:04.61","sb":"9:04.61","nat":"ETH","hasAvy":true},{"firstName":"Elizabeth","lastName":"Bird","id":"14422252","pb":"9:07.87","sb":null,"nat":"GBR","hasAvy":true},{"firstName":"Courtney","lastName":"Wayment","id":"14617090","pb":"9:09.91","sb":"9:11.41","nat":"USA","hasAvy":true},{"firstName":"Kristlin","lastName":"Gear","id":"14694660","pb":"9:12.81","sb":"9:12.81","nat":"USA","hasAvy":false},{"firstName":"Lea","lastName":"Meyer","id":"14509240","pb":"9:15.35","sb":"9:20.36","nat":"GER","hasAvy":false},{"firstName":"Aimee","lastName":"Pratt","id":"14527315","pb":"9:15.64","sb":"9:28.00","nat":"GBR","hasAvy":true},{"firstName":"Irene","lastName":"Sánchez-Escribano","id":"14438470","pb":"9:20.04","sb":"9:20.04","nat":"ESP","hasAvy":true},{"firstName":"Alicja","lastName":"Konieczek","id":"14424786","pb":"9:25.15","sb":"9:25.51","nat":"POL","hasAvy":true},{"firstName":"Fancy","lastName":"Cherono","id":"14798265","pb":"9:27.30","sb":"9:32.93","nat":"KEN","hasAvy":true},{"firstName":"Flavie","lastName":"Renouard","id":"14753918","pb":"9:29.10","sb":"9:29.10","nat":"FRA","hasAvy":false},{"firstName":"Michelle","lastName":"Finn","id":"14414945","pb":"9:29.25","sb":"9:41.16","nat":"IRL","hasAvy":true},{"firstName":"Poppy","lastName":"Tank","id":"14473353","pb":"10:02.77","sb":"10:02.77","nat":"GBR","hasAvy":true}]},"400m Men":{"date":"2023-07-23T15:19","blurb":"Predicted Finish and Times:\n\n1. Wayde van Niekerk (RSA) - 43.85\n2. Bryce Deadmon (USA) - 44.15\n3. Ryan Willie (USA) - 44.35\n4. Vernon Norwood (USA) - 44.45\n5. Matthew Hudson-Smith (GBR) - 44.55\n6. Leungo Scotch (BOT) - 44.95\n7. Alex Haydock-Wilson (GBR) - 45.25\n8. Liemarvin Bonevacia (NED) - 45.45\n\nExplanation:\n\nBased on the performances and season's bests, Wayde van Niekerk is the clear favorite to win the Men's 400m at the 2023 London Diamond League track meet. His personal best of 43.03 and consistent season's bests indicate that he is in top form. Van Niekerk has been dominating his races, consistently finishing first with impressive times. His recent performance of 44.08 at the Stadion Śląski in Chorzów, Poland, shows that he is capable of running even faster and will likely be the one to beat in this race. Therefore, he is predicted to finish first with a time of 43.85.\n\nBryce Deadmon has also been performing well this season, with a personal best and season's best of 44.22. However, his recent performances have not been as strong as van Niekerk's. Although Deadmon won the race in Eugene with a time of 44.22, he finished sixth in Chorzów with a time of 44.81. This inconsistency suggests that he may struggle to match van Niekerk's pace. Therefore, Deadmon is predicted to finish second with a time of 44.15.\n\nRyan Willie has shown great potential this season, with a personal best and season's best of 44.25. His performances in the indoor season were particularly impressive, winning multiple races in the 400m. However, Willie has not been able to replicate his indoor success in the outdoor season, finishing fifth in both Chorzów and Székesfehérvár. Despite this, his consistent performances throughout the season indicate that he has the ability to compete at a high level. Therefore, Willie is predicted to finish third with a time of 44.35.\n\nVernon Norwood has consistently been among the top contenders in the 400m, with a personal best and season's best of 44.35. He has had several strong performances this season, including a second-place finish in Nairobi with a time of 44.68. However, his recent performances in Chorzów and Székesfehérvár were not as impressive, finishing seventh and third respectively. While Norwood has the potential to challenge for a podium finish, his recent performances suggest that he may struggle to keep up with the top contenders. Therefore, he is predicted to finish fourth with a time of 44.45.\n\nMatthew Hudson-Smith has a personal best of 44.35, but his season's best of 44.92 indicates that he has not been in top form. Although he won the race in Manchester with a time of 46.31, his performances in Oslo and Stockholm were not as impressive, finishing fifth and third respectively. Hudson-Smith's inconsistency and slower season's best suggest that he may struggle to keep up with the top contenders in this race. Therefore, he is predicted to finish fifth with a time of 44.55.\n\nLeungo Scotch has shown promise this season, with a personal best and season's best of 44.82. He has consistently finished among the top contenders in his races, including a third-place finish in the Diamond League meet in Chorzów with a time of 44.88. However, his performances in Stockholm and Székesfehérvár were not as strong, finishing sixth and sixth respectively. While Scotch has the potential to challenge for a podium finish, his recent performances suggest that he may struggle to match the pace of the top contenders. Therefore, he is predicted to finish sixth with a time of 44.95.\n\nAlex Haydock-Wilson has a personal best of 45.08, but his season's best of 45.25 indicates that he has not been in top form. Although he won the race in Manchester with a time of 46.78, his performances in Marseille and Eton were not as impressive, finishing fourth and fourth respectively. Haydock-Wilson's slower season's best and recent performances suggest that he may struggle to keep up with the top contenders in this race. Therefore, he is predicted to finish seventh with a time of 45.25.\n\nLiemarvin Bonevacia has a personal best of 44.48, but his season's best of 45.06 indicates that he has not been in top form. His recent performances in Chorzów and Lausanne were not as strong, finishing fifth and fifth respectively. Bonevacia's slower season's best and recent performances suggest that he may struggle to keep up with the top contenders in this race. Therefore, he is predicted to finish eighth with a time of 45.45.","entrants":[{"firstName":"Wayde","lastName":"van Niekerk","id":"14417677","pb":"43.03","sb":"44.08","nat":"RSA","hasAvy":true},{"firstName":"Bryce","lastName":"Deadmon","id":"14596460","pb":"44.22","sb":"44.22","nat":"USA","hasAvy":true},{"firstName":"Ryan","lastName":"Willie","id":"14802726","pb":"44.25","sb":"44.25","nat":"USA","hasAvy":true},{"firstName":"Matthew","lastName":"Hudson-Smith","id":"14407278","pb":"44.35","sb":"44.92","nat":"GBR","hasAvy":true},{"firstName":"Vernon","lastName":"Norwood","id":"14490237","pb":"44.35","sb":"44.39","nat":"USA","hasAvy":true},{"firstName":"Liemarvin","lastName":"Bonevacia","id":"14427350","pb":"44.48","sb":"45.06","nat":"NED","hasAvy":true},{"firstName":"Leungo","lastName":"Scotch","id":"14643510","pb":"44.82","sb":"44.82","nat":"BOT","hasAvy":true},{"firstName":"Alex","lastName":"Haydock-Wilson","id":"14735578","pb":"45.08","sb":"45.25","nat":"GBR","hasAvy":true}]},"200m Men":{"date":"2023-07-23T15:29","blurb":"Predicted Finish and Times:\n\n1. Noah Lyles (USA) - 19.67\n2. Erriyon Knighton (USA) - 19.72\n3. Alexander Ogando (DOM) - 19.99\n4. Letsile Tebogo (BOT) - 19.87\n5. Zharnel Hughes (GBR) - 20.14\n6. Joseph Fahnbulleh (LBR) - 20.14\n7. Jona Efoloko (GBR) - 20.49\n\nExplanation:\n\nBased on the performances and season's best times, Noah Lyles is predicted to win the Men's 200m at the 2023 London Diamond League track meet. Lyles has consistently performed well throughout the season, with multiple first-place finishes in both the 100m and 200m events. His season's best time of 19.67 is the fastest among the competitors, and he has shown his ability to perform at a high level in various conditions and competitions.\n\nErriyon Knighton is predicted to finish in second place. Despite being only 19 years old, Knighton has already shown great potential and impressive performances. His season's best time of 19.72 is very close to Lyles' time, indicating his ability to challenge for the top spot. Knighton has consistently placed highly in races and has recorded several first-place finishes. His youth and determination make him a strong contender in this race.\n\nAlexander Ogando is predicted to finish in third place. Although his season's best time of 19.99 is slightly slower than Lyles and Knighton, Ogando has shown consistent performances and has demonstrated his ability to compete at a high level. He has recorded multiple first-place finishes in the 200m event, indicating his competitiveness and speed.\n\nLetsile Tebogo is predicted to finish in fourth place. While his season's best time of 19.87 is on par with the top competitors, Tebogo has not consistently achieved top finishes in races. However, his recent first-place finish in the 400m event shows his versatility and potential to perform well in the 200m.\n\nZharnel Hughes and Joseph Fahnbulleh are predicted to finish in fifth and sixth place, respectively. Both athletes have season's best times of 20.14, which are slightly slower than the top contenders. Hughes has had strong performances throughout the season, including multiple first-place finishes in the 100m event. However, Fahnbulleh has not consistently achieved top finishes, and his slower times in recent races indicate that he may struggle to keep up with the faster competitors.\n\nJona Efoloko is predicted to finish in seventh place. Despite his strong performances in the indoor season, Efoloko has not been able to replicate the same level of success in outdoor races. His season's best time of 20.49 is significantly slower than the top contenders, indicating that he may struggle to keep pace with the faster athletes in this race.\n\nOverall, the predicted order of finish is based on the athletes' performances throughout the season, with a focus on their season's best times and consistency. The top three athletes, Lyles, Knighton, and Ogando, have consistently achieved top finishes and have shown the ability to perform at a high level. The remaining athletes may face challenges in keeping up with the top contenders based on their recent performances and slower times.","entrants":[{"firstName":"Noah","lastName":"Lyles","id":"14536762","pb":"19.31","sb":"19.67","nat":"USA","hasAvy":true},{"firstName":"Erriyon","lastName":"Knighton","id":"14897541","pb":"19.49","sb":"19.72","nat":"USA","hasAvy":true},{"firstName":"Joseph","lastName":"Fahnbulleh","id":"14803230","pb":"19.83","sb":"20.14","nat":"LBR","hasAvy":true},{"firstName":"Letsile","lastName":"Tebogo","id":"14883897","pb":"19.87","sb":"19.87","nat":"BOT","hasAvy":true},{"firstName":"Alexander","lastName":"Ogando","id":"14912251","pb":"19.91","sb":"19.99","nat":"DOM","hasAvy":true},{"firstName":"Zharnel","lastName":"Hughes","id":"14414524","pb":"20.02","sb":"20.14","nat":"GBR","hasAvy":true},{"firstName":"Jona","lastName":"Efoloko","id":"14595067","pb":"20.48","sb":"20.49","nat":"GBR","hasAvy":true}]},"100m Women":{"date":"2023-07-23T15:40","blurb":"Predicted Finish and Times:\n\n1. Shericka Jackson (JAM): 10.65\n2. Sha'Carri Richardson (USA): 10.71\n3. Marie-Josée Ta Lou (CIV): 10.75\n4. Dina Asher-Smith (GBR): 10.83\n5. Aleia Hobbs (USA): 10.86\n6. Twanisha Terry (USA): 10.99\n7. Daryll Neita (GBR): 10.97\n8. Anthonique Strachan (BAH): 10.92\n\nExplanation:\n\nBased on the performances and personal bests of the athletes, Shericka Jackson is predicted to win the Women's 100m at the 2023 London Diamond League track meet. Jackson has consistently performed well throughout the season, with a personal best and season's best time of 10.65. Her recent performances in the 100m have been impressive, including a first-place finish with a time of 10.65 at the National Stadium in Kingston. Her consistent wins and improved times indicate that she is in excellent form and capable of winning the race.\n\nSha'Carri Richardson is predicted to finish in second place with a time of 10.71. Richardson has also had a strong season, with a personal best and season's best time of 10.71. Her performances in the 100m have been consistently fast, including a first-place finish with a time of 10.71 at Hayward Field in Eugene. While she has had some impressive wins, Richardson's times have been slightly slower than Jackson's, which is why she is predicted to finish second.\n\nMarie-Josée Ta Lou is predicted to finish in third place with a time of 10.75. Ta Lou has had a solid season, with a personal best and season's best time of 10.72. Although her times are slightly slower than Jackson and Richardson, she has consistently placed well in races and has shown strong performances in the 100m. Her recent first-place finish with a time of 10.75 at Bislett Stadion in Oslo demonstrates her ability to compete at a high level.\n\nDina Asher-Smith is predicted to finish in fourth place with a time of 10.83. Asher-Smith has had a decent season, with a personal best of 10.83. While her times are slightly slower than the top three athletes, she has shown consistency in her performances and has the potential to challenge for a higher position. Her recent fourth-place finish with a time of 10.98 at Bislett Stadion in Oslo shows that she is in good form and capable of competing with the top athletes.\n\nAleia Hobbs is predicted to finish in fifth place with a time of 10.86. Hobbs has had a solid season, with a personal best of 10.81. While her times are slightly slower than the top four athletes, she has consistently placed well in races and has the potential to challenge for a higher position. Her recent second-place finish with a time of 10.95 at Drake Stadium in Los Angeles shows that she is capable of competing at a high level.\n\nTwanisha Terry is predicted to finish in sixth place with a time of 10.99. Terry has had a decent season, with a personal best of 10.82. While her times are slightly slower than the top five athletes, she has shown consistency in her performances and has the potential to challenge for a higher position. Her recent fourth-place finish with a time of 10.99 at Stadion Śląski in Chorzów demonstrates her ability to compete against top athletes.\n\nDaryll Neita is predicted to finish in seventh place with a time of 10.97. Neita has had a decent season, with a personal best of 10.90. While her times are slightly slower than the top six athletes, she has shown consistency in her performances and has the potential to challenge for a higher position. Her recent fifth-place finish with a time of 10.98 at Bislett Stadion in Oslo shows that she is capable of competing at a high level.\n\nAnthonique Strachan is predicted to finish in eighth place with a time of 10.92. Strachan has had a solid season, with a personal best of 10.92. While her times are slightly slower than the top seven athletes, she has consistently placed well in races and has the potential to challenge for a higher position. Her recent second-place finish with a time of 10.92 at Bislett Stadion in Oslo demonstrates her ability to compete against top athletes.","entrants":[{"firstName":"Shericka","lastName":"Jackson","id":"14325599","pb":"10.65","sb":"10.65","nat":"JAM","hasAvy":true},{"firstName":"Sha'Carri","lastName":"Richardson","id":"14717691","pb":"10.71","sb":"10.71","nat":"USA","hasAvy":true},{"firstName":"Marie-Josée","lastName":"Ta Lou","id":"14415994","pb":"10.72","sb":"10.75","nat":"CIV","hasAvy":true},{"firstName":"Aleia","lastName":"Hobbs","id":"14430847","pb":"10.81","sb":"10.86","nat":"USA","hasAvy":true},{"firstName":"Twanisha","lastName":"Terry","id":"14553598","pb":"10.82","sb":"10.99","nat":"USA","hasAvy":true},{"firstName":"Dina","lastName":"Asher-Smith","id":"14378282","pb":"10.83","sb":"10.98","nat":"GBR","hasAvy":true},{"firstName":"Daryll","lastName":"Neita","id":"14476603","pb":"10.90","sb":"10.97","nat":"GBR","hasAvy":true},{"firstName":"Anthonique","lastName":"Strachan","id":"14368117","pb":"10.92","sb":"10.92","nat":"BAH","hasAvy":true}]},"800m Women":{"date":"2023-07-23T15:51","blurb":"Predicted Finish and Times:\n\n1. Keely Hodgkinson (GBR) - 1:55.50\n2. Natoya Goule-Toppin (JAM) - 1:57.00\n3. Jemma Reekie (GBR) - 1:57.50\n4. Halimah Nakaayi (UGA) - 1:57.80\n5. Catriona Bisset (AUS) - 1:58.20\n6. Anita Horvat (SLO) - 1:58.50\n7. Raevyn Rogers (USA) - 1:59.00\n8. Sage Hurta-Klecker (USA) - 1:59.50\n9. Diribe Welteji (ETH) - 1:59.80\n10. Rénelle Lamote (FRA) - 2:00.50\n11. Aneta Lemiesz (POL) - 2:02.00\n\nExplanation:\n\nBased on the performances and times throughout the season, Keely Hodgkinson is the clear favorite to win the Women's 800m at the 2023 London Diamond League track meet. She has consistently dominated the field, with impressive victories in various competitions. Her personal best and season's best time of 1:55.77 demonstrates her exceptional speed and endurance.\n\nNatoya Goule-Toppin has also shown strong performances throughout the season, consistently finishing near the top of the field. Although her personal best of 1:56.15 is slightly slower than Hodgkinson's, her season's best of 1:57.90 indicates that she is in good form and capable of challenging for the top spot.\n\nJemma Reekie has had a solid season, consistently finishing in the top three in most races. Her personal best of 1:56.90 and season's best of 1:58.93 show her competitiveness and ability to contend for a podium finish.\n\nHalimah Nakaayi, the reigning Olympic champion, has had a relatively quiet season compared to the other contenders. However, her personal best of 1:57.78 and season's best of 1:57.78 suggest that she still possesses the talent and experience to be a strong competitor in this race.\n\nCatriona Bisset has consistently performed well throughout the season, with several victories and a season's best of 1:58.32. Her ability to maintain a strong pace and finish strongly makes her a contender for a top-five finish.\n\nAnita Horvat has shown steady improvement throughout the season, with impressive performances and victories in various competitions. Her personal best of 1:58.73 and season's best of 1:58.73 indicate that she has the potential to challenge the top contenders.\n\nRaevyn Rogers, although not consistently at the top in recent races, has the pedigree and experience to contend for a top finish. Her personal best of 1:56.81 and season's best of 1:59.83 show her ability to compete at a high level.\n\nSage Hurta-Klecker has had a solid season, consistently finishing in the top five in most races. Her personal best of 1:57.85 and season's best of 1:58.09 indicate her competitiveness and ability to challenge for a top finish.\n\nDiribe Welteji has shown promise throughout the season, with impressive performances in the 1500m. Although her season's best in the 800m is not available, her overall speed and endurance make her a potential top contender.\n\nRénelle Lamote has had a relatively quiet season, with a season's best of 1:59.30. While her performances have not been as strong as some of the other competitors, her experience and ability to compete at a high level cannot be overlooked.\n\nAneta Lemiesz, despite her experience, has struggled throughout the season, failing to finish in several races. Her lack of recent strong performances and slower personal best of 1:59.93 indicate that she may struggle to keep up with the top contenders.\n\nOverall, based on their performances throughout the season, Keely Hodgkinson is the clear favorite to win the Women's 800m at the 2023 London Diamond League track meet. However, Natoya Goule-Toppin, Jemma Reekie, Halimah Nakaayi, and Catriona Bisset are all strong contenders who have demonstrated their ability to compete at a high level.","entrants":[{"firstName":"Keely","lastName":"Hodgkinson","id":"14642894","pb":"1:55.77","sb":"1:55.77","nat":"GBR","hasAvy":true},{"firstName":"Natoya","lastName":"Goule-Toppin","id":"14285696","pb":"1:56.15","sb":"1:57.90","nat":"JAM","hasAvy":true},{"firstName":"Raevyn","lastName":"Rogers","id":"14378260","pb":"1:56.81","sb":"1:59.83","nat":"USA","hasAvy":true},{"firstName":"Jemma","lastName":"Reekie","id":"14533469","pb":"1:56.90","sb":"1:58.93","nat":"GBR","hasAvy":true},{"firstName":"Diribe","lastName":"Welteji","id":"14848719","pb":"1:57.02","sb":null,"nat":"ETH","hasAvy":true},{"firstName":"Halimah","lastName":"Nakaayi","id":"14431159","pb":"1:57.78","sb":"1:57.78","nat":"UGA","hasAvy":true},{"firstName":"Rénelle","lastName":"Lamote","id":"14424718","pb":"1:57.84","sb":"1:59.30","nat":"FRA","hasAvy":true},{"firstName":"Sage","lastName":"Hurta-Klecker","id":"14478094","pb":"1:57.85","sb":"1:58.09","nat":"USA","hasAvy":true},{"firstName":"Catriona","lastName":"Bisset","id":"14463325","pb":"1:58.09","sb":"1:58.32","nat":"AUS","hasAvy":true},{"firstName":"Anita","lastName":"Horvat","id":"14472475","pb":"1:58.73","sb":"1:58.73","nat":"SLO","hasAvy":true},{"firstName":"Aneta","lastName":"Lemiesz","id":"14294016","pb":"1:59.93","sb":null,"nat":"POL","hasAvy":false}]}}}