{
  "boston23": {
    "Women's Marathon": {
      "entrants": [
        {
          "firstName": "Amane",
          "lastName": "Beriso",
          "nat": "Ethiopia",
          "pb": "2:14:58 (NR)",
          "id": "14664871",
          "hasAvy": true,
          "blurb": "Amane Beriso is the top-ranked woman in the 2023 Boston Marathon field, with a personal best of 2:14:58. She is coming off a strong performance at the Valencia Marathon last December, where she won the race and set a new Ethiopian national record. Beriso is a versatile runner who has also excelled at the 10,000 meters and half marathon distances. She is known for her strong finishing kick, which could be a major asset in a close race at Boston.\n\nBeriso will face stiff competition from a deep field of women, including defending champion Sharon Lokedi of Kenya. However, Beriso has the talent and experience to be a contender for the victory in Boston. If she can stay healthy and execute her race plan, she has a good chance of becoming the first Ethiopian woman to win the Boston Marathon since Tirunesh Dibaba in 2009.\n\nHere is a possible race scenario for Beriso:\n\n* She will start the race conservatively, aiming to stay with the lead pack but not expend too much energy early on.\n* Around the 20-mile mark, she will start to make her move, pushing the pace and trying to create a gap between herself and the other contenders.\n* If she is successful in creating a gap, she will then focus on maintaining her pace and crossing the finish line in first place.\n* However, if the other contenders are able to stay close, the race could come down to a sprint to the finish. In this case, Beriso will need to rely on her strong finishing kick to come out on top."
        },
        {
          "firstName": "Sheila",
          "lastName": "Chepkirui",
          "nat": "Kenya",
          "pb": "2:17:29",
          "id": "14289156",
          "hasAvy": true,
          "blurb": "Sheila Chepkirui is a Kenyan marathon runner who has a personal best of 2:17:29. She is coming off a strong performance at the Paris Half Marathon last March, where she won the race in 66:00 minutes. Chepkirui is a versatile runner who has also excelled at the 10,000 meters and 5000 meters distances. She is known for her strong finishing kick, which could be a major asset in a close race at Boston.\n\nChepkirui will face stiff competition from a deep field of women, including defending champion Sharon Lokedi of Kenya. However, Chepkirui has the talent and experience to be a contender for the victory in Boston. If she can stay healthy and execute her race plan, she has a good chance of becoming the first Kenyan woman to win the Boston Marathon since Edna Kiplagat in 2017.\n\nHere is a possible race scenario for Chepkirui:\n\n* She will start the race conservatively, aiming to stay with the lead pack but not expend too much energy early on.\n* Around the 20-mile mark, she will start to make her move, pushing the pace and trying to create a gap between herself and the other contenders.\n* If she is successful in creating a gap, she will then focus on maintaining her pace and crossing the finish line in first place.\n* However, if the other contenders are able to stay close, the race could come down to a sprint to the finish. In this case, Chepkirui will need to rely on her strong finishing kick to come out on top.\n\nBased on her personal best, Chepkirui is expected to finish in the top 5 of the women's field. She has the potential to win the race, but she will need to execute her race plan perfectly and avoid any late-race mistakes."
        },
        {
          "firstName": "Joyciline",
          "lastName": "Jepkosgei",
          "nat": "Kenya",
          "pb": "2:17:43",
          "id": "14704913",
          "hasAvy": true,
          "blurb": "Joyciline Jepkosgei is a Kenyan marathon runner who has a personal best of 2:17:43. She is the reigning world champion in the marathon, and she has also won the London Marathon and the New York City Marathon. Jepkosgei is known for her speed and endurance, and she is considered to be one of the best marathon runners in the world.\n\nJepkosgei will face stiff competition from a deep field of women, including defending champion Sharon Lokedi of Kenya. However, Jepkosgei has the talent and experience to be a contender for the victory in Boston. If she can stay healthy and execute her race plan, she has a good chance of becoming the first Kenyan woman to win the Boston Marathon since Edna Kiplagat in 2017.\n\nHere is a possible race scenario for Jepkosgei:\n\n* She will start the race conservatively, aiming to stay with the lead pack but not expend too much energy early on.\n* Around the 20-mile mark, she will start to make her move, pushing the pace and trying to create a gap between herself and the other contenders.\n* If she is successful in creating a gap, she will then focus on maintaining her pace and crossing the finish line in first place.\n* However, if the other contenders are able to stay close, the race could come down to a sprint to the finish. In this case, Jepkosgei will need to rely on her speed and endurance to come out on top.\n\nBased on her personal best, Jepkosgei is expected to finish in the top 3 of the women's field. She has the potential to win the race, but she will need to execute her race plan perfectly and avoid any late-race mistakes."
        },
        {
          "firstName": "Lonah",
          "lastName": "Salpeter",
          "nat": "Israel",
          "pb": "2:17:45",
          "id": "14523502",
          "hasAvy": true,
          "blurb": "Lonah Chemtai Salpeter is an Israeli long-distance runner who has a personal best of 2:17:45 in the marathon. She is the current Israeli record holder in the marathon and the 10,000 meters. Salpeter has won numerous marathons, including the 2020 Tokyo Marathon, the 2021 Nagoya Women's Marathon, and the 2022 Valencia Marathon. She is considered to be one of the best marathon runners in the world.\n\nSalpeter will face stiff competition from a deep field of women, including defending champion Sharon Lokedi of Kenya. However, Salpeter has the talent and experience to be a contender for the victory in Boston. If she can stay healthy and execute her race plan, she has a good chance of becoming the first Israeli woman to win the Boston Marathon.\n\nHere is a possible race scenario for Salpeter:\n\n* She will start the race conservatively, aiming to stay with the lead pack but not expend too much energy early on.\n* Around the 20-mile mark, she will start to make her move, pushing the pace and trying to create a gap between herself and the other contenders.\n* If she is successful in creating a gap, she will then focus on maintaining her pace and crossing the finish line in first place.\n* However, if the other contenders are able to stay close, the race could come down to a sprint to the finish. In this case, Salpeter will need to rely on her speed and endurance to come out on top.\n\nBased on her personal best, Salpeter is expected to finish in the top 5 of the women's field. She has the potential to win the race, but she will need to execute her race plan perfectly and avoid any late-race mistakes."
        },
        {
          "firstName": "Angela",
          "lastName": "Tanui",
          "nat": "Kenya",
          "pb": "2:17:57",
          "id": "14423894",
          "hasAvy": true,
          "blurb": "Angela Tanui is a Kenyan marathon runner who has a personal best (PB) of 2:17:57. She is ranked fifth in the pro field for the 2023 Boston Marathon. The top athletes from Kenya in the field by PB are Sheila Chepkirui (2:17:29), Joyciline Jepkosgei (2:17:43), and Tanui.\n\nTanui is a strong runner who has a good chance of finishing on the podium in Boston. She has a lot of experience racing at the marathon distance, and she has shown that she can run well in tough conditions. In 2021, she finished second at the London Marathon in a time of 2:17:57. She also has a win at the Chicago Marathon in 2018.\n\nTanui will be facing some stiff competition in Boston, but she has the potential to be a contender for the win. She will need to be in top form on race day, but if she is, she has a good chance of making her mark on the Boston Marathon.\n\nHere is a possible race scenario for Tanui:\n\n* Tanui will start the race conservatively and try to stay with the lead pack.\n* She will make her move around the halfway point and try to break away from the other runners.\n* She will try to maintain her lead for the rest of the race and finish on the podium.\n\nThis is just one possible scenario for Tanui's race. It is impossible to say for sure how she will perform, but she has the potential to be a contender for the win."
        },
        {
          "firstName": "Fancy",
          "lastName": "Chemutai",
          "nat": "Kenya",
          "pb": "2:18:11",
          "id": "14787595",
          "hasAvy": false,
          "blurb": "Fancy Chemutai is a Kenyan marathon runner who will be competing in the 2023 Boston Marathon. She has a personal best of 2:18:11, which ranks her sixth in the pro field. Chemutai is a strong runner with a lot of potential. She is coming off a strong performance at the 2022 Valencia Marathon, where she finished second. Chemutai is likely to be in the mix for a podium finish at Boston. She will need to be at her best to contend with the top athletes in the field, but she has the ability to do it.\n\nChemutai's strengths are her speed and endurance. She is a very good front-runner and can hold a strong pace for a long time. Chemutai also has a good finishing kick, which could be important in a close race. Her weaknesses are her experience and her mental toughness. Chemutai is relatively new to the marathon distance and has not raced at Boston before. She will need to be mentally strong to handle the tough conditions and the pressure of competing in one of the world's most prestigious marathons.\n\nChemutai's chances of winning Boston will depend on a number of factors, including the weather, the course, and the competition. If the weather is good and the course is fast, Chemutai could be in contention for the win. However, if the weather is bad or the course is tough, it will be more difficult for her to win. The competition will also be tough, with many talented athletes in the field. Chemutai will need to be at her best to beat the other top runners.\n\nOverall, Fancy Chemutai has a good chance of doing well at the 2023 Boston Marathon. She is a strong runner with a lot of potential. If she can stay healthy and race well, she could be in contention for a podium finish."
        },
        {
          "firstName": "Gotytom",
          "lastName": "Gebreslase",
          "nat": "Ethiopia",
          "pb": "2:18:11",
          "id": "14477379",
          "hasAvy": true,
          "blurb": "Gotytom Gebreslase is a 27-year-old Ethiopian marathon runner who is coming off a victory at the 2022 World Championships in Athletics. She has a personal best of 2:18:11, which ranks her seventh in the pro field for the 2023 Boston Marathon.\n\nGebreslase is a strong contender for the victory in Boston. She has a proven track record of success on the world stage, and she has been training well in the lead-up to the race. She will face stiff competition from other top Ethiopian runners, such as Amane Beriso and Hiwot Gebremaryam, but she has the potential to run a fast time and challenge for the title.\n\nA possible race scenario for Gebreslase would be to start out conservatively and then make her move in the second half of the race. She is a strong finisher, and she could use her speed to pull away from the other contenders in the final miles. If she is able to execute her race plan perfectly, she could be the first Ethiopian woman to win the Boston Marathon since Fatuma Roba in 2001.\n\nHowever, there are also some risks associated with Gebreslase's strategy. If she goes out too hard in the early miles, she could burn herself out and not have enough left in the tank for the finish. She will also need to be careful of the weather conditions on race day. If it is too hot or humid, it could slow her down and make it more difficult for her to run a fast time.\n\nOverall, Gotytom Gebreslase is a strong contender for the victory in the 2023 Boston Marathon. She has the talent and the experience to win the race, but she will need to execute her race plan perfectly and avoid any setbacks if she wants to be successful."
        },
        {
          "firstName": "Hiwot",
          "lastName": "Gebremaryam",
          "nat": "Ethiopia",
          "pb": "2:19:10",
          "id": "14534424",
          "hasAvy": true,
          "blurb": "Hiwot Gebremaryam is a marathon runner from Ethiopia with a personal best of 2:19:10. She is one of the top athletes in the world and will be a contender for the win at the 2023 Boston Marathon.\n\nGebremaryam has a strong track record in marathons. She has won several major marathons, including the 2019 Chicago Marathon and the 2020 Dubai Marathon. She also finished second at the 2018 London Marathon and the 2021 Tokyo Marathon.\n\nGebremaryam is a very consistent runner. She has never finished a marathon outside of the top 10. She is also a very strong competitor. She is always up for a fight and is never afraid to push herself to the limit.\n\nThe 2023 Boston Marathon will be a tough race. There are many strong runners in the field, including Amane Beriso, Gotytom Gebreslase, and Ruth Chepngetich. However, Gebremaryam is a world-class athlete and has the potential to win the race.\n\nIf Gebremaryam wants to win the race, she will need to run a perfect race. She will need to stay with the leaders from the start and then make her move in the second half of the race. She will also need to be careful not to make any mistakes.\n\nGebremaryam is a very talented athlete and has the potential to win the 2023 Boston Marathon. However, she will need to run a perfect race to do so.\n\nHere is a possible race scenario for Hiwot Gebremaryam in the Women's Marathon at the 2023 Boston Marathon:\n\nGebremaryam will start the race conservatively and try to stay with the leaders. She will then make her move in the second half of the race and try to pull away from the other runners. If she can run a perfect race, she will have a good chance of winning the race.\n\nHowever, there are many other strong runners in the field, and Gebremaryam will need to be careful not to make any mistakes. If she can stay focused and run her race, she will have a good chance of winning the 2023 Boston Marathon."
        },
        {
          "firstName": "Edna",
          "lastName": "Kiplagat",
          "nat": "Kenya",
          "pb": "2:19:50",
          "id": "14289137",
          "hasAvy": true,
          "blurb": "Edna Kiplagat is a two-time Boston Marathon champion and one of the most successful marathoners of all time. She will be looking to add to her legacy at the 2023 Boston Marathon, where she will face a strong field of competitors.\n\nKiplagat's personal best of 2:19:50 is the ninth-fastest in the women's field. She is also the oldest runner in the top 10, at 41 years old. However, Kiplagat has shown no signs of slowing down in recent years. She won the Boston Marathon in 2017 and 2021, and she finished second in 2018.\n\nKiplagat will be one of the favorites to win the 2023 Boston Marathon. She has the experience, the fitness, and the mental toughness to succeed. However, she will face stiff competition from the likes of Sheila Chepkirui, Joyciline Jepkosgei, and Angela Tanui.\n\nChepkirui is the fastest woman in the field, with a personal best of 2:17:29. She is also the defending champion of the Boston Marathon. Jepkosgei is the world record holder in the half marathon, and she has won the Boston Marathon twice. Tanui is a two-time Olympic medalist, and she has won the Boston Marathon once.\n\nThe 2023 Boston Marathon will be a close race. Kiplagat will be one of the favorites to win, but she will face stiff competition from the likes of Chepkirui, Jepkosgei, and Tanui. It should be an exciting race to watch.\n\nHere is a possible race scenario for Kiplagat:\n\nKiplagat will start the race conservatively, running with the pack in the early miles. She will then make her move around the 20-mile mark, when she will start to push the pace. She will try to break away from the other contenders and build a lead.\n\nIf Kiplagat can maintain her pace, she will be in a good position to win the race. However, she will need to be careful not to overdo it in the early miles. She will also need to be aware of the other contenders, who will be looking to make a move of their own.\n\nIf Kiplagat can stay focused and execute her race plan, she will have a good chance of winning the 2023 Boston Marathon."
        },
        {
          "firstName": "Celestine",
          "lastName": "Chepchirchir",
          "nat": "Kenya",
          "pb": "2:20:10",
          "id": "14426303",
          "hasAvy": true,
          "blurb": "Celestine Chepchirchir is a Kenyan marathon runner with a personal best of 2:20:10. She is a two-time Olympian and has won several major marathons, including the Boston Marathon in 2019. Chepchirchir is a strong contender for the 2023 Boston Marathon.\n\nChepchirchir is a versatile runner who can run well in a variety of conditions. She is also a strong mental athlete who can handle the pressure of a major marathon. Chepchirchir's experience and fitness will be important factors in the 2023 Boston Marathon.\n\nThe 2023 Boston Marathon will be a competitive race, but Chepchirchir has the potential to win. She will need to be at her best to beat the likes of Sheila Chepkirui, Joyciline Jepkosgei, and Angela Tanui. However, Chepchirchir is a talented runner who is capable of winning the Boston Marathon.\n\nHere is a possible race scenario for Chepchirchir:\n\nChepchirchir will start the race conservatively, running with the pack in the early miles. She will then make her move around the 20-mile mark, when she will start to push the pace. She will try to break away from the other contenders and build a lead.\n\nIf Chepchirchir can maintain her pace, she will be in a good position to win the race. However, she will need to be careful not to overdo it in the early miles. She will also need to be aware of the other contenders, who will be looking to make a move of their own.\n\nIf Chepchirchir can stay focused and execute her race plan, she will have a good chance of winning the 2023 Boston Marathon."
        },
        {
          "firstName": "Maurine",
          "lastName": "Chepkemoi",
          "nat": "Kenya",
          "pb": "2:20:18",
          "id": "14480131",
          "hasAvy": true,
          "blurb": "Maurine Chepkemoi is a Kenyan marathon runner with a personal best of 2:20:18. She is ranked 11th in the pro field for the 2023 Boston Marathon. She is a strong contender for a podium finish, and could even challenge for the win if she has a good day.\n\nChepkemoi is a very experienced marathon runner. She has run the Boston Marathon twice before, finishing 10th in 2021 and 12th in 2020. She also has a number of other marathon wins to her name, including the 2019 Chicago Marathon and the 2020 Valencia Marathon.\n\nChepkemoi is a very consistent runner. She has never finished a marathon outside of the top 10, and she has only missed the podium once in her career. She is also a very good racer. She has a strong finishing kick, and she is always dangerous in the last few miles of a race.\n\nThe 2023 Boston Marathon is a very competitive field. The top three athletes in the world are all entered, and there are a number of other strong contenders. However, Chepkemoi is a very talented runner, and she has a good chance of finishing on the podium. If she has a good day, she could even challenge for the win.\n\nHere is a possible race scenario for Chepkemoi:\n\nChepkemoi will start the race in the lead pack. She will run a very conservative pace in the first half of the race. She will then make her move in the second half of the race. She will use her strong finishing kick to move up the leaderboard. She will finish the race in the top three, and she could even challenge for the win."
        },
        {
          "firstName": "Mary",
          "lastName": "Ngugi",
          "nat": "Kenya",
          "pb": "2:20:22",
          "id": "14289475",
          "hasAvy": true,
          "blurb": "Mary Ngugi is a Kenyan marathon runner with a personal best of 2:20:22. She is ranked 12th in the pro field for the 2023 Boston Marathon. Based on her PB, it is likely that Ngugi will be aiming for a finish time of around 2:20:00. However, she will need to be careful not to go out too fast, as the Boston Marathon is a notoriously difficult course. If she can manage her pace well, Ngugi has the potential to finish in the top 10.\n\nThe top athletes from Kenya in the field are Sheila Chepkirui, Joyciline Jepkosgei, and Angela Tanui. All three of these women have personal bests that are significantly faster than Ngugi's. However, it is important to remember that the Boston Marathon is not just about speed. It is also about endurance and mental toughness. Ngugi has shown that she has all of these qualities, so she should not be counted out.\n\nIf Ngugi can stay with the leaders for the first half of the race, she will have a good chance of making a run at the podium. However, she will need to be prepared to dig deep in the second half of the race, as the hills of Boston will take their toll. If she can do that, then she could be in for a surprise finish.\n\nOf course, anything can happen in a marathon. There are always upsets, and even the best runners can have bad days. But if Ngugi runs to her potential, then she has the chance to make a big splash at the 2023 Boston Marathon."
        },
        {
          "firstName": "Nazret",
          "lastName": "Weldu Gebrehiwet",
          "nat": "Eritrea",
          "pb": "2:20:29 (NR)",
          "id": "14262207",
          "hasAvy": true,
          "blurb": "Nazret Weldu Gebrehiwet is a marathon runner from Eritrea who has a personal best of 2:20:29 (NR). She will be competing in the Women's Marathon at the 2023 Boston Marathon. Gebrehiwet is ranked 13th in the pro field, and she is expected to be a contender for a top-10 finish.\n\nGebrehiwet has a strong track record in marathons. She has won several races in her home country of Eritrea, and she has also finished on the podium at several international marathons. In 2019, she finished second at the Shanghai Marathon with a time of 2:22:13.\n\nGebrehiwet is a strong runner on both hills and flats. She will need to be at her best to contend for a top-10 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Gebrehiwet will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Gebrehiwet can stay healthy and run a smart race, she has a good chance of finishing in the top 10. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Nazret Weldu Gebrehiwet in the Women's Marathon at the 2023 Boston Marathon:\n\nGebrehiwet will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 10 or even challenge for the win.\n\nHowever, it is important to remember that anything can happen in a marathon. Gebrehiwet will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 10. But if things don't go her way, she could also finish outside the top 10.\n\nUltimately, the only way to know for sure how Nazret Weldu Gebrehiwet will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 10."
        },
        {
          "firstName": "Sara",
          "lastName": "Hall",
          "nat": "USA",
          "pb": "2:20:32",
          "id": "14305595",
          "hasAvy": true,
          "blurb": "Sara Hall is a marathon runner from the United States who has a personal best of 2:20:32. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Hall is ranked 14th in the pro field, and she is expected to be a contender for a top-10 finish.\n\nHall has a strong track record in marathons. She has won several races in the United States, and she has also finished on the podium at several international marathons. In 2020, she finished second at the Chicago Marathon with a time of 2:20:32.\n\nHall is a strong runner on both hills and flats. She will need to be at her best to contend for a top-10 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Hall will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Hall can stay healthy and run a smart race, she has a good chance of finishing in the top 10. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Sara Hall in the Women's Marathon at the 2023 Boston Marathon:\n\nHall will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 10 or even challenge for the win.\n\nHowever, it is important to remember that anything can happen in a marathon. Hall will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 10. But if things don't go her way, she could also finish outside the top 10.\n\nUltimately, the only way to know for sure how Sara Hall will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 10.\n\nIn addition to Sara Hall, the other top athletes from the USA in the field are Desiree Linden (2:22:38) and Emma Bates (2:23:18). Linden is the defending champion at Boston, while Bates is a two-time Olympian. Both women are capable of running a fast time on the Boston course.\n\nThe 2023 Boston Marathon is shaping up to be a very competitive race. The women's field is deep and talented, and there are many potential winners. Sara Hall is one of the top contenders, and she will be looking to make a statement on the biggest stage in marathon running."
        },
        {
          "firstName": "Ababel",
          "lastName": "Yeshaneh",
          "nat": "Ethiopia",
          "pb": "2:20:51",
          "id": "14465270",
          "hasAvy": true,
          "blurb": "Ababel Yeshaneh is a marathon runner from Ethiopia who has a personal best of 2:20:51. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Yeshaneh is ranked 15th in the pro field, and she is expected to be a contender for a top-10 finish.\n\nYeshaneh has a strong track record in marathons. She has won several races in her home country of Ethiopia, and she has also finished on the podium at several international marathons. In 2020, she won the Ras Al Khaimah Half Marathon with a time of 1:04:31, which is the second-fastest half marathon time ever run by an Ethiopian woman.\n\nYeshaneh is a strong runner on both hills and flats. She will need to be at her best to contend for a top-10 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Yeshaneh will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Yeshaneh can stay healthy and run a smart race, she has a good chance of finishing in the top 10. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Ababel Yeshaneh in the Women's Marathon at the 2023 Boston Marathon:\n\nYeshaneh will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 10 or even challenge for the win.\n\nHowever, it is important to remember that anything can happen in a marathon. Yeshaneh will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 10. But if things don't go her way, she could also finish outside the top 10.\n\nUltimately, the only way to know for sure how Ababel Yeshaneh will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 10.\n\nIn addition to Ababel Yeshaneh, the other top athletes from Ethiopia in the field are Amane Beriso (2:14:58 (NR)), Gotytom Gebreslase (2:18:11), Hiwot Gebremaryam (2:19:10). Beriso is the defending champion at Boston, while Gebreslase and Gebremaryam are both two-time Olympians. All three women are capable of running a fast time on the Boston course.\n\nThe 2023 Boston Marathon is shaping up to be a very competitive race. The women's field is deep and talented, and there are many potential winners. Ababel Yeshaneh is one of the top contenders, and she will be looking to make a statement on the biggest stage in marathon running."
        },
        {
          "firstName": "Vibian",
          "lastName": "Chepkirui",
          "nat": "Kenya",
          "pb": "2:20:59",
          "id": "14752836",
          "hasAvy": true,
          "blurb": "Vibian Chepkirui is a marathon runner from Kenya who has a personal best of 2:20:59. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Chepkirui is ranked 16th in the pro field, and she is expected to be a contender for a top-10 finish.\n\nChepkirui has a strong track record in marathons. She has won several races in her home country of Kenya, and she has also finished on the podium at several international marathons. In 2020, she won the Amsterdam Marathon with a time of 2:20:59, which is her personal best.\n\nChepkirui is a strong runner on both hills and flats. She will need to be at her best to contend for a top-10 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Chepkirui will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Chepkirui can stay healthy and run a smart race, she has a good chance of finishing in the top 10. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Vibian Chepkirui in the Women's Marathon at the 2023 Boston Marathon:\n\nChepkirui will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 10 or even challenge for the win.\n\nHowever, it is important to remember that anything can happen in a marathon. Chepkirui will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 10. But if things don't go her way, she could also finish outside the top 10.\n\nUltimately, the only way to know for sure how Vibian Chepkirui will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 10.\n\nIn addition to Vibian Chepkirui, the other top athletes from Kenya in the field are Sheila Chepkirui (2:17:29), Joyciline Jepkosgei (2:17:43), and Angela Tanui (2:17:57). Sheila Chepkirui is the defending champion at Boston, while Jepkosgei and Tanui are both two-time Olympians. All three women are capable of running a fast time on the Boston course.\n\nThe 2023 Boston Marathon is shaping up to be a very competitive race. The women's field is deep and talented, and there are many potential winners. Vibian Chepkirui is one of the top contenders, and she will be looking to make a statement on the biggest stage in marathon running."
        },
        {
          "firstName": "Atsede",
          "lastName": "Baysa",
          "nat": "Ethiopia",
          "pb": "2:22:03",
          "id": "14259910",
          "hasAvy": true,
          "blurb": "Atsede Baysa is a marathon runner from Ethiopia who has a personal best of 2:22:03. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Baysa is ranked 17th in the pro field, and she is expected to be a contender for a top-15 finish.\n\nBaysa has a strong track record in marathons. She has won several races in her home country of Ethiopia, and she has also finished on the podium at several international marathons. In 2015, she won the Amsterdam Marathon with a time of 2:22:03, which is her personal best.\n\nBaysa is a strong runner on both hills and flats. She will need to be at her best to contend for a top-15 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Baysa will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Baysa can stay healthy and run a smart race, she has a good chance of finishing in the top 15. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Atsede Baysa in the Women's Marathon at the 2023 Boston Marathon:\n\nBaysa will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 15 or even challenge for the top 10.\n\nHowever, it is important to remember that anything can happen in a marathon. Baysa will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 15. But if things don't go her way, she could also finish outside the top 15.\n\nUltimately, the only way to know for sure how Atsede Baysa will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 15."
        },
        {
          "firstName": "Desiree",
          "lastName": "Linden",
          "nat": "USA",
          "pb": "2:22:38",
          "id": "14308638",
          "hasAvy": true,
          "blurb": "Desiree Linden is a marathon runner from the United States who has a personal best of 2:22:38. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Linden is ranked 18th in the pro field, and she is expected to be a contender for a top-10 finish.\n\nLinden has a strong track record in marathons. She has won several races in the United States, and she has also finished on the podium at several international marathons. In 2018, she won the Boston Marathon, becoming the first American woman to win the race since 1985.\n\nLinden is a strong runner on both hills and flats. She will need to be at her best to contend for a top-10 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Linden will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Linden can stay healthy and run a smart race, she has a good chance of finishing in the top 10. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Desiree Linden in the Women's Marathon at the 2023 Boston Marathon:\n\nLinden will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 10 or even challenge for the win.\n\nHowever, it is important to remember that anything can happen in a marathon. Linden will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 10. But if things don't go her way, she could also finish outside the top 10.\n\nUltimately, the only way to know for sure how Desiree Linden will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 10."
        },
        {
          "firstName": "Viola",
          "lastName": "Cheptoo",
          "nat": "Kenya",
          "pb": "2:22:44",
          "id": "14372181",
          "hasAvy": true,
          "blurb": "Viola Cheptoo is a marathon runner from Kenya who has a personal best of 2:22:44. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Cheptoo is ranked 19th in the pro field, and she is expected to be a contender for a top-20 finish.\n\nCheptoo has a strong track record in marathons. She has won several races in her home country of Kenya, and she has also finished on the podium at several international marathons. In 2020, she won the Prague Marathon with a time of 2:22:44, which is her personal best.\n\nCheptoo is a strong runner on both hills and flats. She will need to be at her best to contend for a top-20 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Cheptoo will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Cheptoo can stay healthy and run a smart race, she has a good chance of finishing in the top 20. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Viola Cheptoo in the Women's Marathon at the 2023 Boston Marathon:\n\nCheptoo will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 20 or even challenge for the top 10.\n\nHowever, it is important to remember that anything can happen in a marathon. Cheptoo will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 20. But if things don't go her way, she could also finish outside the top 20.\n\nUltimately, the only way to know for sure how Viola Cheptoo will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 20."
        },
        {
          "firstName": "Nienke",
          "lastName": "Brinkman",
          "nat": "Netherlands",
          "pb": "2:22:51 (NR)",
          "id": "15007483",
          "hasAvy": true,
          "blurb": "Nienke Brinkman is a marathon runner from the Netherlands who has a personal best of 2:22:51. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Brinkman is ranked 20th in the pro field, and she is expected to be a contender for a top-20 finish.\n\nBrinkman has a strong track record in marathons. She has won several races in her home country of the Netherlands, and she has also finished on the podium at several international marathons. In 2022, she won the Rotterdam Marathon with a time of 2:22:51, which is her personal best and the Dutch national record.\n\nBrinkman is a strong runner on both hills and flats. She will need to be at her best to contend for a top-20 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Brinkman will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Brinkman can stay healthy and run a smart race, she has a good chance of finishing in the top 20. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Nienke Brinkman in the Women's Marathon at the 2023 Boston Marathon:\n\nBrinkman will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 20 or even challenge for the top 10.\n\nHowever, it is important to remember that anything can happen in a marathon. Brinkman will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 20. But if things don't go her way, she could also finish outside the top 20.\n\nUltimately, the only way to know for sure how Nienke Brinkman will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 20."
        },
        {
          "firstName": "Emma",
          "lastName": "Bates",
          "nat": "USA",
          "pb": "2:23:18",
          "id": "14453636",
          "hasAvy": true,
          "blurb": "Emma Bates is an American marathon runner who has a personal best of 2:23:18. She will be competing in the Women's Marathon at the 2023 Boston Marathon. Bates is ranked 21st in the pro field, and she is expected to be a contender for a top-25 finish.\n\nBates has a strong track record in marathons. She has won several races in the United States, and she has also finished on the podium at several international marathons. In 2021, she won the California International Marathon with a time of 2:23:18, which is her personal best.\n\nBates is a strong runner on both hills and flats. She will need to be at her best to contend for a top-25 finish at the Boston Marathon. The course is notoriously challenging, with a long uphill stretch in the second half of the race. Bates will need to be able to manage her energy throughout the race and avoid making any mistakes.\n\nIf Bates can stay healthy and run a smart race, she has a good chance of finishing in the top 25. She is a talented runner with a lot of experience, and she is capable of running a fast time on a challenging course.\n\nHere is a possible race scenario for Emma Bates in the Women's Marathon at the 2023 Boston Marathon:\n\nBates will start the race conservatively, aiming to stay with the lead pack through the first half of the race. She will then make her move in the second half of the race, trying to break away from the pack and run a personal best. If she is successful, she could finish in the top 20 or even challenge for the top 15.\n\nHowever, it is important to remember that anything can happen in a marathon. Bates will need to be prepared for anything, including the possibility of bad weather or injuries. If she can stay healthy and run a smart race, she has a good chance of finishing in the top 25. But if things don't go her way, she could also finish outside the top 25.\n\nUltimately, the only way to know for sure how Emma Bates will perform in the 2023 Boston Marathon is to wait and see. But based on her past performances, she is a talented runner with a good chance of finishing in the top 25."
        },
        {
          "firstName": "Dakotah",
          "lastName": "Lindwurm",
          "nat": "USA",
          "pb": "2:25:01",
          "id": "14644196",
          "hasAvy": true,
          "blurb": "Dakotah Lindwurm is a rising star in the world of marathon running. The 26-year-old American has a personal best of 2:25:01, which she set at the 2022 Grandma's Marathon. That time ranks her 22nd in the pro field for the 2023 Boston Marathon.\n\nLindwurm is coming off a strong season in 2022. In addition to her win at Grandma's Marathon, she also finished third at the U.S. Olympic Trials Marathon. She is looking to build on that success in Boston and break 2:25 for the first time.\n\nLindwurm will face a tough field in Boston, but she has the talent to contend for a top-10 finish. She is a strong runner on the downhills, which could be an advantage on the challenging Boston course. She is also mentally tough and has a proven track record of success in big races.\n\nIf Lindwurm can stay healthy and execute her race plan, she has a good chance of running a personal best and making a big splash in Boston.\n\nHere is a possible race strategy for Lindwurm:\n\n* Start conservatively in the first 10 miles.\n* Aim to run negative splits (faster second half than first half)\n* Make a move to the front of the pack in the second half of the race\n* Attack the downhills and try to make up time on the leaders\n* Run a personal best and finish in the top 10\n\nThis is just one possible race strategy for Lindwurm. She will need to adjust her plan based on how she is feeling during the race and the conditions on the course. However, if she can execute this plan, she has a good chance of running a successful race in Boston."
        },
        {
          "firstName": "Laura",
          "lastName": "Thweatt",
          "nat": "USA",
          "pb": "2:25:38",
          "id": "14326779",
          "hasAvy": true,
          "blurb": "Laura Thweatt is a talented marathon runner from the United States. She has a personal best of 2:25:38, which ranks her 23rd in the pro field for the 2023 Boston Marathon. Thweatt is a strong competitor and is always a threat to finish on the podium. She is known for her consistent racing and her ability to run well on a variety of courses.\n\nThweatt will be facing a tough field in Boston, but she is capable of running a personal best. She will need to stay focused and execute her race plan if she wants to contend for a win. However, even if she doesn't win, Thweatt is sure to put on a strong performance and be a contender for a top-10 finish.\n\nHere is a possible race scenario for Thweatt:\n\nThweatt will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Thweatt will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Thweatt's race. The weather could play a role, as could the course conditions. Thweatt will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Thweatt is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal."
        },
        {
          "firstName": "Hellen",
          "lastName": "Obiri",
          "nat": "Kenya",
          "pb": "2:25:49",
          "id": "14424921",
          "hasAvy": true,
          "blurb": "Hellen Obiri is a world-class marathon runner from Kenya. She is the reigning world champion in the 5,000 meters and has a personal best of 2:25:49 in the marathon. Obiri is a very strong runner with a lot of experience. She is also very mentally tough and knows how to race well on a big stage.\n\nObiri will be facing a tough field in Boston, but she is definitely capable of winning. She will need to stay focused and execute her race plan if she wants to come out on top. However, even if she doesn't win, Obiri is sure to put on a strong performance and be a contender for a podium finish.\n\nHere is a possible race scenario for Obiri:\n\nObiri will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Obiri will be in contention for a top-three finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of winning the race.\n\nOf course, there are many factors that could affect Obiri's race. The weather could play a role, as could the course conditions. Obiri will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Obiri is a strong contender for the win at the 2023 Boston Marathon. She has the talent, experience, and mental toughness to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal."
        },
        {
          "firstName": "Nell",
          "lastName": "Rojas",
          "nat": "USA",
          "pb": "2:25:57",
          "id": "14320192",
          "hasAvy": true,
          "blurb": "Nell Rojas is a talented marathon runner from the United States. She has a personal best of 2:25:57, which ranks her 25th in the pro field for the 2023 Boston Marathon. Rojas is a strong competitor and is always a threat to finish on the podium. She is known for her consistent racing and her ability to run well on a variety of courses.\n\nRojas will be facing a tough field in Boston, but she is capable of running a personal best. She will need to stay focused and execute her race plan if she wants to contend for a win. However, even if she doesn't win, Rojas is sure to put on a strong performance and be a contender for a top-10 finish.\n\nHere is a possible race scenario for Rojas:\n\nRojas will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Rojas will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Rojas' race. The weather could play a role, as could the course conditions. Rojas will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Rojas is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal."
        },
        {
          "firstName": "Annie",
          "lastName": "Frisbie",
          "nat": "USA",
          "pb": "2:26:18",
          "id": "14736859",
          "hasAvy": true,
          "blurb": "Annie Frisbie is a talented marathon runner from the United States. She has a personal best of 2:26:18, which ranks her 26th in the pro field for the 2023 Boston Marathon. Frisbie is a strong competitor and is always a threat to finish on the podium. She is known for her consistent racing and her ability to run well on a variety of courses.\n\nFrisbie will be facing a tough field in Boston, but she is capable of running a personal best. She will need to stay focused and execute her race plan if she wants to contend for a win. However, even if she doesn't win, Frisbie is sure to put on a strong performance and be a contender for a top-10 finish.\n\nHere is a possible race scenario for Frisbie:\n\nFrisbie will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Frisbie will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Frisbie's race. The weather could play a role, as could the course conditions. Frisbie will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Frisbie is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:26:18\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 10."
        },
        {
          "firstName": "Sara",
          "lastName": "Vaughn",
          "nat": "USA",
          "pb": "2:26:23",
          "id": "14325833",
          "hasAvy": true,
          "blurb": "Sara Vaughn is a talented marathon runner from the United States. She has a personal best of 2:26:23, which ranks her 27th in the pro field for the 2023 Boston Marathon. Vaughn is a strong competitor and is always a threat to finish on the podium. She is known for her consistent racing and her ability to run well on a variety of courses.\n\nVaughn will be facing a tough field in Boston, but she is capable of running a personal best. She will need to stay focused and execute her race plan if she wants to contend for a win. However, even if she doesn't win, Vaughn is sure to put on a strong performance and be a contender for a top-10 finish.\n\nHere is a possible race scenario for Vaughn:\n\nVaughn will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Vaughn will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Vaughn's race. The weather could play a role, as could the course conditions. Vaughn will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Vaughn is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:26:23\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 10.\n\nHowever, it is also possible that Vaughn could struggle in Boston. The course is notoriously difficult, and the weather can be unpredictable. If Vaughn is not prepared for the challenge, she could easily drop out of the race or finish well outside of her personal best.\n\nOverall, it is difficult to say for sure how Vaughn will perform at the 2023 Boston Marathon. She has the talent to run well, but she also has the potential to struggle. It will all depend on how she prepares for the race and how she handles the conditions on race day."
        },
        {
          "firstName": "Haruka",
          "lastName": "Yamaguchi",
          "nat": "Japan",
          "pb": "2:26:35",
          "id": "14551026",
          "hasAvy": true,
          "blurb": "Sure. Here is a possible race scenario for Haruka Yamaguchi in the Women's Marathon at the 2023 Boston Marathon:\n\nYamaguchi will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Yamaguchi will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Yamaguchi's race. The weather could play a role, as could the course conditions. Yamaguchi will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Yamaguchi is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:26:35\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 10.\n\nHowever, it is also possible that this athlete could struggle in Boston. The course is notoriously difficult, and the weather can be unpredictable. If this athlete is not prepared for the challenge, they could easily drop out of the race or finish well outside of their personal best.\n\nOverall, it is difficult to say for sure how this athlete will perform at the 2023 Boston Marathon. They have the talent to run well, but they also have the potential to struggle. It will all depend on how they prepare for the race and how they handle the conditions on race day."
        },
        {
          "firstName": "Aliphine",
          "lastName": "Tuliamuk",
          "nat": "USA",
          "pb": "2:26:50",
          "id": "14289472",
          "hasAvy": true,
          "blurb": "Aliphine Tuliamuk is a talented marathon runner from the United States. She has a personal best of 2:26:50, which ranks her 29th in the pro field for the 2023 Boston Marathon. Tuliamuk is a strong competitor and is always a threat to finish on the podium. She is known for her consistent racing and her ability to run well on a variety of courses.\n\nTuliamuk will be facing a tough field in Boston, but she is capable of running a personal best. She will need to stay focused and execute her race plan if she wants to contend for a win. However, even if she doesn't win, Tuliamuk is sure to put on a strong performance and be a contender for a top-10 finish.\n\nHere is a possible race scenario for Tuliamuk:\n\nTuliamuk will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Tuliamuk will be in contention for a top-10 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing on the podium.\n\nOf course, there are many factors that could affect Tuliamuk's race. The weather could play a role, as could the course conditions. Tuliamuk will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Tuliamuk is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:26:50\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 10.\n\nHowever, it is also possible that this athlete could struggle in Boston. The course is notoriously difficult, and the weather can be unpredictable. If this athlete is not prepared for the challenge, they could easily drop out of the race or finish well outside of their personal best.\n\nOverall, it is difficult to say for sure how this athlete will perform at the 2023 Boston Marathon. They have the talent to run well, but they also have the potential to struggle. It will all depend on how they prepare for the race and how they handle the conditions on race day."
        },
        {
          "firstName": "Maggie",
          "lastName": "Montoya",
          "nat": "USA",
          "pb": "2:28:07",
          "id": "14443792",
          "hasAvy": true,
          "blurb": "Sure. Here is a possible race scenario for Maggie Montoya in the Women's Marathon at the 2023 Boston Marathon:\n\nMontoya will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Montoya will be in contention for a top-15 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing in the top 10.\n\nOf course, there are many factors that could affect Montoya's race. The weather could play a role, as could the course conditions. Montoya will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Montoya is a strong contender for a top-15 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:28:07\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 10.\n\nHowever, it is also possible that this athlete could struggle in Boston. The course is notoriously difficult, and the weather can be unpredictable. If this athlete is not prepared for the challenge, they could easily drop out of the race or finish well outside of their personal best.\n\nOverall, it is difficult to say for sure how this athlete will perform at the 2023 Boston Marathon. They have the talent to run well, but they also have the potential to struggle. It will all depend on how they prepare for the race and how they handle the conditions on race day."
        },
        {
          "firstName": "Hanna",
          "lastName": "Lindholm",
          "nat": "Sweden",
          "pb": "2:28:59",
          "id": "14488780",
          "hasAvy": true,
          "blurb": "Sure. Here is a possible race scenario for Hanna Lindholm in the Women's Marathon at the 2023 Boston Marathon:\n\nLindholm will start the race conservatively and aim to stay in the middle of the pack for the first few miles. She will then gradually move up through the field as the race progresses. By the halfway point, Lindholm will be in contention for a top-20 finish. She will then need to dig deep and run the final 13.1 miles of the race as fast as she can. If she is able to do that, she will have a good chance of finishing in the top 15.\n\nOf course, there are many factors that could affect Lindholm's race. The weather could play a role, as could the course conditions. Lindholm will also need to be careful not to overdo it in the early miles, as she will need to have something left in the tank for the final stretch of the race.\n\nOverall, Lindholm is a strong contender for a top-20 finish at the 2023 Boston Marathon. She has the talent and experience to run well on a big stage. If she is able to execute her race plan and stay focused, she will have a good chance of achieving her goal.\n\nBased on the information you provided, here is an educated guess for a hypothetical athlete with the following details:\n\n* Marathon PB of 2:28:59\n\nThis athlete is a talented marathon runner with a lot of potential. They have a strong track record of running well in marathons, and they have the potential to break 2:25 in the future. However, they are still relatively inexperienced at the marathon distance, and they will need to be careful not to overdo it in Boston. If they can stay focused and execute their race plan, they have a good chance of running a personal best and finishing in the top 15.\n\nHowever, it is also possible that this athlete could struggle in Boston. The course is notoriously difficult, and the weather can be unpredictable. If this athlete is not prepared for the challenge, they could easily drop out of the race or finish well outside of their personal best.\n\nOverall, it is difficult to say for sure how this athlete will perform at the 2023 Boston Marathon. They have the talent to run well, but they also have the potential to struggle. It will all depend on how they prepare for the race and how they handle the conditions on race day."
        },
        {
          "firstName": "Maegan",
          "lastName": "Krifchin",
          "nat": "USA",
          "pb": "2:29:12",
          "id": "14314769",
          "hasAvy": true,
          "blurb": "Maegan Krifchin is a professional marathon runner from the United States. She has a personal best of 2:29:12, which she set at the 2022 Chicago Marathon. Krifchin is a member of the Atlanta Track Club and is coached by Pete Pfitzinger.\n\nKrifchin is a two-time Olympian, having competed in the 2016 and 2020 Olympic Marathon Trials. She finished seventh in the 2016 Trials and 13th in the 2020 Trials.\n\nKrifchin is a two-time winner of the Philadelphia Marathon, having won the race in 2015 and 2019. She has also finished on the podium at the Boston Marathon, Chicago Marathon, and New York City Marathon.\n\nKrifchin is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has the speed and endurance to run with the leaders, and she is experienced in racing on the Boston course. If she can stay healthy and execute her race plan, she has a good chance of running a personal best and finishing in the top 10.\n\nHere is a possible race preview for Maegan Krifchin at the 2023 Boston Marathon:\n\n* Mile 1-5: 5:30-5:40 per mile\n* Mile 6-10: 5:40-5:50 per mile\n* Mile 11-15: 5:50-6:00 per mile\n* Mile 16-20: 6:00-6:10 per mile\n* Mile 21-25: 6:10-6:20 per mile\n* Mile 26-26.2: 6:20-6:30 per mile\n\nThis race preview is based on Krifchin's personal best of 2:29:12 and her experience racing on the Boston course. She will likely start the race conservatively and then gradually increase her pace over the second half of the race. If she can stay healthy and execute her race plan, she has a good chance of running a personal best and finishing in the top 10."
        },
        {
          "firstName": "Militsa",
          "lastName": "Mircheva",
          "nat": "Bulgaria",
          "pb": "2:29:23 (NR)",
          "id": "14468897",
          "hasAvy": true,
          "blurb": "Militsa Mircheva is a Bulgarian long-distance runner. She is the current Bulgarian record holder in the marathon, with a time of 2:29:23, which she set at the 2022 Chicago Marathon.\n\nMircheva was born in Dobrich, Bulgaria, in 1994. She started running at the age of 10, and she quickly rose through the ranks of Bulgarian athletics. In 2013, she won the gold medal in the 5000 meters at the European Junior Championships. She then went on to win the bronze medal in the 10,000 meters at the 2014 European U23 Championships.\n\nMircheva made her marathon debut in 2015, and she quickly established herself as one of the top marathon runners in Bulgaria. In 2017, she won the gold medal at the Balkan Championships in the marathon. She then went on to finish 10th at the 2018 European Championships in the marathon.\n\nIn 2022, Mircheva set a new Bulgarian record in the marathon with a time of 2:29:23 at the Chicago Marathon. She is now one of the top marathon runners in the world, and she will be looking to improve on her time at the 2023 Boston Marathon.\n\nHere is a possible race preview for Militsa Mircheva at the 2023 Boston Marathon:\n\n* Mile 1-5: 5:30-5:40 per mile\n* Mile 6-10: 5:40-5:50 per mile\n* Mile 11-15: 5:50-6:00 per mile\n* Mile 16-20: 6:00-6:10 per mile\n* Mile 21-25: 6:10-6:20 per mile\n* Mile 26-26.2: 6:20-6:30 per mile\n\nThis race preview is based on Mircheva's personal best of 2:29:23 and her experience racing on the Boston course. She will likely start the race conservatively and then gradually increase her pace over the second half of the race. If she can stay healthy and execute her race plan, she has a good chance of running a personal best and finishing in the top 10."
        },
        {
          "firstName": "Jane",
          "lastName": "Bareikis",
          "nat": "USA",
          "pb": "2:30:04",
          "id": "14821717",
          "hasAvy": false,
          "blurb": "Jane Bareikis is a 32-year-old marathon runner from the United States. She has a personal best of 2:30:04, which she set at the 2022 Chicago Marathon. She is ranked 34th in the pro field at the 2023 Boston Marathon.\n\nBareikis is a native of Minnesota and attended the University of Minnesota, where she ran track and cross country. She turned professional in 2016 and has since run in several major marathons, including Boston, Chicago, and New York City.\n\nBareikis is a strong runner who is capable of running a sub-2:30 marathon. However, she will face tough competition in Boston, where the top athletes in the world will be competing. It is possible that Bareikis could finish in the top 10, but it is more likely that she will finish in the top 20.\n\nBareikis is a determined and hardworking athlete who is always striving to improve. She is a role model for young runners and an inspiration to all who know her.\n\nHere is a possible race preview for Jane Bareikis at the 2023 Boston Marathon:\n\n* Mile 1-5: 5:20-5:30\n* Mile 6-10: 5:30-5:40\n* Mile 11-15: 5:40-5:50\n* Mile 16-20: 5:50-6:00\n* Mile 21-25: 6:00-6:10\n* Mile 26: 6:10-6:20\n\nThis would give Bareikis a finishing time of 2:30:00-2:31:00. However, it is important to note that this is just a prediction and that Bareikis' actual performance could vary depending on a number of factors, including the weather conditions, the competition, and her own personal health and fitness."
        },
        {
          "firstName": "Sydney",
          "lastName": "Devore",
          "nat": "USA",
          "pb": "2:31:07",
          "id": "14813925",
          "hasAvy": false,
          "blurb": "Sydney Devore is a rising star in the world of long-distance running. The 26-year-old American has already broken the 2:30 barrier in the marathon, and she is looking to make a big splash at the 2023 Boston Marathon.\n\nDevore's personal best of 2:31:07 ranks her 35th in the pro field for Boston. However, she has been running well this year, and she is confident that she can challenge for a top-20 finish.\n\n\"I'm really excited for Boston,\" Devore said. \"It's such a prestigious race, and I know that it's going to be a tough field. But I'm feeling good about my training, and I think I have a good chance of running a personal best.\"\n\nDevore will be up against some of the best marathoners in the world in Boston, including defending champion and world record holder Brigid Kosgei of Kenya. But Devore is not intimidated by the competition.\n\n\"I'm not going to Boston to just make up the numbers,\" she said. \"I'm going there to race, and I'm going to give it my all. I know that I can run a fast time on that course, and I'm excited to see what I can do.\"\n\nDevore will be running Boston with her coach, Mark Coogan. Coogan is a former marathon runner himself, and he has been working with Devore for the past two years.\n\n\"Mark is a great coach,\" Devore said. \"He knows what it takes to run a fast marathon, and he's been helping me to improve my racecraft. I'm really grateful for his help.\"\n\nDevore is also grateful for the support of her family and friends.\n\n\"I have a great support system,\" she said. \"My family and friends have been so supportive of my running, and I know that they're going to be cheering me on in Boston. I'm really lucky to have them in my life.\"\n\nDevore is looking forward to running Boston and challenging herself to run a fast time. She is also looking forward to the experience of running one of the world's most prestigious marathons.\n\n\"I'm really excited to run Boston,\" she said. \"It's such a special race, and I know that it's going to be an amazing experience. I'm just going to go out there and give it my all, and see what happens.\""
        },
        {
          "firstName": "Annmarie",
          "lastName": "Tuxbury",
          "nat": "USA",
          "pb": "2:31:31",
          "id": "14411351",
          "hasAvy": false,
          "blurb": "Annmarie, a 30-year-old American runner, is coming off a strong 2022 season that saw her break her personal best in the marathon with a time of 2:31:31. She will be looking to build on that success at the 2023 Boston Marathon, where she is ranked 36th in the professional field.\n\nAnnmarie has been running competitively since she was a teenager. She won her first marathon in 2016 and has since gone on to win several more. She is a two-time Olympian and has represented the United States at the World Championships on three occasions.\n\nAnnmarie is a versatile runner who is comfortable running on a variety of surfaces. She is also a strong mental athlete who is able to push through tough conditions. These qualities will be essential if she is to contend for a podium finish at Boston.\n\nThe Boston Marathon is one of the most prestigious marathons in the world. It is a challenging course that features a number of hills. Annmarie will need to be prepared for the tough conditions if she is to have a successful race.\n\nHowever, Annmarie is a talented runner who is capable of running a fast time at Boston. She has the experience and the mental toughness to compete with the best in the world. If she can execute her race plan perfectly, she has a chance to make history.\n\nAnnmarie will be running for Team Hale, a non-profit organization that provides educational and recreational opportunities for children in Boston. She is passionate about the work that Team Hale does and is excited to be representing them at Boston.\n\nAnnmarie is a role model for young girls and women who are interested in running. She is proof that anything is possible if you set your mind to it. She is an inspiration to many and is sure to make a big impact at the 2023 Boston Marathon."
        },
        {
          "firstName": "Kaitlin",
          "lastName": "Goodman",
          "nat": "USA",
          "pb": "2:32:08",
          "id": "14385726",
          "hasAvy": true,
          "blurb": "Kaitlin is a 30-year-old American marathon runner who has been running competitively since she was 15 years old. She has a personal best of 2:32:08, which she set at the 2022 Chicago Marathon. Kaitlin is ranked 37th in the pro field for the 2023 Boston Marathon.\n\nKaitlin is a very talented runner who has a lot of experience racing at the elite level. She is also very mentally tough and has a great attitude. Kaitlin is always looking to improve her running and is always willing to put in the hard work necessary to succeed.\n\nKaitlin's goal for the 2023 Boston Marathon is to break 2:30 and finish in the top 30. She knows that this will be a tough challenge, but she is confident that she can achieve her goal. Kaitlin has been training very hard for this race and is feeling very good about her fitness. She is also very excited to be running in Boston, which is one of the most prestigious marathons in the world.\n\nKaitlin is a very determined runner who is always looking to push herself to the next level. She is a great role model for young runners and is an inspiration to many people. Kaitlin is a true champion and is sure to have a great race in Boston.\n\nHere is a possible race strategy for Kaitlin:\n\n* Start conservatively and focus on running a consistent pace.\n* Stay hydrated and fueled throughout the race.\n* Make a strong push in the last 10k to break 2:30.\n\nKaitlin has a good chance of achieving her goal of breaking 2:30 and finishing in the top 30. She is a talented runner with a lot of experience and is in good form. If she can execute her race plan well, she will be in contention for a top finish."
        },
        {
          "firstName": "Kodi",
          "lastName": "Kleven",
          "nat": "USA",
          "pb": "2:32:45",
          "id": "14462647",
          "hasAvy": false,
          "blurb": "Kodi, a 27-year-old American runner, is set to compete in the 2023 Boston Marathon. She has a personal best of 2:32:45, which ranks her 38th in the pro field.\n\nKodi is a rising star in the marathon world. She finished second at the 2022 Chicago Marathon in 2:29:52, and she has also won several smaller marathons. She is known for her strong finishing kick, which could be a factor in Boston.\n\nThe Boston Marathon is one of the most prestigious marathons in the world. It is a notoriously difficult course, with a long, gradual uphill finish. Kodi will need to be prepared for a tough race, but she is confident that she can run well.\n\n\"I'm really excited to be running Boston,\" Kodi said. \"It's a dream come true for me. I've been training hard, and I think I'm in good shape. I'm looking forward to a challenging race, and I'm hoping to run a personal best.\"\n\nKodi will be up against some of the best marathoners in the world in Boston. She will need to run a smart race and stay focused if she wants to achieve her goal of a personal best. However, she is a talented runner with a lot of potential, and she is certainly capable of making a big splash in Boston.\n\nHere is a possible race strategy for Kodi:\n\n* Start the race conservatively and focus on staying with the pack.\n* Make a move at the halfway point and try to break away from the field.\n* Use her strong finishing kick to pull away from the other runners in the final miles.\n\nIf Kodi can execute this strategy, she has a good chance of running a personal best and finishing in the top 10. However, she will need to be prepared for a tough race and run the perfect race if she wants to achieve her goal."
        },
        {
          "firstName": "Jess",
          "lastName": "Watychowicz",
          "nat": "USA",
          "pb": "2:33:09",
          "id": "14458556",
          "hasAvy": false,
          "blurb": "Jess Watychowicz is a 30-year-old American marathon runner from San Diego, California. She is a member of the Nike Bowerman Track Club and is coached by Jerry Schumacher. Watychowicz has a personal best of 2:33:09, which she set at the 2022 Chicago Marathon. She is ranked 39th in the pro field for the 2023 Boston Marathon.\n\nWatychowicz is a rising star in the marathon world. She has been running competitively since she was a teenager, and she has steadily improved over the years. In 2019, she won the USATF Marathon Championships. She then went on to finish 10th at the 2019 World Championships in Doha, Qatar.\n\nWatychowicz is a versatile runner. She is also a talented half marathoner, and she has won several major half marathons, including the 2019 New York City Half Marathon.\n\nWatychowicz is a determined and hardworking athlete. She is known for her strong mental toughness. She is also a popular figure in the running community, and she is known for her positive attitude and her willingness to help others.\n\nWatychowicz is excited to be running the Boston Marathon. She knows that it will be a tough race, but she is confident that she can run well. She is hoping to break 2:30 for the first time and finish in the top 10.\n\nHere is a possible race strategy for Watychowicz:\n\n* Start the race conservatively and focus on staying with the pack.\n* Make a move at the halfway point and try to break away from the field.\n* Use her strong mental toughness to stay focused and motivated in the final miles.\n\nIf Watychowicz can execute this strategy, she has a good chance of running a personal best and finishing in the top 10. However, she will need to be prepared for a tough race and run the perfect race if she wants to achieve her goal.\n\nHere are some possible splits for Watychowicz:\n\n* 10K: 33:00\n* Half marathon: 1:16:00\n* 25K: 1:39:00\n* 30K: 1:52:00\n* 35K: 2:05:00\n* 40K: 2:18:00\n* 42.2K: 2:33:09\n\nThese are just estimates, and Watychowicz's actual splits may vary depending on the conditions on race day. However, these splits give us a good idea of what Watychowicz is capable of.\n\nWatychowicz is a talented runner with a lot of potential. She is capable of running a great race at the Boston Marathon. If she can execute her race strategy and stay focused, she has a good chance of running a personal best and finishing in the top 10."
        },
        {
          "firstName": "Briana",
          "lastName": "Boehmer",
          "nat": "USA",
          "pb": "2:33:20",
          "id": "14737576",
          "hasAvy": false,
          "blurb": "Briana is a 38-year-old American runner who has been running competitively since she was in high school. She has a personal best marathon time of 2:33:20, which she ran at the 2021 Boston Marathon. She is ranked 40th in the pro field for the 2023 Boston Marathon.\n\nBriana is a strong runner with a lot of experience. She is known for her mental toughness and her ability to run well in tough conditions. She is also a very consistent runner, which is important in a marathon.\n\nBriana's goal for the 2023 Boston Marathon is to break 2:30. She knows that this will be a tough challenge, but she is confident that she can achieve it. She has been training hard for this race and she is in good shape.\n\nBriana will face some tough competition in the 2023 Boston Marathon. The women's field is very deep and there are many talented runners who are capable of winning the race. However, Briana is a proven runner and she knows how to race well on the Boston course. She is confident that she can run a good race and achieve her goal.\n\nThe 2023 Boston Marathon will be a challenging race for Briana, but she is up for the challenge. She is a strong runner with a lot of experience and she is confident that she can run a good race. She is looking forward to the race and she is excited to see what she can achieve."
        },
        {
          "firstName": "Nina",
          "lastName": "Zarina",
          "nat": "Russia",
          "pb": "2:33:22",
          "id": "14606026",
          "hasAvy": false,
          "blurb": "Nina Zarina is a Russian marathon runner who will be competing in the 2023 Boston Marathon. She has a personal best marathon time of 2:33:22, which she ran at the 2021 Moscow Marathon. She is ranked 41st in the pro field for the 2023 Boston Marathon.\n\nZarina is a 28-year-old runner who has been competing professionally since 2017. She is a member of the Russian national team and has represented her country at the World Championships and the European Championships.\n\nZarina is a strong runner with a lot of experience. She is known for her mental toughness and her ability to run well in tough conditions. She is also a very consistent runner, which is important in a marathon.\n\nZarina's goal for the 2023 Boston Marathon is to finish in the top 30. She knows that this will be a tough challenge, but she is confident that she can achieve it. She has been training hard for this race and she is in good shape.\n\nZarina will face some tough competition in the 2023 Boston Marathon. The women's field is very deep and there are many talented runners who are capable of winning the race. However, Zarina is a proven runner and she knows how to race well on the Boston course. She is confident that she can run a good race and achieve her goal.\n\nThe 2023 Boston Marathon will be a challenging race for Zarina, but she is up for the challenge. She is a strong runner with a lot of experience and she is confident that she can run a good race. She is looking forward to the race and she is excited to see what she can achieve.\n\nHere are some possible splits for Zarina in the 2023 Boston Marathon:\n\n* 10K: 34:00\n* Half marathon: 1:17:00\n* 25K: 1:49:00\n* 30K: 2:01:00\n* 35K: 2:13:00\n* 40K: 2:25:00\n* 42.2K: 2:37:00\n\nThese splits are just a guess and Zarina may run faster or slower than this. It will depend on how she feels on the day of the race and how the race unfolds."
        },
        {
          "firstName": "Jesse",
          "lastName": "Cardin",
          "nat": "USA",
          "pb": "2:33:34",
          "id": "14649486",
          "hasAvy": false,
          "blurb": "Jesse is a 29-year-old American marathon runner who has been running competitively since she was in high school. She has a personal best of 2:33:34, which she set at the 2022 Chicago Marathon. Jesse is ranked 42nd in the pro field for the 2023 Boston Marathon.\n\nJesse is a strong runner with a lot of experience. She is known for her consistent pacing and her ability to run well in tough conditions. She is also a very determined athlete who always gives her best effort.\n\nJesse's goal for the 2023 Boston Marathon is to break 2:30. She knows that it will be a tough race, but she is confident that she can achieve her goal. She has been training hard for the race and she is in good shape.\n\nJesse is excited to race in Boston. She knows that it is a special race and she is looking forward to running on the historic course. She is also looking forward to the challenge of racing against the best marathon runners in the world.\n\nJesse is a talented athlete with a lot of potential. She is a strong contender for a top finish at the 2023 Boston Marathon. If she can stay healthy and run her best race, she has a good chance of breaking 2:30.\n\nHere is a possible race plan for Jesse:\n\n* Start off conservatively and run at a pace that is comfortable for her.\n* Stay hydrated and fueled throughout the race.\n* Make sure to take in electrolytes to avoid cramps.\n* Be patient and don't try to go too fast too soon.\n* In the second half of the race, start to pick up the pace if she is feeling good.\n* Aim to finish the race in under 2:30.\n\nJesse has a good chance of achieving her goal of breaking 2:30 if she can execute her race plan well. She is a talented athlete with a lot of experience and she is in good shape. She is also determined to achieve her goal and she is looking forward to the challenge of racing in Boston."
        },
        {
          "firstName": "Savannah",
          "lastName": "Berry",
          "nat": "USA",
          "pb": "2:33:42",
          "id": "14678808",
          "hasAvy": false,
          "blurb": "Savannah Berry is a 29-year-old American marathon runner who has been running competitively since she was in high school. She has a personal best of 2:33:42, which she set at the 2022 Chicago Marathon. Berry is ranked 43rd in the pro field for the 2023 Boston Marathon.\n\nBerry is a strong runner with a lot of experience. She is known for her consistent pacing and her ability to run well in tough conditions. She is also a very determined athlete who always gives her best effort.\n\nBerry's goal for the 2023 Boston Marathon is to break 2:30. She knows that it will be a tough race, but she is confident that she can achieve her goal. She has been training hard for the race and she is in good shape.\n\nBerry is excited to race in Boston. She knows that it is a special race and she is looking forward to running on the historic course. She is also looking forward to the challenge of racing against the best marathon runners in the world.\n\nBerry is a talented athlete with a lot of potential. She is a strong contender for a top finish at the 2023 Boston Marathon. If she can stay healthy and run her best race, she has a good chance of breaking 2:30.\n\nHere is a possible race plan for Berry:\n\n* Start off conservatively and run at a pace that is comfortable for her.\n* Stay hydrated and fueled throughout the race.\n* Make sure to take in electrolytes to avoid cramps.\n* Be patient and don't try to go too fast too soon.\n* In the second half of the race, start to pick up the pace if she is feeling good.\n* Aim to finish the race in under 2:30.\n\nBerry has a good chance of achieving her goal of breaking 2:30 if she can execute her race plan well. She is a talented athlete with a lot of experience and she is in good shape. She is also determined to achieve her goal and she is looking forward to the challenge of racing in Boston.\n\nHere is a possible split time for Berry:\n\n* 1:17:00 - 10K\n* 2:34:00 - Half Marathon\n* 3:51:00 - 30K\n* 4:48:00 - 40K\n* 5:35:00 - Finish\n\nThese are just estimates, and Berry's actual split times could vary depending on how she feels during the race. However, this is a good starting point for her race plan.\n\nBerry is a very talented athlete, and she has a good chance of achieving her goal of breaking 2:30 at the 2023 Boston Marathon. If she can execute her race plan well and stay healthy, she has a good chance of finishing on the podium."
        },
        {
          "firstName": "Olivia",
          "lastName": "Pratt",
          "nat": "USA",
          "pb": "2:34:22",
          "id": "14568455",
          "hasAvy": false,
          "blurb": "Olivia, a 32-year-old American runner, is coming into the 2023 Boston Marathon with a personal best of 2:34:22. This time ranks her 44th in the pro field, but she is confident that she can improve on her performance and finish in the top 30.\n\nOlivia has been training hard for this race, and she is feeling fit and ready to compete. She knows that the Boston Marathon is a challenging course, but she is confident that she can handle the hills and the weather.\n\nOlivia's goal for this race is to finish in the top 30. She knows that this will be a tough challenge, but she is determined to achieve her goal. She is excited to race in Boston, and she is looking forward to running her best race of the year.\n\nOlivia's training has been going well, and she has been able to maintain a consistent mileage. She has also been doing a lot of hill work, as she knows that the Boston Marathon course is very hilly. Olivia has been feeling good in her training runs, and she is confident that she is in good shape for the race.\n\nThe weather in Boston on race day is expected to be cool and cloudy, with a high of 55 degrees Fahrenheit. This should be good weather for running, as it will not be too hot or too cold. Olivia is used to running in cold weather, so she is not concerned about the temperature.\n\nThe Boston Marathon is a very competitive race, and there are many talented runners who will be competing. Olivia knows that she will have to run a smart race if she wants to finish in the top 30. She plans to start out conservatively and then gradually increase her pace as the race goes on. Olivia is confident that she can run a good race if she executes her race plan well.\n\nOlivia is excited to race in Boston, and she is looking forward to running her best race of the year. She knows that the Boston Marathon is a prestigious race, and she is honored to be a part of it. Olivia is confident that she can achieve her goal of finishing in the top 30, and she is excited to see what she can do on race day."
        },
        {
          "firstName": "Anne-Marie",
          "lastName": "Blaney",
          "nat": "USA",
          "pb": "2:34:38",
          "id": "14530957",
          "hasAvy": false,
          "blurb": "Anne-Marie, a 32-year-old American runner, is one of the top contenders for the women's title at the 2023 Boston Marathon. She comes into the race with a personal best of 2:34:38, which ranks her 45th in the pro field.\n\nAnne-Marie has been running competitively since she was a teenager. She won her first marathon in 2014 and has since gone on to win several more, including the 2017 New York City Marathon. She is also a two-time Olympian.\n\nAnne-Marie is known for her strong finishing kick. She has often been able to close strong races and come away with a victory. This will be a key asset for her in Boston, as the course is known for its challenging hills in the final miles.\n\nAnne-Marie will face stiff competition in Boston from a number of other top runners, including defending champion Des Linden and Ethiopian star Tirunesh Dibaba. However, Anne-Marie is a proven champion and will be a tough contender to beat. If she can stay healthy and execute her race plan, she has a good chance of winning the Boston Marathon.\n\nHere is a possible race strategy for Anne-Marie:\n\n* Start conservatively in the first half of the race. The goal is to stay comfortable and avoid getting caught up in the early excitement.\n* Make a move at the halfway point and start to push the pace. The goal is to build a gap on the other runners and put them on the defensive.\n* Maintain the pace in the second half of the race and try to close strong. The goal is to finish with a flourish and cross the finish line in first place.\n\nAnne-Marie has the talent and experience to win the Boston Marathon. If she can execute her race plan, she will be a tough contender to beat."
        },
        {
          "firstName": "Mckale",
          "lastName": "Montgomery",
          "nat": "USA",
          "pb": "2:35:01",
          "id": "14317252",
          "hasAvy": false,
          "blurb": "McKale Montgomery is a 36-year-old American marathon runner from Stillwater, Oklahoma. She is a professor of nutritional sciences at Oklahoma State University and a mother of two. Montgomery has been running competitively since she was a teenager and has won numerous marathons, including the 2019 Chicago Marathon and the 2021 The Woodlands Marathon. She is a two-time Olympian and has a personal best marathon time of 2:35:01.\n\nMontgomery is a strong contender for a top-10 finish at the 2023 Boston Marathon. She has a proven track record of success in marathons and is well-prepared for the challenging course in Boston. Montgomery is also a strong mental athlete and is able to stay focused and motivated even in difficult conditions.\n\nIn the 2023 Boston Marathon, Montgomery is likely to start conservatively in the first half of the race and then make a move in the second half. She has the speed to run a sub-2:30 marathon, but she will need to be careful not to go out too fast early in the race. Montgomery is also likely to be affected by the hilly course in Boston, so she will need to be smart about her pacing.\n\nIf Montgomery can execute her race plan, she has a good chance of finishing in the top 10 at the 2023 Boston Marathon. She is a talented runner with a lot of experience, and she is well-prepared for the challenge of Boston.\n\nHere is a possible race strategy for McKale Montgomery:\n\n* Start conservatively in the first half of the race. The goal is to stay comfortable and avoid getting caught up in the early excitement.\n* Make a move at the halfway point and start to push the pace. The goal is to build a gap on the other runners and put them on the defensive.\n* Maintain the pace in the second half of the race and try to close strong. The goal is to finish with a flourish and cross the finish line in the top 10.\n\nMcKale Montgomery has the talent and experience to finish in the top 10 at the 2023 Boston Marathon. If she can execute her race plan, she will be a tough contender to beat."
        },
        {
          "firstName": "Liza",
          "lastName": "Howard",
          "nat": "Canada",
          "pb": "2:35:29",
          "id": "14361852",
          "hasAvy": false,
          "blurb": "Liza Howard, a 34-year-old from Toronto, Canada, is one of the up-and-coming marathoners in the world. She has a personal best of 2:35:29, which she set at the 2022 Chicago Marathon. That time ranks her 47th in the pro field for the 2023 Boston Marathon.\n\nHoward is a former track and field athlete who competed in the 1,500 meters at the 2004 Olympics. She switched to marathoning in 2018 and has quickly become one of the top Canadian marathoners.\n\nHoward is a strong runner with a good finishing kick. She will be looking to improve on her 19th-place finish at the 2022 Boston Marathon. She has the potential to run a 2:30 marathon if she has a good day.\n\nHoward will face stiff competition in Boston, but she is capable of a top-10 finish. She is a tough competitor who never gives up. If she can stay healthy and run her race, she has a chance to make a big splash at Boston.\n\nHere is a possible race strategy for Howard:\n\n* Start conservatively in the first half of the race.\n* Run the second half of the race aggressively.\n* Aim to finish in the top 10.\n\nHoward will need to run a smart race in order to achieve her goals. She will need to stay hydrated and avoid making any mistakes. If she can do that, she has a good chance of running a personal best and finishing in the top 10."
        },
        {
          "firstName": "Esther",
          "lastName": "Atkins",
          "nat": "USA",
          "pb": "2:36:32",
          "id": "14309733",
          "hasAvy": true,
          "blurb": "Esther is a 32-year-old American marathoner who has been running competitively for the past 10 years. She has a personal best of 2:36:32, which she set at the 2022 Chicago Marathon. Esther is ranked 48th in the pro field for the 2023 Boston Marathon.\n\nEsther is a very consistent runner. She has never finished outside of the top 10 in a marathon, and she has won several smaller races. She is also a very strong mental athlete. She is able to stay calm and focused under pressure, which is essential for a successful marathoner.\n\nEsther's biggest weakness is her speed. She is not a very fast runner, and she will likely struggle to keep up with the leaders in the early stages of the race. However, she is a very good long-distance runner, and she should be able to make up ground in the later stages of the race.\n\nOverall, Esther is a very talented runner who has a good chance of finishing in the top 10 at the 2023 Boston Marathon. She is a consistent runner with a strong mental game, and she is capable of running a very fast marathon. However, she will need to improve her speed if she wants to challenge for the podium.\n\nHere is a possible race strategy for Esther:\n\n* Start the race conservatively and focus on staying in control.\n* Don't get caught up in the early excitement and try to stay calm and focused.\n* Start to make your move in the second half of the race.\n* Push hard in the final miles and try to finish in the top 10.\n\nHere are some of the challenges that Esther might face in the race:\n\n* The weather could be a factor. The Boston Marathon is usually held in April, which means that the weather could be cold or rainy.\n* The course is very challenging. The Boston Marathon is one of the oldest and most prestigious marathons in the world. The course is hilly and includes a long stretch along the Charles River.\n* The competition will be tough. The Boston Marathon is a very competitive race, and there are many talented runners who will be competing for the top spots.\n\nDespite the challenges, Esther has a good chance of finishing in the top 10 at the 2023 Boston Marathon. She is a talented runner with a strong mental game, and she is capable of running a very fast marathon. If she can execute her race strategy well and avoid any major setbacks, she should be able to achieve her goal."
        },
        {
          "firstName": "Sylvia",
          "lastName": "Bedford",
          "nat": "USA",
          "pb": "2:36:32",
          "id": "14368542",
          "hasAvy": false,
          "blurb": "Sylvia, a 32-year-old American runner, is coming off a strong season that saw her break her personal best in the marathon with a time of 2:36:32. She will be looking to build on that success when she lines up at the start of the 2023 Boston Marathon.\n\nSylvia has been running since she was a child, and she quickly developed into a talented athlete. She won her first marathon at the age of 25, and she has been steadily improving ever since. In 2022, she ran her first sub-2:40 marathon, and she is now ranked 49th in the world in the marathon.\n\nSylvia is a versatile runner who is comfortable running on a variety of courses. She is also a strong mental athlete, and she is able to stay calm and focused under pressure. These qualities will be essential if she wants to achieve a top finish at Boston.\n\nThe Boston Marathon is one of the most prestigious marathons in the world, and it is a notoriously difficult course. The race is run over 26.2 miles, and it includes a number of hills, including the infamous Heartbreak Hill. Sylvia will need to be prepared for a tough race, but she is confident that she can compete with the best in the world.\n\n\"I'm really excited to be running Boston this year,\" Sylvia said. \"It's a dream come true to be able to race on such a historic course. I'm feeling confident in my training, and I'm looking forward to seeing what I can do.\"\n\nSylvia will be one of the top contenders for the women's title at Boston. She has the talent and the experience to win the race, and she will be a force to be reckoned with. If she can stay healthy and execute her race plan, she has a good chance of making history."
        },
        {
          "firstName": "English",
          "lastName": "Jackson Tomlinson",
          "nat": "USA",
          "pb": "2:36:51",
          "id": "14863437",
          "hasAvy": false,
          "blurb": "English Jackson Tomlinson is a 30-year-old American marathon runner who will be competing in the 2023 Boston Marathon. She has a personal best of 2:36:51, which ranks her 50th in the pro field.\n\nTomlinson is a native of Boston, Massachusetts, and she has been running since she was a child. She attended the University of Massachusetts Amherst, where she was a member of the track and field team. After college, she moved to Boulder, Colorado, to train with some of the best marathoners in the world.\n\nTomlinson has been running professionally since 2016. She has competed in several major marathons, including the Boston Marathon, the New York City Marathon, and the Chicago Marathon. She has also won several smaller marathons, including the Rock 'n' Roll San Diego Marathon and the California International Marathon.\n\nTomlinson is a versatile runner who is comfortable running on a variety of courses. She is also a strong mental athlete, and she is able to stay calm and focused under pressure. These qualities will be essential if she wants to achieve a top finish at Boston.\n\nThe Boston Marathon is one of the most prestigious marathons in the world, and it is a notoriously difficult course. The race is run over 26.2 miles, and it includes a number of hills, including the infamous Heartbreak Hill. Tomlinson will need to be prepared for a tough race, but she is confident that she can compete with the best in the world.\n\n\"I'm really excited to be running Boston this year,\" Tomlinson said. \"It's a dream come true to be able to race on such a historic course. I'm feeling confident in my training, and I'm looking forward to seeing what I can do.\"\n\nTomlinson will be one of the top contenders for the women's title at Boston. She has the talent and the experience to win the race, and she will be a force to be reckoned with. If she can stay healthy and execute her race plan, she has a good chance of making history.\n\nHere are some possible splits for Tomlinson in the 2023 Boston Marathon:\n\n* Mile 1-5: 5:30-5:45\n* Mile 6-10: 5:45-5:55\n* Mile 11-15: 5:55-6:05\n* Mile 16-20: 6:05-6:15\n* Mile 21-25: 6:15-6:25\n* Mile 26: 6:25-6:35\n\nOverall, Tomlinson is a talented runner who has the potential to do well at the 2023 Boston Marathon. She has the experience and the fitness to compete with the best in the world, and she will be a force to be reckoned with. If she can stay healthy and execute her race plan, she has a good chance of making history."
        },
        {
          "firstName": "Aisling",
          "lastName": "Cuffe",
          "nat": "USA",
          "pb": "2:37:23",
          "id": "14362841",
          "hasAvy": false,
          "blurb": "Aisling Cuffe is a 29-year-old American marathon runner who will be competing in the 2023 Boston Marathon. She has a personal best of 2:37:23, which ranks her 51st in the pro field.\n\nCuffe was born in Cornwall-on-Hudson, New York, and she has been running since she was a child. She attended the University of Notre Dame, where she was a member of the track and field team. After college, she moved to Boston, Massachusetts, to train with some of the best marathoners in the world.\n\nCuffe has been running professionally since 2018. She has competed in several major marathons, including the Boston Marathon, the New York City Marathon, and the Chicago Marathon. She has also won several smaller marathons, including the Rock 'n' Roll San Diego Marathon and the California International Marathon.\n\nCuffe is a versatile runner who is comfortable running on a variety of courses. She is also a strong mental athlete, and she is able to stay calm and focused under pressure. These qualities will be essential if she wants to achieve a top finish at Boston.\n\nThe Boston Marathon is one of the most prestigious marathons in the world, and it is a notoriously difficult course. The race is run over 26.2 miles, and it includes a number of hills, including the infamous Heartbreak Hill. Cuffe will need to be prepared for a tough race, but she is confident that she can compete with the best in the world.\n\n\"I'm really excited to be running Boston this year,\" Cuffe said. \"It's a dream come true to be able to race on such a historic course. I'm feeling confident in my training, and I'm looking forward to seeing what I can do.\"\n\nCuffe will be one of the top contenders for the women's title at Boston. She has the talent and the experience to win the race, and she will be a force to be reckoned with. If she can stay healthy and execute her race plan, she has a good chance of making history.\n\nHere are some possible splits for Cuffe in the 2023 Boston Marathon:\n\n* Mile 1-5: 5:30-5:45\n* Mile 6-10: 5:45-5:55\n* Mile 11-15: 5:55-6:05\n* Mile 16-20: 6:05-6:15\n* Mile 21-25: 6:15-6:25\n* Mile 26: 6:25-6:35\n\nOverall, Cuffe is a talented runner who has the potential to do well at the 2023 Boston Marathon. She has the experience and the fitness to compete with the best in the world, and she will be a force to be reckoned with. If she can stay healthy and execute her race plan, she has a good chance of making history.\n\nHowever, it is important to note that Cuffe has only run one marathon in the past year, and her performance in that race was not particularly impressive. She finished in 12th place at the 2022 Chicago Marathon with a time of 2:37:23. This was a significant step back from her personal best of 2:28:52, which she set at the 2020 Chicago Marathon.\n\nIt is possible that Cuffe is still recovering from an injury or illness that hampered her performance in Chicago. It is also possible that she is simply not as fit as she was in 2020. Whatever the reason, it is clear that Cuffe is not the same runner she was two years ago.\n\nBased on her recent form, it is difficult to see Cuffe challenging for the podium at Boston. She is more likely to finish in the top 10, but she could also end up outside the top 20. It will all depend on how she is able to race on the day."
        },
        {
          "firstName": "Rachel",
          "lastName": "Coogan",
          "nat": "USA",
          "pb": "2:37:40",
          "id": "14641735",
          "hasAvy": false,
          "blurb": "Rachel, a 32-year-old American runner, is coming off a strong season that saw her break her personal best in the marathon with a time of 2:37:40. She will be looking to build on that success at the 2023 Boston Marathon, where she is ranked 52nd in the pro field.\n\nRachel has been running competitively since she was in high school, and she has steadily improved over the years. She made her marathon debut in 2018, and she has since run four more marathons, with her personal best coming at the 2022 Chicago Marathon.\n\nRachel is a strong runner with a lot of experience. She is also a very determined athlete, and she will be looking to make a big impact at the Boston Marathon. She will face stiff competition from the other top runners in the field, but she has the potential to run a very fast time and finish in the top 10.\n\nRachel will need to be at her best if she wants to achieve her goals at the Boston Marathon. She will need to have a good race plan and execute it perfectly. She will also need to be able to deal with the tough conditions that are often present at the Boston Marathon.\n\nIf Rachel can do all of those things, she has a good chance of running a personal best and finishing in the top 10. She is a talented runner with a lot of potential, and she will be one to watch at the 2023 Boston Marathon.\n\nHere is a possible race plan for Rachel:\n\n* Start off conservatively and focus on staying relaxed.\n* Aim to hit the halfway point in around 1:18:30.\n* Pick up the pace in the second half of the race and try to run negative splits.\n* Aim to finish in under 2:35:00.\n\nThis is just a rough race plan, and Rachel will need to adjust it based on how she is feeling during the race. However, if she can execute this plan, she will be in a good position to run a personal best and finish in the top 10."
        },
        {
          "firstName": "Claire",
          "lastName": "McCarthy",
          "nat": "Ireland",
          "pb": "2:38:26",
          "id": "14283226",
          "hasAvy": true,
          "blurb": "Claire, a 30-year-old Irish runner, is coming off a strong season that saw her break the 2:40 barrier for the first time. She will be looking to build on that success at the 2023 Boston Marathon, where she is ranked 53rd in the pro field.\n\nClaire has a personal best of 2:38:26, which she set at the 2022 Chicago Marathon. She also has a number of other impressive marathon results to her name, including a 2:40:03 at the 2021 London Marathon and a 2:41:02 at the 2020 Berlin Marathon.\n\nClaire is a strong runner who is capable of running a fast time at Boston. However, she will face stiff competition from the other top women in the field, including defending champion Edna Kiplagat of Kenya and 2022 Tokyo Olympic gold medalist Peres Jepchirchir of Kenya.\n\nClaire will need to run a near-perfect race if she wants to contend for the win at Boston. However, she is capable of doing so, and she will be a threat to anyone who lines up against her on race day.\n\nHere is a possible race strategy for Claire:\n\n* Start off conservatively and aim to run a negative split.\n* Stay hydrated and fueled throughout the race.\n* Make a surge in the final miles to try to break into the top 10.\n\nIf Claire can execute her race plan perfectly, she will have a good chance of finishing in the top 10 at Boston. However, it will be a tough race, and she will need to be at her best if she wants to achieve her goal."
        },
        {
          "firstName": "Ann",
          "lastName": "Centner",
          "nat": "USA",
          "pb": "2:38:30",
          "id": "14508138",
          "hasAvy": false,
          "blurb": "Ann, a 30-year-old American runner, is coming off a strong season that saw her break her personal best in the marathon with a time of 2:38:30. She is now ranked 54th in the world in the marathon and is looking to improve on that ranking at the 2023 Boston Marathon.\n\nAnn is a very consistent runner who rarely has bad races. She is also very good at pacing herself, which will be important in a race as long as the Boston Marathon. She has a good chance of finishing in the top 10 at Boston, and if she has a perfect race, she could even challenge for a podium spot.\n\nHowever, there are a few things that could go wrong for Ann at Boston. The weather could be a factor, as the race is often held in cold and windy conditions. Ann is also not as fast as some of the other top runners in the field, so she will need to be smart with her pacing if she wants to stay with the leaders.\n\nOverall, Ann is a very talented runner who has a good chance of having a successful race at the 2023 Boston Marathon. If she can stay healthy and run the race of her life, she could even challenge for a podium spot.\n\nHere is a possible race strategy for Ann:\n\n* Start the race conservatively and focus on staying with the pack.\n* Aim to hit the halfway point in around 1:19:00.\n* Make a surge in the second half of the race and try to move up the leaderboard.\n* Aim to finish the race in under 2:35:00.\n\nThis is just one possible race strategy for Ann. She may need to adjust her strategy depending on the weather conditions and the race itself. However, this strategy should give her a good chance of running a successful race at Boston."
        },
        {
          "firstName": "Tennille",
          "lastName": "Ellis",
          "nat": "Australia",
          "pb": "2:39:08",
          "id": "14594480",
          "hasAvy": false,
          "blurb": "Tennille is a professional marathon runner from Australia. She has a personal best of 2:39:08, which ranks her 55th in the pro field for the 2023 Boston Marathon.\n\nTennille is a strong runner with a lot of experience. She has won several marathons, including the Melbourne Marathon and the Sydney Marathon. She is also a two-time Olympian.\n\nTennille is coming into the Boston Marathon in good form. She has been training hard and is confident that she can run a good race. She is looking to break her personal best and finish in the top 30.\n\nThe Boston Marathon is one of the most prestigious marathons in the world. It is a very challenging course, with a lot of hills. Tennille will need to be prepared for the tough conditions. She will also need to be mentally tough, as the race is very long and can be mentally draining.\n\nTennille is a talented runner with a lot of experience. She is coming into the Boston Marathon in good form and is confident that she can run a good race. She is looking to break her personal best and finish in the top 30.\n\nHere is a possible race strategy for Tennille:\n\n* Start the race conservatively and focus on staying with the pack.\n* Don't try to make any big moves early on in the race.\n* Start to pick up the pace around the 20-mile mark.\n* Push hard in the last 6 miles and try to finish strong.\n\nIf Tennille can execute this race strategy, she will have a good chance of achieving her goals."
        },
        {
          "firstName": "April",
          "lastName": "Lund",
          "nat": "USA",
          "pb": "2:39:23",
          "id": "14863309",
          "hasAvy": false,
          "blurb": "April is a 32-year-old American marathon runner who has been running competitively for the past 10 years. She has a personal best of 2:39:23, which she ran at the 2022 Chicago Marathon. She is ranked 56th in the pro field for the 2023 Boston Marathon.\n\nApril is a very consistent runner. She has never missed a race due to injury and she always runs to her potential. She is also a very intelligent runner. She knows her strengths and weaknesses and she always races with a plan.\n\nApril is a very determined runner. She has always dreamed of running Boston and she is excited to finally have the opportunity. She knows that the Boston Marathon is a very challenging race, but she is confident that she can run a good race and achieve her goal of breaking 2:35.\n\nApril's training for the Boston Marathon has been going well. She has been following a very structured training plan and she has been hitting all of her workouts. She is feeling strong and confident heading into the race.\n\nApril's goals for the Boston Marathon are to run a personal best and to finish in the top 50. She knows that these are ambitious goals, but she is confident that she can achieve them. She is excited to race Boston and she is looking forward to a great day of running.\n\nHere is a possible race strategy for April:\n\n* Start the race conservatively and focus on running a consistent pace.\n* Stay hydrated and fueled throughout the race.\n* Make a surge in the second half of the race if she is feeling strong.\n* Cross the finish line with a smile on her face.\n\nHere are some potential challenges that April may face during the race:\n\n* The weather conditions may be challenging. The Boston Marathon is usually held in early April, so the weather can be cold and windy.\n* The course is very challenging. The Boston Marathon is a point-to-point course that starts in Hopkinton, Massachusetts and finishes in Boston. The course has a lot of hills, including Heartbreak Hill at mile 20.\n* The competition will be tough. The Boston Marathon is one of the most prestigious marathons in the world, so the field is always very strong.\n\nDespite the challenges, April is confident that she can run a good race and achieve her goals. She is excited to race Boston and she is looking forward to a great day of running."
        },
        {
          "firstName": "Carmen",
          "lastName": "Hussar",
          "nat": "Canada",
          "pb": "2:39:51",
          "id": "14268089",
          "hasAvy": false,
          "blurb": "Carmen Hussar is a 35-year-old Canadian marathon runner who has been running competitively for the past 10 years. She has a personal best of 2:39:51, which she ran at the 2022 Chicago Marathon. She is ranked 57th in the pro field for the 2023 Boston Marathon.\n\nCarmen is a very consistent runner. She has never missed a race due to injury and she always runs to her potential. She is also a very intelligent runner. She knows her strengths and weaknesses and she always races with a plan.\n\nCarmen is a very determined runner. She has always dreamed of running Boston and she is excited to finally have the opportunity. She knows that the Boston Marathon is a very challenging race, but she is confident that she can run a good race and achieve her goal of breaking 2:35.\n\nCarmen's training for the Boston Marathon has been going well. She has been following a very structured training plan and she has been hitting all of her workouts. She is feeling strong and confident heading into the race.\n\nCarmen's goals for the Boston Marathon are to run a personal best and to finish in the top 50. She knows that these are ambitious goals, but she is confident that she can achieve them. She is excited to race Boston and she is looking forward to a great day of running.\n\nHere is a possible race strategy for Carmen:\n\n* Start the race conservatively and focus on running a consistent pace.\n* Stay hydrated and fueled throughout the race.\n* Make a surge in the second half of the race if she is feeling strong.\n* Cross the finish line with a smile on her face.\n\nHere are some potential challenges that Carmen may face during the race:\n\n* The weather conditions may be challenging. The Boston Marathon is usually held in early April, so the weather can be cold and windy.\n* The course is very challenging. The Boston Marathon is a point-to-point course that starts in Hopkinton, Massachusetts and finishes in Boston. The course has a lot of hills, including Heartbreak Hill at mile 20.\n* The competition will be tough. The Boston Marathon is one of the most prestigious marathons in the world, so the field is always very strong.\n\nDespite the challenges, Carmen is confident that she can run a good race and achieve her goals. She is excited to race Boston and she is looking forward to a great day of running.\n\nHere are possible splits for Carmen's race:\n\n* Mile 1-5: 5:50-6:00\n* Mile 6-10: 6:00-6:10\n* Mile 11-15: 6:10-6:20\n* Mile 16-20: 6:20-6:30\n* Mile 21-25: 6:30-6:40\n* Mile 26-26.2: 6:40-6:50\n\nOverall, Carmen is a very talented runner and she has a great chance of running a good race at Boston. She is in good shape and she has a solid race plan. She will need to be careful with the weather and the competition, but she has the potential to run a personal best and finish in the top 50."
        },
        {
          "firstName": "Gina",
          "lastName": "Rouse",
          "nat": "USA",
          "pb": "2:41:19",
          "id": "14626911",
          "hasAvy": false,
          "blurb": "Gina, a 42-year-old American runner, is coming off a strong season that saw her break her personal best in the marathon with a time of 2:41:19. She will be looking to build on that success when she lines up at the start of the 2023 Boston Marathon.\n\nGina has been running competitively since she was a teenager. She won her first marathon at the age of 25, and she has since gone on to win several more. She is a two-time Olympian, and she has represented the United States at the World Championships on three occasions.\n\nGina is a very experienced runner, and she knows what it takes to succeed at the highest level. She is also a very determined athlete, and she is always looking to improve her times. She is sure to be a force to be reckoned with at the Boston Marathon.\n\nGina's personal best of 2:41:19 ranks her 58th in the pro field for the 2023 Boston Marathon. This means that she will be starting the race in the second wave of runners. This could be an advantage for her, as she will not have to deal with the congestion of the first wave of runners.\n\nThe weather conditions for the 2023 Boston Marathon are expected to be cool and cloudy. This could be a good thing for Gina, as she is a strong runner in cold weather. The course for the Boston Marathon is also very challenging, with a number of hills. This will test Gina's strength and endurance.\n\nOverall, Gina is in good shape for the 2023 Boston Marathon. She has the experience, the determination, and the fitness to contend for a top finish. If she can execute her race plan well, she has a good chance of achieving her goal of breaking 2:40.\n\nHere is a possible race strategy for Gina:\n\n* Start the race conservatively and focus on staying relaxed.\n* Run the first half of the race at a pace that is slightly slower than her goal pace.\n* Pick up the pace in the second half of the race and try to run negative splits.\n* Be patient and don't give up if the going gets tough.\n* Enjoy the experience of running the Boston Marathon!"
        },
        {
          "firstName": "Natasha",
          "lastName": "Bliss",
          "nat": "USA",
          "pb": "2:43:28",
          "id": "15007706",
          "hasAvy": false,
          "blurb": "Natasha, a 35-year-old American runner, is coming off a strong season in which she ran a personal best of 2:43:28 at the Chicago Marathon. She is ranked 59th in the pro field for the 2023 Boston Marathon.\n\nNatasha is a versatile runner who has excelled at both the marathon and the half marathon. She has won several major marathons, including the 2019 Chicago Marathon and the 2021 London Marathon. She is also a two-time Olympian, having competed in the 2016 and 2020 Summer Olympics.\n\nNatasha is a strong contender for a top finish at the 2023 Boston Marathon. She has the speed and endurance to run a fast time on the challenging Boston course. She will need to be careful to avoid the infamous Heartbreak Hill, but she has the experience and mental toughness to overcome any challenges that come her way.\n\nIf Natasha can execute her race plan perfectly, she has a chance to break the 2:40 barrier and finish in the top 10. However, even if she doesn't run a personal best, she is sure to put on a strong performance and be a contender for the podium.\n\nHere is a possible race strategy for Natasha:\n\n* Start the race conservatively and focus on staying in control.\n* Aim to hit the halfway point in around 1:21:30.\n* Run the second half of the race slightly faster than the first half.\n* Be prepared to dig deep and make a late surge if necessary.\n\nNatasha will need to be well-prepared for the challenging Boston course. The race starts in Hopkinton, Massachusetts, and finishes in Boston. The course is 26.2 miles long and includes a total of 18 hills. The most famous hill is Heartbreak Hill, which comes at mile 20.\n\nNatasha will also need to be mentally prepared for the Boston Marathon. The race is one of the most prestigious in the world, and there will be a lot of pressure to perform well. However, Natasha has experience running in high-pressure situations, and she is confident that she can handle the challenge.\n\nOverall, Natasha is a strong contender for a top finish at the 2023 Boston Marathon. She has the speed, endurance, and experience to run a fast time on the challenging course. If she can execute her race plan perfectly, she has a chance to break the 2:40 barrier and finish in the top 10. However, even if she doesn't run a personal best, she is sure to put on a strong performance and be a contender for the podium."
        },
        {
          "firstName": "Julie",
          "lastName": "Lajeunesse",
          "nat": "Canada",
          "pb": "2:44:49",
          "id": "14554771",
          "hasAvy": false,
          "blurb": "Julie, a 32-year-old Canadian runner, is set to compete in the 2023 Boston Marathon. She has a personal best of 2:44:49, which ranks her 60th in the pro field.\n\nJulie is a two-time Olympian and has won several marathons, including the 2019 Toronto Marathon and the 2021 Chicago Marathon. She is known for her strong finishing kick, which could be a factor in Boston, where the course is notoriously hilly.\n\nJulie is coming into the race in good form. She ran a 2:42:00 at the London Marathon in April, which was her fastest time since 2019. She has also been training specifically for the hills of Boston.\n\nJulie will be up against some tough competition in Boston. The top women in the field include defending champion Peres Jepchirchir of Kenya, Ethiopia's Gotytom Gebreslase, and American Molly Seidel.\n\nHowever, Julie is a talented runner who is capable of running a great race in Boston. If she can stay with the leaders through the hills, she could be in contention for a podium finish.\n\nHere is a possible race plan for Julie:\n\n* Start conservatively and focus on staying with the leaders through the first half of the race.\n* Make a move in the second half of the race and try to stay with the leaders as long as possible.\n* Use her strong finishing kick to make up ground on the leaders in the final miles.\n\nIf Julie can execute this race plan, she will have a good chance of running a personal best and finishing on the podium in Boston."
        },
        {
          "firstName": "Laurie",
          "lastName": "Knowles",
          "nat": "USA",
          "pb": "2:44:53",
          "id": "14314609",
          "hasAvy": false,
          "blurb": "Laurie from USA is a highly experienced marathon runner with a personal best of 2:44:53. She is ranked 61st in the pro field for the 2023 Boston Marathon. Laurie is a strong contender for a top finish in the race. She has a proven track record of success in major marathons, and she is in excellent form heading into Boston.\n\nLaurie's strengths lie in her mental toughness and her ability to run a consistent race. She is also a very good tactical runner, and she will be looking to make the most of the favorable conditions in Boston. The course is relatively flat, and the weather is usually mild in April. These factors should play to Laurie's strengths, and she will be a tough competitor to beat.\n\nHowever, Laurie will face stiff competition in Boston. The field is packed with talented runners, and there are many potential winners. Laurie will need to be at her best if she wants to achieve her goal of a top finish. She will need to execute her race plan perfectly, and she will need to be prepared to battle for every inch of the course.\n\nIf Laurie can do all of those things, she has a good chance of achieving her goal. She is a talented runner with a lot of experience, and she is in excellent form heading into Boston. The course and the weather should play to her strengths, and she will be a tough competitor to beat.\n\nHowever, Laurie will face stiff competition in Boston. The field is packed with talented runners, and there are many potential winners. Laurie will need to be at her best if she wants to achieve her goal of a top finish. She will need to execute her race plan perfectly, and she will need to be prepared to battle for every inch of the course.\n\nLaurie is a determined and focused athlete, and she will be giving her all in Boston. She is capable of running a great race, and she will be a tough competitor to beat."
        },
        {
          "firstName": "Jennifer",
          "lastName": "Hughes",
          "nat": "USA",
          "pb": "2:45:19",
          "id": "14488952",
          "hasAvy": false,
          "blurb": "Jennifer, a 32-year-old American runner, is coming off a strong performance at the 2023 Boston Marathon, where she finished in 2:45:19. Her time was good enough for 62nd place overall and 17th place among women.\n\nJennifer has been running competitively since she was in high school, and she has steadily improved over the years. She is a member of the Nike Running Club, and she trains with some of the best runners in the world.\n\nJennifer is known for her strong mental toughness and her ability to race well under pressure. She is also a very versatile runner, and she has competed successfully at distances ranging from the 5K to the marathon.\n\nIn the 2023 Boston Marathon, Jennifer will be facing a tough field of runners. However, she is confident that she can run a personal best and contend for a top-10 finish. She is excited to race in Boston, and she is looking forward to challenging herself against the best runners in the world.\n\nJennifer's training for the 2023 Boston Marathon has been going well. She has been following a strict training plan, and she has been logging high mileage. She has also been doing a lot of speed work, and she is feeling confident in her fitness.\n\nJennifer is excited to race in Boston. She has always wanted to run the Boston Marathon, and she is honored to be a part of the field. She is looking forward to the challenge, and she is confident that she can run a good race.\n\nJennifer's goals for the 2023 Boston Marathon are to run a personal best and to finish in the top 10. She knows that it will be a tough race, but she is confident that she can achieve her goals. She is excited to race in Boston, and she is looking forward to challenging herself against the best runners in the world."
        },
        {
          "firstName": "Jenny",
          "lastName": "Hitchings",
          "nat": "USA",
          "pb": "2:45:32",
          "id": "14336590",
          "hasAvy": false,
          "blurb": "Jenny is a 36-year-old American runner who will be competing in the 2023 Boston Marathon. She has a personal best of 2:45:32, which ranks her 63rd in the pro field. Jenny is a former 1500m world champion and has a wealth of experience racing at the highest level. She is known for her strong mental toughness and her ability to run well on tired legs. Jenny will be a tough competitor in Boston and will be looking to improve on her previous best time.\n\nThe 2023 Boston Marathon will be a challenging race for all participants. The course is hilly and the weather conditions can be unpredictable. However, Jenny is a seasoned professional and will be well prepared for the challenge. She has been training hard in the lead-up to the race and is confident that she can run a strong race.\n\nJenny's goal for the 2023 Boston Marathon is to break 2:40. This would be a significant accomplishment and would put her in contention for a top-10 finish. However, Jenny is also realistic about her chances and knows that anything can happen on race day. She is simply focused on running her best race and seeing where that takes her.\n\nJenny is a popular figure in the running community and has a large following of fans. She is known for her positive attitude and her willingness to help others. Jenny is a role model for many young runners and her success has inspired many people to pursue their own dreams.\n\nThe 2023 Boston Marathon will be a special race for Jenny. It will be her first time running the race and she is excited to experience the unique atmosphere. Jenny is also looking forward to racing against some of the best runners in the world. She knows that it will be a tough race, but she is confident that she can run well.\n\nJenny is a determined and focused athlete who is always looking to improve. She is a hard worker and is always willing to put in the extra effort. Jenny is a role model for many young runners and her success has inspired many people to pursue their own dreams. The 2023 Boston Marathon will be a special race for Jenny and she is excited to see what she can accomplish."
        },
        {
          "firstName": "Hilary",
          "lastName": "Corno",
          "nat": "USA",
          "pb": "2:45:34",
          "id": "14372869",
          "hasAvy": false,
          "blurb": "Hilary Dionne is a 30-year-old American marathon runner from Charlestown, Massachusetts. She qualified for the 2023 Boston Marathon with a time of 2:45:34, which ranks her 64th in the pro field. Dionne is a former steeplechase and track runner at Dartmouth College, and she has been running marathons since 2014. She is a member of the Boston Athletic Association, and she is coached by Mark Coogan.\n\nDionne is a strong runner with a lot of experience. She has run several marathons in the past, including the Boston Marathon in 2015 and 2016. She is also a strong competitor, and she is always looking to improve her time. In 2023, Dionne is hoping to break her personal best and finish in the top 50 of the Boston Marathon.\n\nDionne is a very determined athlete, and she is always working hard to improve her running. She is a great role model for young runners, and she is an inspiration to everyone who knows her. She is a true champion, and she is sure to have a great race at the 2023 Boston Marathon.\n\nHere is a possible race strategy for Dionne:\n\n* Start the race conservatively and focus on staying hydrated and eating properly.\n* Run the first 10 miles at a comfortable pace.\n* Pick up the pace in the second half of the race and try to run negative splits.\n* Aim to finish the race in under 2:40.\n\nDionne is a very talented runner, and she has the potential to run a great race at the 2023 Boston Marathon. If she can execute her race strategy well, she has a good chance of finishing in the top 50."
        },
        {
          "firstName": "Rebecca",
          "lastName": "Brown",
          "nat": "Australia",
          "pb": "2:45:43",
          "id": "14813531",
          "hasAvy": false,
          "blurb": "Rebecca Brown is a 32-year-old Australian marathon runner from Melbourne. She qualified for the 2023 Boston Marathon with a time of 2:45:43, which ranks her 65th in the pro field. Brown is a former track and field athlete at the University of Melbourne, and she has been running marathons since 2015. She is a member of the Melbourne Track Club, and she is coached by Nic Bideau.\n\nBrown is a strong runner with a lot of experience. She has run several marathons in the past, including the Boston Marathon in 2017 and 2018. She is also a strong competitor, and she is always looking to improve her time. In 2023, Brown is hoping to break her personal best and finish in the top 50 of the Boston Marathon.\n\nBrown is a very determined athlete, and she is always working hard to improve her running. She is a great role model for young runners, and she is an inspiration to everyone who knows her. She is a true champion, and she is sure to have a great race at the 2023 Boston Marathon.\n\nHere is a possible race strategy for Brown:\n\n* Start the race conservatively and focus on staying hydrated and eating properly.\n* Run the first 10 miles at a comfortable pace.\n* Pick up the pace in the second half of the race and try to run negative splits.\n* Aim to finish the race in under 2:40.\n\nBrown is a very talented runner, and she has the potential to run a great race at the 2023 Boston Marathon. If she can execute her race strategy well, she has a good chance of finishing in the top 50.\n\nHere are some possible splits for Brown:\n\n* 10K: 34:00\n* Half marathon: 1:18:00\n* 25K: 1:41:00\n* 30K: 1:54:00\n* 35K: 2:07:00\n* 40K: 2:20:00\n* 42.2K: 2:45:00\n\nThese splits are just a guess, and Brown's actual splits may vary depending on how she feels on the day of the race. However, if she can run close to these splits, she will have a good chance of finishing in the top 50.\n\nBrown is a very exciting runner to watch, and she is sure to put on a great show at the 2023 Boston Marathon."
        },
        {
          "firstName": "Erika",
          "lastName": "Kemp",
          "nat": "USA",
          "pb": "",
          "id": "14647694",
          "hasAvy": true,
          "blurb": "Erika, a 25-year-old American runner, is making her marathon debut at the 2023 Boston Marathon. She has a personal best of 2:20:00 in the half marathon, and she is hoping to break the 2:30 barrier in her first marathon.\n\nErika has been training hard for the Boston Marathon, and she is confident that she is ready to run a good race. She has been following a strict training plan, and she has been logging long miles on the roads. She has also been doing plenty of speed work, and she is feeling strong and fit.\n\nErika is excited to run the Boston Marathon, and she is looking forward to the challenge. She knows that the Boston Marathon is a tough race, but she is confident that she can run well. She is hoping to finish the race in under 2:30, and she is even hoping to break the 2:20 barrier.\n\nErika will be facing some tough competition in the Boston Marathon. There are many experienced marathoners who will be vying for the top spots. However, Erika is confident in her abilities, and she is determined to run a good race. She is looking forward to the Boston Marathon, and she is excited to see what she can do.\n\nHere is a possible race plan for Erika:\n\n* Start conservatively and focus on staying hydrated and eating well.\n* Aim to run at a pace of 6:00-6:15 per mile for the first half of the race.\n* If feeling good, pick up the pace in the second half of the race and aim to finish in under 2:30.\n* Be prepared to walk or run through the Newton Hills.\n* Enjoy the experience and have fun!"
        },
        {
          "firstName": "Danielle",
          "lastName": "Moreno",
          "nat": "USA",
          "pb": "",
          "id": "14466250",
          "hasAvy": false,
          "blurb": "Danielle Moreno is a 27-year-old American marathon runner who is making her marathon debut at the 2023 Boston Marathon. She has a personal best of 1:10:30 in the half marathon, which she set at the 2022 Houston Half Marathon. She is hoping to break the 2:30 barrier in her first marathon.\n\nMoreno has been training hard for the Boston Marathon, and she is confident that she is ready to run a good race. She has been following a strict training plan, and she has been logging long miles on the roads. She has also been doing plenty of speed work, and she is feeling strong and fit.\n\nMoreno is excited to run the Boston Marathon, and she is looking forward to the challenge. She knows that the Boston Marathon is a tough race, but she is confident that she can run well. She is hoping to finish the race in under 2:30, and she is even hoping to break the 2:20 barrier.\n\nMoreno will be facing some tough competition in the Boston Marathon. There are many experienced marathoners who will be vying for the top spots. However, Moreno is confident in her abilities, and she is determined to run a good race. She is looking forward to the Boston Marathon, and she is excited to see what she can do.\n\nHere is a possible race plan for Moreno:\n\n* Start conservatively and focus on staying hydrated and eating well.\n* Aim to run at a pace of 6:00-6:15 per mile for the first half of the race.\n* If feeling good, pick up the pace in the second half of the race and aim to finish in under 2:30.\n* Be prepared to walk or run through the Newton Hills.\n* Enjoy the experience and have fun!\n\nBased on her personal best in the half marathon, Moreno is likely to run a 2:25-2:30 marathon. However, she has the potential to run even faster if she has a good day and the race conditions are favorable.\n\nHere are some possible splits for Moreno:\n\n* 1:08:00-1:09:00 for the first half of the race\n* 1:16:00-1:17:00 for the second half of the race\n* 2:24:00-2:26:00 for the overall time\n\nOf course, these are just estimates, and Moreno's actual time could vary depending on a number of factors, including the weather, the competition, and her own fitness level. But based on her training and her personal best, she is certainly capable of running a 2:25-2:30 marathon."
        },
        {
          "firstName": "Maria",
          "lastName": "Coffin",
          "nat": "USA",
          "pb": "",
          "id": "14708146",
          "hasAvy": false,
          "blurb": "Maria, a 25-year-old from the United States, is making her marathon debut at the 2023 Boston Marathon. She has a personal best of 2:30 in the half marathon, and she is hoping to break 3 hours in her first marathon.\n\nMaria has been training hard for the Boston Marathon, and she is confident that she is ready for the challenge. She has been running for over 10 years, and she has competed in many half marathons and shorter races. She is a member of a local running club, and she trains with her teammates several times a week.\n\nMaria is excited to run the Boston Marathon, and she is looking forward to the challenge. She knows that it will be a tough race, but she is confident that she can do well. She is also looking forward to the experience of running on the Boston Marathon course, which is one of the most famous and challenging courses in the world.\n\nMaria is a strong and determined runner, and she is sure to put on a good show at the Boston Marathon. She is a talented athlete with a lot of potential, and she is sure to be a force to be reckoned with in the years to come.\n\nHere is a possible race strategy for Maria:\n\n* Start out conservatively and focus on staying relaxed and comfortable.\n* Aim to run the first half of the race in about 1:15.\n* Pick up the pace in the second half of the race and try to run a negative split.\n* Aim to finish the race in under 3 hours.\n\nThis is just a possible race strategy, and Maria may need to adjust it based on how she is feeling on race day. However, it is a good starting point for her to plan her race.\n\nMaria is a talented runner with a lot of potential. She is sure to put on a good show at the Boston Marathon. She is a force to be reckoned with, and she is sure to make her mark on the sport of running."
        }
      ]
    },
    "Men's Marathon": {
      "entrants": [
        {
          "firstName": "Eliud",
          "lastName": "Kipchoge",
          "nat": "Kenya",
          "pb": "2:01:09 WR",
          "id": "14208194",
          "hasAvy": true,
          "blurb": "Eliud Kipchoge is the reigning Olympic marathon champion and world record holder. He is also a four-time winner of the London Marathon and a two-time winner of the Berlin Marathon. Kipchoge is considered by many to be the greatest marathon runner of all time.\n\nKipchoge will be the favorite to win the 2023 Boston Marathon. He has a personal best of 2:01:09, which is the world record. He has also won the Boston Marathon twice before, in 2016 and 2021.\n\nKipchoge's main competition in Boston will come from fellow Kenyans Evans Chebet and Benson Kipruto. Chebet is the reigning Boston Marathon champion, while Kipruto is the 2018 world champion. Both Chebet and Kipruto have personal bests of 2:03:00, which is just a few seconds slower than Kipchoge's world record.\n\nThe Boston Marathon is a difficult course, with a number of hills. However, Kipchoge is a very experienced runner and he knows how to race on a hilly course. He is also a very strong mental athlete and he is able to stay focused and motivated even when the going gets tough.\n\nI expect Kipchoge to win the 2023 Boston Marathon. He is the best marathon runner in the world and he is the most experienced runner in the field. He has the speed, the endurance, and the mental toughness to win the race.\n\nHere is a possible race scenario:\n\nKipchoge will start the race conservatively and he will let the other runners set the pace. He will then gradually move up through the field and he will take the lead around the 30-kilometer mark. He will then run a strong second half of the race and he will cross the finish line in first place.\n\nKipchoge's time will likely be close to his world record, but he may not be able to break it. The Boston Marathon course is hilly and it is difficult to run a fast time on a hilly course. However, Kipchoge is a very talented runner and he is always capable of running a great race."
        },
        {
          "firstName": "Evans",
          "lastName": "Chebet",
          "nat": "Kenya",
          "pb": "2:03:00",
          "id": "14483236",
          "hasAvy": true,
          "blurb": "Evans Chebet is a Kenyan marathon runner who will be competing in the 2023 Boston Marathon. He is the defending champion, having won the race in 2022 in a time of 2:03:00. Chebet is considered one of the top marathon runners in the world, and he will be a favorite to win the race again in 2023.\n\nChebet is a strong runner on both hills and flats. He has a good finishing kick, which could be important in a close race. He is also experienced at running the Boston Marathon, which will be to his advantage.\n\nThe other top contenders in the 2023 Boston Marathon include Eliud Kipchoge, Benson Kipruto, and Geoffrey Kamworor. Kipchoge is the world record holder in the marathon, and he is always a threat to win any race he enters. Kipruto is the 2017 Boston Marathon champion, and he is another strong runner on both hills and flats. Kamworor is the 2018 and 2020 New York City Marathon champion, and he is a versatile runner who can compete well on any course.\n\nThe 2023 Boston Marathon is shaping up to be an exciting race. Chebet will be the defending champion, but he will face stiff competition from Kipchoge, Kipruto, and Kamworor. It will be interesting to see who comes out on top.\n\nBased on his PB and other details, it is likely that Evans Chebet will perform well in the 2023 Boston Marathon. He is a strong runner with a good finishing kick, and he has experience at running the Boston Marathon. However, he will face stiff competition from Eliud Kipchoge, Benson Kipruto, and Geoffrey Kamworor. It will be an exciting race to watch."
        },
        {
          "firstName": "Gabriel",
          "lastName": "Geay",
          "nat": "Tanzania",
          "pb": "2:03:00 NR",
          "id": "14677692",
          "hasAvy": true,
          "blurb": "Gabriel Geay is a Tanzanian long-distance runner who has a personal best of 2:03:00. He is the national record holder in the marathon and is considered to be one of the top marathon runners in Africa.\n\nGeay was born in Arusha, Tanzania, in 1996. He began running at a young age and quickly showed promise. In 2015, he won the World Youth Championships in Athletics. He made his marathon debut in 2018 and finished in second place at the Djibouti Marathon.\n\nGeay's breakthrough came in 2020, when he won the Valencia Marathon in a time of 2:03:00. He followed that up with a win at the Milan Marathon in 2021. Geay has also won the Cape Town Marathon and the Paris Marathon.\n\nGeay is a very talented runner who is capable of running very fast times. He is a strong contender to win the 2023 Boston Marathon. He will likely start out conservatively and then pick up the pace in the second half of the race. He will be looking to run a negative split, which means that he will run the second half of the race faster than the first half.\n\nGeay's possible splits for the 2023 Boston Marathon are as follows:\n\n* 1:06:00 for the first half\n* 1:07:00 for the second half\n* 2:03:00 for the overall time\n\nThese splits are just a prediction, and Geay may need to adjust them based on how he is feeling on race day. However, they give a good indication of what he is capable of.\n\nGeay is a very talented runner, and he is sure to put on a good show at the 2023 Boston Marathon. He is a contender to win the race, and he will be looking to make history as the first Tanzanian to win the Boston Marathon."
        },
        {
          "firstName": "Herpasa",
          "lastName": "Negasa",
          "nat": "Ethiopia",
          "pb": "2:03:40",
          "id": "14568259",
          "hasAvy": true,
          "blurb": "Herpasa Negasa is an Ethiopian marathon runner with a personal best (PB) of 2:03:40, which ranks him fourth in the pro field for the 2023 Boston Marathon. He is one of the top athletes from Ethiopia in the field, along with Lelisa Desisa and Shura Kitata.\n\nNegasa has a strong track record in the marathon. He won the Dubai Marathon in 2019 with a time of 2:03:40, and he has also finished on the podium at the Tokyo Marathon and the Amsterdam Marathon. He is a consistent performer, and he is capable of running a fast time on a good day.\n\nThe Boston Marathon is a challenging course, but Negasa has the experience and the fitness to run well on it. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nNegasa is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHere is a possible race strategy for Negasa:\n\n* Start conservatively in the first half of the race.\n* Aim to run a negative split in the second half of the race.\n* Make a move for the lead in the final miles of the race.\n\nNegasa will need to be patient in the early stages of the race. He should not get caught up in the excitement of the race and start too fast. He should focus on running his own race and conserving his energy.\n\nIn the second half of the race, Negasa can start to make his move. He should try to run a negative split, which means running the second half of the race faster than the first half. This will help him to close the gap on the leaders and potentially make a move for the win.\n\nIn the final miles of the race, Negasa can make his final push for the win. He should try to run as fast as he can and see if he can catch the leaders. If he is able to do so, he will be in contention for the win.\n\nNegasa is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right."
        },
        {
          "firstName": "Benson",
          "lastName": "Kipruto",
          "nat": "Kenya",
          "pb": "2:04:24",
          "id": "14758213",
          "hasAvy": true,
          "blurb": "Benson Kipruto is a Kenyan marathon runner with a personal best (PB) of 2:04:24, which ranks him fifth in the pro field for the 2023 Boston Marathon. He is one of the top athletes from Kenya in the field, along with Eliud Kipchoge and Evans Chebet.\n\nKipruto has a strong track record in the marathon. He won the Amsterdam Marathon in 2018 with a time of 2:04:24, and he has also finished on the podium at the Tokyo Marathon and the Dubai Marathon. He is a consistent performer, and he is capable of running a fast time on a good day.\n\nThe Boston Marathon is a challenging course, but Kipruto has the experience and the fitness to run well on it. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHere is a possible race strategy for Kipruto:\n\n* Start conservatively in the first half of the race.\n* Aim to run a negative split in the second half of the race.\n* Make a move for the lead in the final miles of the race.\n\nKipruto will need to be patient in the early stages of the race. He should not get caught up in the excitement of the race and start too fast. He should focus on running his own race and conserving his energy.\n\nIn the second half of the race, Kipruto can start to make his move. He should try to run a negative split, which means running the second half of the race faster than the first half. This will help him to close the gap on the leaders and potentially make a move for the win.\n\nIn the final miles of the race, Kipruto can make his final push for the win. He should try to run as fast as he can and see if he can catch the leaders. If he is able to do so, he will be in contention for the win.\n\nKipruto is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHowever, it is important to note that Kipruto has not raced since 2021, when he finished second at the Amsterdam Marathon. It is unclear how he will perform after such a long layoff. He will need to be in good shape to challenge for the win in Boston."
        },
        {
          "firstName": "Lelisa",
          "lastName": "Desisa",
          "nat": "Ethiopia",
          "pb": "2:04:45",
          "id": "14377814",
          "hasAvy": true,
          "blurb": "Lelisa Desisa is an Ethiopian marathon runner with a personal best (PB) of 2:04:45, which ranks him sixth in the pro field for the 2023 Boston Marathon. He is one of the top athletes from Ethiopia in the field, along with Herpasa Negasa and Shura Kitata.\n\nDesisa has a strong track record in the marathon. He won the Boston Marathon in 2013 and 2015, and he has also finished on the podium at the Dubai Marathon and the Chicago Marathon. He is a consistent performer, and he is capable of running a fast time on a good day.\n\nThe Boston Marathon is a challenging course, but Desisa has the experience and the fitness to run well on it. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHere is a possible race strategy for Desisa:\n\n* Start conservatively in the first half of the race.\n* Aim to run a negative split in the second half of the race.\n* Make a move for the lead in the final miles of the race.\n\nDesisa will need to be patient in the early stages of the race. He should not get caught up in the excitement of the race and start too fast. He should focus on running his own race and conserving his energy.\n\nIn the second half of the race, Desisa can start to make his move. He should try to run a negative split, which means running the second half of the race faster than the first half. This will help him to close the gap on the leaders and potentially make a move for the win.\n\nIn the final miles of the race, Desisa can make his final push for the win. He should try to run as fast as he can and see if he can catch the leaders. If he is able to do so, he will be in contention for the win.\n\nDesisa is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHowever, it is important to note that Desisa has not raced since 2020, when he finished second at the London Marathon. It is unclear how he will perform after such a long layoff. He will need to be in good shape to challenge for the win in Boston.\n\nIn addition, Desisa has not won a marathon since 2015. He has been runner-up three times since then, including at the 2018 and 2020 Boston Marathons. It is unclear if he has the same level of motivation and focus that he had when he was winning marathons.\n\nOverall, Desisa is a talented runner with a strong track record. However, he has some question marks heading into the 2023 Boston Marathon. He will need to be in good shape and have a good race strategy if he wants to challenge for the win."
        },
        {
          "firstName": "Shura",
          "lastName": "Kitata",
          "nat": "Ethiopia",
          "pb": "2:04:49",
          "id": "14730723",
          "hasAvy": true,
          "blurb": "Shura Kitata is an Ethiopian marathon runner with a personal best (PB) of 2:04:49, which ranks him seventh in the pro field for the 2023 Boston Marathon. He is one of the top athletes from Ethiopia in the field, along with Herpasa Negasa and Lelisa Desisa.\n\nKitata has a strong track record in the marathon. He won the 2020 London Marathon in a time of 2:04:49, and he has also finished on the podium at the Dubai Marathon and the Tokyo Marathon. He is a consistent performer, and he is capable of running a fast time on a good day.\n\nThe Boston Marathon is a challenging course, but Kitata has the experience and the fitness to run well on it. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHere is a possible race strategy for Kitata:\n\n* Start conservatively in the first half of the race.\n* Aim to run a negative split in the second half of the race.\n* Make a move for the lead in the final miles of the race.\n\nKitata will need to be patient in the early stages of the race. He should not get caught up in the excitement of the race and start too fast. He should focus on running his own race and conserving his energy.\n\nIn the second half of the race, Kitata can start to make his move. He should try to run a negative split, which means running the second half of the race faster than the first half. This will help him to close the gap on the leaders and potentially make a move for the win.\n\nIn the final miles of the race, Kitata can make his final push for the win. He should try to run as fast as he can and see if he can catch the leaders. If he is able to do so, he will be in contention for the win.\n\nKitata is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHowever, it is important to note that Kitata has not raced since 2021, when he finished sixth at the London Marathon. It is unclear how he will perform after such a long layoff. He will need to be in good shape to challenge for the win in Boston.\n\nIn addition, Kitata has not won a marathon since 2020. He has been runner-up twice since then, including at the 2021 New York City Marathon. It is unclear if he has the same level of motivation and focus that he had when he was winning marathons.\n\nOverall, Kitata is a talented runner with a strong track record. However, he has some question marks heading into the 2023 Boston Marathon. He will need to be in good shape and have a good race strategy if he wants to challenge for the win."
        },
        {
          "firstName": "John",
          "lastName": "Korir",
          "nat": "Kenya",
          "pb": "2:05:01",
          "id": "14845463",
          "hasAvy": true,
          "blurb": "John Korir is a Kenyan marathon runner who has a personal best (PB) of 2:05:01. This ranks him 8th in the pro field for the 2023 Boston Marathon. He is one of the top athletes from Kenya in the field, along with Eliud Kipchoge and Evans Chebet.\n\nKorir has a strong track record in the marathon. He won the 2021 Los Angeles Marathon in a time of 2:09:08, and he has also finished on the podium at the Amsterdam Marathon and the Dubai Marathon. He is a consistent performer, and he is capable of running a fast time on a good day.\n\nThe Boston Marathon is a challenging course, but Korir has the experience and the fitness to run well on it. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHere is a possible race strategy for Korir:\n\n* Start conservatively in the first half of the race.\n* Aim to run a negative split in the second half of the race.\n* Make a move for the lead in the final miles of the race.\n\nKorir will need to be patient in the early stages of the race. He should not get caught up in the excitement of the race and start too fast. He should focus on running his own race and conserving his energy.\n\nIn the second half of the race, Korir can start to make his move. He should try to run a negative split, which means running the second half of the race faster than the first half. This will help him to close the gap on the leaders and potentially make a move for the win.\n\nIn the final miles of the race, Korir can make his final push for the win. He should try to run as fast as he can and see if he can catch the leaders. If he is able to do so, he will be in contention for the win.\n\nKorir is a strong contender for the 2023 Boston Marathon. He has the talent, the experience, and the fitness to run a fast time on the challenging course. He will be looking to challenge for a podium finish, and he could even be in contention for the win if the conditions are right.\n\nHowever, it is important to note that Korir has not raced since 2021, when he won the Los Angeles Marathon. It is unclear how he will perform after such a long layoff. He will need to be in good shape to challenge for the win in Boston.\n\nOverall, Korir is a talented runner with a strong track record. However, he has some question marks heading into the 2023 Boston Marathon. He will need to be in good shape and have a good race strategy if he wants to challenge for the win."
        },
        {
          "firstName": "Nobert",
          "lastName": "Kigen",
          "nat": "Kenya",
          "pb": "2:05:13",
          "id": "14675185",
          "hasAvy": false,
          "blurb": "Nobert Kigen is a Kenyan marathon runner who has a personal best (PB) of 2:05:13. He will be competing in the Men's Marathon at the 2023 Boston Marathon. Kigen is ranked 9th in the pro field based on his PB. He is considered to be a dark horse in the race, and could potentially finish in the top 5 if he has a good day.\n\nKigen is a strong runner with a lot of experience. He has won several marathons, including the 2018 Boston Marathon. He is also a two-time Olympian, having competed in the 2012 and 2016 Olympics.\n\nKigen will be facing stiff competition in the Boston Marathon. The top athletes from Kenya in the field by PB are Eliud Kipchoge (2:01:09 WR), Evans Chebet (2:03:00), and Benson Kipruto (2:04:24). These are all world-class runners who are capable of winning the race.\n\nHowever, Kigen is a talented runner who is capable of running a fast time. If he can stay with the leaders for the first half of the race, he will have a good chance of finishing in the top 5.\n\nKigen will need to be careful not to go out too fast in the early stages of the race. He will need to pace himself and save some energy for the second half of the race. If he can do that, he will have a good chance of finishing on the podium.\n\nKigen is a talented runner who is capable of running a fast time in the Boston Marathon. He will be facing stiff competition, but he has a good chance of finishing in the top 5."
        },
        {
          "firstName": "Ghirmay",
          "lastName": "Ghebreslassie",
          "nat": "Eritrea",
          "pb": "2:05:34",
          "id": "14526656",
          "hasAvy": true
        },
        {
          "firstName": "Andualem",
          "lastName": "Belay",
          "nat": "Ethiopia",
          "pb": "2:05:45",
          "id": "14546661",
          "hasAvy": true
        },
        {
          "firstName": "Mark",
          "lastName": "Korir",
          "nat": "Kenya",
          "pb": "2:05:49",
          "id": "14243283",
          "hasAvy": true
        },
        {
          "firstName": "Filmon",
          "lastName": "Ande",
          "nat": "Eritrea",
          "pb": "2:06:38",
          "id": "14773933",
          "hasAvy": true
        },
        {
          "firstName": "Andamlak",
          "lastName": "Belihu",
          "nat": "Ethiopia",
          "pb": "2:06:40",
          "id": "14800831",
          "hasAvy": true
        },
        {
          "firstName": "Isaac",
          "lastName": "Mpofu",
          "nat": "Zimbabwe",
          "pb": "2:06:48 NR",
          "id": "14654920",
          "hasAvy": true
        },
        {
          "firstName": "Hamza",
          "lastName": "Sahli",
          "nat": "Morocco",
          "pb": "2:07:15",
          "id": "14212196",
          "hasAvy": true
        },
        {
          "firstName": "Michael",
          "lastName": "Githae",
          "nat": "Kenya",
          "pb": "2:07:28",
          "id": "14644141",
          "hasAvy": false
        },
        {
          "firstName": "Albert",
          "lastName": "Korir",
          "nat": "Kenya",
          "pb": "2:08:03",
          "id": "14645745",
          "hasAvy": true
        },
        {
          "firstName": "Conner",
          "lastName": "Mantz",
          "nat": "USA",
          "pb": "2:08:16",
          "id": "14628442",
          "hasAvy": true
        },
        {
          "firstName": "Scott",
          "lastName": "Fauble",
          "nat": "USA",
          "pb": "2:08:52",
          "id": "14452474",
          "hasAvy": true
        },
        {
          "firstName": "Melikhaya",
          "lastName": "Frans",
          "nat": "South Africa",
          "pb": "2:09:24",
          "id": "14385084",
          "hasAvy": true
        },
        {
          "firstName": "Matt",
          "lastName": "McDonald",
          "nat": "USA",
          "pb": "2:09:49",
          "id": "14470801",
          "hasAvy": true
        },
        {
          "firstName": "Nico",
          "lastName": "Montanez",
          "nat": "USA",
          "pb": "2:09:55",
          "id": "14571119",
          "hasAvy": true
        },
        {
          "firstName": "Mick",
          "lastName": "Iacofano",
          "nat": "USA",
          "pb": "2:09:55",
          "id": "14680348",
          "hasAvy": false
        },
        {
          "firstName": "Mustafa",
          "lastName": "Mohamed",
          "nat": "Sweden",
          "pb": "2:10:03 NR",
          "id": "14227863",
          "hasAvy": true
        },
        {
          "firstName": "Hendrik",
          "lastName": "Pfeiffer",
          "nat": "Germany",
          "pb": "2:10:18",
          "id": "14429726",
          "hasAvy": true
        },
        {
          "firstName": "CJ",
          "lastName": "Albertson",
          "nat": "USA",
          "pb": "2:10:23",
          "id": "14631054",
          "hasAvy": true
        },
        {
          "firstName": "Nathan",
          "lastName": "Martin",
          "nat": "USA",
          "pb": "2:11:05",
          "id": "14402548",
          "hasAvy": false
        },
        {
          "firstName": "Colin",
          "lastName": "Mickow",
          "nat": "USA",
          "pb": "2:11:22",
          "id": "14361805",
          "hasAvy": true
        },
        {
          "firstName": "Wilkerson",
          "lastName": "Given",
          "nat": "USA",
          "pb": "2:11:44",
          "id": "14456312",
          "hasAvy": false
        },
        {
          "firstName": "Turner",
          "lastName": "Wiley",
          "nat": "USA",
          "pb": "2:11:59",
          "id": "14627160",
          "hasAvy": false
        },
        {
          "firstName": "Jonas",
          "lastName": "Hampton",
          "nat": "USA",
          "pb": "2:12:10",
          "id": "14459984",
          "hasAvy": true
        },
        {
          "firstName": "Ben",
          "lastName": "True",
          "nat": "USA",
          "pb": "2:12:53",
          "id": "14253490",
          "hasAvy": true
        },
        {
          "firstName": "Mick",
          "lastName": "Clohisey",
          "nat": "Ireland",
          "pb": "2:13:19",
          "id": "14198792",
          "hasAvy": true
        },
        {
          "firstName": "Brian",
          "lastName": "Shrader",
          "nat": "USA",
          "pb": "2:13:27",
          "id": "14459356",
          "hasAvy": false
        },
        {
          "firstName": "Paul",
          "lastName": "Hogan",
          "nat": "USA",
          "pb": "2:14:55",
          "id": "14629439",
          "hasAvy": false
        },
        {
          "firstName": "JP",
          "lastName": "Flavin",
          "nat": "USA",
          "pb": "2:14:55",
          "id": "14794002",
          "hasAvy": false
        },
        {
          "firstName": "Sam",
          "lastName": "Chelanga",
          "nat": "USA",
          "pb": "2:15:02",
          "id": "14207498",
          "hasAvy": false
        },
        {
          "firstName": "Pardon",
          "lastName": "Ndhlovu",
          "nat": "USA",
          "pb": "2:15:04",
          "id": "14413956",
          "hasAvy": true
        },
        {
          "firstName": "Joe",
          "lastName": "Whelan",
          "nat": "USA",
          "pb": "2:15:36",
          "id": "14815718",
          "hasAvy": false
        },
        {
          "firstName": "Connor",
          "lastName": "Weaver",
          "nat": "USA",
          "pb": "2:15:49",
          "id": "14820782",
          "hasAvy": false
        },
        {
          "firstName": "Zachary",
          "lastName": "Ornelas",
          "nat": "USA",
          "pb": "2:16:01",
          "id": "14326657",
          "hasAvy": false
        },
        {
          "firstName": "Fernando",
          "lastName": "Cabada",
          "nat": "USA",
          "pb": "2:16:52",
          "id": "14234027",
          "hasAvy": false
        },
        {
          "firstName": "Edward",
          "lastName": "Mulder",
          "nat": "USA",
          "pb": "2:16:55",
          "id": "14510661",
          "hasAvy": false
        },
        {
          "firstName": "Matt",
          "lastName": "Lenehan",
          "nat": "USA",
          "pb": "2:17:02",
          "id": "14495208",
          "hasAvy": false
        },
        {
          "firstName": "Andrew",
          "lastName": "McCann",
          "nat": "USA",
          "pb": "2:17:07",
          "id": "14245308",
          "hasAvy": false
        },
        {
          "firstName": "Jon",
          "lastName": "Mott",
          "nat": "USA",
          "pb": "2:17:20",
          "id": "14459585",
          "hasAvy": false
        },
        {
          "firstName": "Jack",
          "lastName": "Mastandra",
          "nat": "USA",
          "pb": "2:17:28",
          "id": "14778142",
          "hasAvy": false
        },
        {
          "firstName": "Brian",
          "lastName": "Harvey",
          "nat": "USA",
          "pb": "2:17:40",
          "id": "14240159",
          "hasAvy": false
        },
        {
          "firstName": "Eduardo",
          "lastName": "Garcia",
          "nat": "USA",
          "pb": "2:17:44",
          "id": "14673300",
          "hasAvy": true
        },
        {
          "firstName": "Adam",
          "lastName": "Wollant",
          "nat": "USA",
          "pb": "2:17:53",
          "id": "14632164",
          "hasAvy": false
        },
        {
          "firstName": "Mark",
          "lastName": "Messmer",
          "nat": "USA",
          "pb": "2:17:56",
          "id": "14602508",
          "hasAvy": false
        },
        {
          "firstName": "Jason",
          "lastName": "Ayr",
          "nat": "USA",
          "pb": "2:18:14",
          "id": "14546928",
          "hasAvy": false
        },
        {
          "firstName": "Luis",
          "lastName": "Carlos Rivero",
          "nat": "Guatemala",
          "pb": "2:18:30",
          "id": "14569136",
          "hasAvy": true
        },
        {
          "firstName": "Eric",
          "lastName": "Ashe",
          "nat": "USA",
          "pb": "2:18:42",
          "id": "14231609",
          "hasAvy": false
        },
        {
          "firstName": "Austin",
          "lastName": "OBrien",
          "nat": "USA",
          "pb": "2:18:43",
          "id": "14457201",
          "hasAvy": false
        },
        {
          "firstName": "Gilles",
          "lastName": "Rubio",
          "nat": "France",
          "pb": "2:18:53",
          "id": "14668038",
          "hasAvy": false
        },
        {
          "firstName": "Sergio",
          "lastName": "Reyes",
          "nat": "USA",
          "pb": "2:19:51",
          "id": "14249418",
          "hasAvy": false
        },
        {
          "firstName": "Prescott",
          "lastName": "Leach",
          "nat": "USA",
          "pb": "2:19:57",
          "id": "14243781",
          "hasAvy": false
        },
        {
          "firstName": "Augustine",
          "lastName": "Choge",
          "nat": "Kenya",
          "pb": "2:20:53",
          "id": "14207679",
          "hasAvy": true
        },
        {
          "firstName": "Markus",
          "lastName": "Ploner",
          "nat": "Italy",
          "pb": "2:22:39",
          "id": "14201191",
          "hasAvy": false
        },
        {
          "firstName": "Simon",
          "lastName": "Poulin",
          "nat": "Canada",
          "pb": "2:22:55",
          "id": "14817981",
          "hasAvy": false
        },
        {
          "firstName": "Dave",
          "lastName": "Archer",
          "nat": "Great Britain",
          "pb": "2:25:04",
          "id": "14405958",
          "hasAvy": false
        },
        {
          "firstName": "Steven",
          "lastName": "Lawrence",
          "nat": "USA",
          "pb": "2:25:22",
          "id": "14173943",
          "hasAvy": false
        },
        {
          "firstName": "Chip",
          "lastName": "OHara",
          "nat": "USA",
          "pb": "2:25:36",
          "id": "14641427",
          "hasAvy": false
        },
        {
          "firstName": "Anthony",
          "lastName": "Bruns",
          "nat": "USA",
          "pb": "2:25:45",
          "id": "15007584",
          "hasAvy": false
        },
        {
          "firstName": "Miguel",
          "lastName": "Morone",
          "nat": "Brazil",
          "pb": "2:25:54",
          "id": "15044911",
          "hasAvy": false
        },
        {
          "firstName": "Iain",
          "lastName": "Hunter",
          "nat": "USA",
          "pb": "2:26:06",
          "id": "14241398",
          "hasAvy": false
        },
        {
          "firstName": "Dennis",
          "lastName": "Mbelenzi",
          "nat": "Canada",
          "pb": "2:26:07",
          "id": "15026526",
          "hasAvy": false
        },
        {
          "firstName": "Zouhair",
          "lastName": "Talbi",
          "nat": "Morocco",
          "pb": "",
          "id": "14577963",
          "hasAvy": true
        }
      ]
    }
  }
}