{
  "london23": {
    "400m Hurdles Women": {
      "date": "2023-07-23T14:04",
      "blurb": "Predicted Final Places and Times:\n\n1. Femke Bol (NED) - 52.20\n2. Shamier Little (USA) - 52.80\n3. Janieve Russell (JAM) - 53.50\n4. Viktoriya Tkachuk (UKR) - 53.80\n5. Rushell Clayton (JAM) - 54.00\n6. Jessie Knight (GBR) - 54.30\n7. Gianna Woodruff (PAN) - 54.50\n8. Anna Ryzhykova (UKR) - 55.00\n\nExplanation:\n\nBased on the performances and season's best times, Femke Bol is the clear favorite to win the Women's 400m Hurdles at the 2023 London Diamond League track meet. Bol has been dominating the event throughout the season, consistently posting fast times and winning races. Her personal best of 52.03 and season's best of 52.30 are significantly faster than any other competitor in the field. Bol's recent performances, including a time of 49.82 in the 400m and 52.30 in the 400m hurdles, demonstrate her exceptional speed and ability to maintain a high level of performance.\n\nShamier Little is predicted to finish second in the race. While her personal best of 52.39 is impressive, her season's best of 53.34 suggests that she has not been able to match the level of consistency and speed displayed by Bol. Little has had some strong performances, including a time of 53.34 in the 400m hurdles, but she has also had some slower races, such as a time of 55.32. Overall, Little is a strong competitor but is unlikely to challenge Bol for the top spot.\n\nJanieve Russell is expected to finish third in the race. Although her personal best of 53.08 is slightly slower than Little's, Russell has shown more consistency in her performances this season. She has consistently posted times in the low 54-second range, including a recent time of 53.72. While Russell may not have the raw speed of Bol and Little, her consistency and ability to perform well under pressure make her a strong contender for a podium finish.\n\nViktoriya Tkachuk is predicted to finish fourth in the race. Although her personal best of 53.76 is slightly faster than Russell's, her season's best of 54.71 suggests that she has not been able to consistently match her best performances. Tkachuk has had some strong races, including a time of 52.39 in the 400m, but she has also had some slower performances, such as a time of 55.87 in the 400m hurdles. While Tkachuk has the potential to challenge for a higher position, her inconsistency makes it difficult to predict a higher finish.\n\nRushell Clayton is expected to finish fifth in the race. Her personal best of 53.33 is competitive, but her season's best of 53.79 suggests that she has not been able to consistently match her best performances. Clayton has had some strong races, including a recent time of 53.84 in the 400m hurdles, but she has also had some slower performances, such as a time of 55.73. While Clayton has the potential to challenge for a higher position, her inconsistency makes it difficult to predict a higher finish.\n\nJessie Knight is predicted to finish sixth in the race. While her personal best of 54.09 is competitive, her season's best of 54.32 suggests that she has not been able to consistently match her best performances. Knight has had some strong races, including a recent time of 54.32 in the 400m hurdles, but she has also had some slower performances, such as a time of 55.35. While Knight has the potential to challenge for a higher position, her inconsistency makes it difficult to predict a higher finish.\n\nGianna Woodruff is expected to finish seventh in the race. Her personal best of 53.69 is competitive, but her season's best of 54.46 suggests that she has not been able to consistently match her best performances. Woodruff has had some strong races, including a recent time of 54.46 in the 400m hurdles, but she has also had some slower performances, such as a time of 56.43. While Woodruff has the potential to challenge for a higher position, her inconsistency makes it difficult to predict a higher finish.\n\nAnna Ryzhykova is predicted to finish eighth in the race. While her personal best of 52.96 is competitive, her season's best of 55.41 suggests that she has not been able to consistently match her best performances. Ryzhykova has had some strong races, including a recent time of 55.41 in the 400m hurdles, but she has also had some slower performances, such as a time of 56.97. While Ryzhykova has the potential to challenge for a higher position, her inconsistency makes it difficult to predict a higher finish.\n\nIn summary, Femke Bol is the clear favorite to win the Women's 400m Hurdles at the 2023 London Diamond League track meet based on her exceptional performances and consistent speed. Shamier Little, Janieve Russell, and Viktoriya Tkachuk are expected to challenge for the podium positions, while Rushell Clayton, Jessie Knight, Gianna Woodruff, and Anna Ryzhykova will likely round out the field.",
      "entrants": [
        {
          "firstName": "Femke",
          "lastName": "Bol",
          "id": "14707010",
          "pb": "52.03",
          "sb": "52.30",
          "nat": "NED",
          "hasAvy": true
        },
        {
          "firstName": "Shamier",
          "lastName": "Little",
          "id": "14443767",
          "pb": "52.39",
          "sb": "53.34",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Anna",
          "lastName": "Ryzhykova",
          "id": "14304336",
          "pb": "52.96",
          "sb": "55.41",
          "nat": "UKR",
          "hasAvy": true
        },
        {
          "firstName": "Janieve",
          "lastName": "Russell",
          "id": "14334022",
          "pb": "53.08",
          "sb": "53.72",
          "nat": "JAM",
          "hasAvy": true
        },
        {
          "firstName": "Rushell",
          "lastName": "Clayton",
          "id": "14425208",
          "pb": "53.33",
          "sb": "53.79",
          "nat": "JAM",
          "hasAvy": true
        },
        {
          "firstName": "Gianna",
          "lastName": "Woodruff",
          "id": "14423522",
          "pb": "53.69",
          "sb": "54.46",
          "nat": "PAN",
          "hasAvy": true
        },
        {
          "firstName": "Viktoriya",
          "lastName": "Tkachuk",
          "id": "14426923",
          "pb": "53.76",
          "sb": "54.71",
          "nat": "UKR",
          "hasAvy": true
        },
        {
          "firstName": "Jessie",
          "lastName": "Knight",
          "id": "14430428",
          "pb": "54.09",
          "sb": "54.32",
          "nat": "GBR",
          "hasAvy": true
        }
      ],
      "isClosed": true,
      "results": [
        {
          "mark": "51.45",
          "place": 1,
          "notes": "",
          "entrant": {
            "firstName": "Femke",
            "lastName": "Bol",
            "id": "14707010",
            "pb": "52.03",
            "sb": "52.30",
            "nat": "NED",
            "hasAvy": true
          }
        },
        {
          "mark": "53.75",
          "place": 2,
          "notes": "",
          "entrant": {
            "firstName": "Janieve",
            "lastName": "Russell",
            "id": "14334022",
            "pb": "53.08",
            "sb": "53.72",
            "nat": "JAM",
            "hasAvy": true
          }
        },
        {
          "mark": "53.76",
          "place": 3,
          "notes": "",
          "entrant": {
            "firstName": "Shamier",
            "lastName": "Little",
            "id": "14443767",
            "pb": "52.39",
            "sb": "53.34",
            "nat": "USA",
            "hasAvy": true
          }
        },
        {
          "mark": "53.97",
          "place": 4,
          "notes": "",
          "entrant": {
            "firstName": "Rushell",
            "lastName": "Clayton",
            "id": "14425208",
            "pb": "53.33",
            "sb": "53.79",
            "nat": "JAM",
            "hasAvy": true
          }
        },
        {
          "mark": "54.09",
          "place": 5,
          "notes": "",
          "entrant": {
            "firstName": "Jessie",
            "lastName": "Knight",
            "id": "14430428",
            "pb": "54.09",
            "sb": "54.32",
            "nat": "GBR",
            "hasAvy": true
          }
        },
        {
          "mark": "54.25",
          "place": 6,
          "notes": "",
          "entrant": {
            "firstName": "Viktoriya",
            "lastName": "Tkachuk",
            "id": "14426923",
            "pb": "53.76",
            "sb": "54.71",
            "nat": "UKR",
            "hasAvy": true
          }
        },
        {
          "mark": "54.53",
          "place": 7,
          "notes": "",
          "entrant": {
            "firstName": "Anna",
            "lastName": "Ryzhykova",
            "id": "14304336",
            "pb": "52.96",
            "sb": "55.41",
            "nat": "UKR",
            "hasAvy": true
          }
        },
        {
          "mark": "55.52",
          "place": 8,
          "notes": "",
          "entrant": {
            "firstName": "Gianna",
            "lastName": "Woodruff",
            "id": "14423522",
            "pb": "53.69",
            "sb": "54.46",
            "nat": "PAN",
            "hasAvy": true
          }
        }
      ]
    },
    "1500m Men": {
      "date": "2023-07-23T14:14",
      "blurb": "Predicted Finish and Times:\n\n1. Timothy Cheruiyot (KEN) - 3:28.50\n2. Yared Nuguse (USA) - 3:29.00\n3. Stewart McSweyn (AUS) - 3:30.00\n4. Neil Gourley (GBR) - 3:30.50\n5. Mario García (ESP) - 3:31.00\n6. Adel Mechaal (ESP) - 3:31.50\n7. Samuel Tanner (NZL) - 3:31.80\n8. George Mills (GBR) - 3:32.20\n9. Andrew Coscoran (IRL) - 3:32.50\n10. Cole Hocker (USA) - 3:32.80\n11. Matthew Stonier (GBR) - 3:33.20\n12. Oliver Hoare (AUS) - 3:33.50\n13. Erik Sowinski (USA) - 3:40.00\n14. Narve Gilje Nordås (NOR) - 3:41.00\n15. Azeddine Habz (FRA) - 3:42.00\n16. Elliot Giles (GBR) - 3:43.00\n\nExplanation:\n\nBased on the provided data, Timothy Cheruiyot is the clear favorite to win the Men's 1500m at the 2023 London Diamond League track meet. With a personal best of 3:28.28 and consistent top performances throughout the season, including a recent victory in Los Angeles, Cheruiyot has consistently shown his dominance in this distance. His season's best time of 3:29.08 is just a fraction off his personal best, indicating that he is in top form.\n\nYared Nuguse, with a personal best and season's best time of 3:29.02, is likely to be Cheruiyot's closest competitor. Nuguse has had a strong season, consistently finishing near the top in various races. His recent victory in Eugene, Oregon, with a time of 3:35.37, showcases his ability to compete at a high level.\n\nStewart McSweyn, Neil Gourley, and Mario García are expected to battle for the remaining podium spots. McSweyn, with a personal best of 3:29.51, has shown potential but has had mixed performances this season. However, his recent time of 3:32.85 in Lausanne suggests that he could be in contention.\n\nGourley, with a personal best of 3:30.88 and a season's best of 3:30.42, has consistently performed well throughout the season, including a victory in Nice with a time of 3:32.68. This makes him a strong contender for a top finish.\n\nGarcía, with a personal best and season's best time of 3:29.18, has had a decent season but has not shown the same level of consistency as the top contenders. However, his recent performance in Oslo, where he finished fifth with a time of 3:29.18, indicates that he could potentially challenge for a podium spot.\n\nThe rest of the field, including Adel Mechaal, Samuel Tanner, George Mills, Andrew Coscoran, Cole Hocker, Matthew Stonier, Oliver Hoare, Erik Sowinski, Narve Gilje Nordås, Azeddine Habz, and Elliot Giles, have shown flashes of potential but lack the consistent performances to challenge the top contenders.",
      "entrants": [
        {
          "firstName": "Timothy",
          "lastName": "Cheruiyot",
          "id": "14643526",
          "pb": "3:28.28",
          "sb": "3:29.08",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Yared",
          "lastName": "Nuguse",
          "id": "14798735",
          "pb": "3:29.02",
          "sb": "3:29.02",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Mario",
          "lastName": "García",
          "id": "14691570",
          "pb": "3:29.18",
          "sb": "3:29.18",
          "nat": "ESP",
          "hasAvy": true
        },
        {
          "firstName": "Azeddine",
          "lastName": "Habz",
          "id": "14640588",
          "pb": "3:29.26",
          "sb": "3:29.26",
          "nat": "FRA",
          "hasAvy": true
        },
        {
          "firstName": "Oliver",
          "lastName": "Hoare",
          "id": "14667553",
          "pb": "3:29.41",
          "sb": "3:29.41",
          "nat": "AUS",
          "hasAvy": true
        },
        {
          "firstName": "Narve Gilje",
          "lastName": "Nordås",
          "id": "14705412",
          "pb": "3:29.47",
          "sb": "3:29.47",
          "nat": "NOR",
          "hasAvy": true
        },
        {
          "firstName": "Stewart",
          "lastName": "McSweyn",
          "id": "14500488",
          "pb": "3:29.51",
          "sb": "3:32.85",
          "nat": "AUS",
          "hasAvy": true
        },
        {
          "firstName": "Andrew",
          "lastName": "Coscoran",
          "id": "14595170",
          "pb": "3:30.42",
          "sb": "3:30.42",
          "nat": "IRL",
          "hasAvy": true
        },
        {
          "firstName": "Adel",
          "lastName": "Mechaal",
          "id": "14376490",
          "pb": "3:30.77",
          "sb": "3:35.67",
          "nat": "ESP",
          "hasAvy": true
        },
        {
          "firstName": "Neil",
          "lastName": "Gourley",
          "id": "14513077",
          "pb": "3:30.88",
          "sb": "3:30.88",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Samuel",
          "lastName": "Tanner",
          "id": "14785591",
          "pb": "3:31.24",
          "sb": "3:31.24",
          "nat": "NZL",
          "hasAvy": true
        },
        {
          "firstName": "Cole",
          "lastName": "Hocker",
          "id": "14905834",
          "pb": "3:31.40",
          "sb": "3:34.14",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "George",
          "lastName": "Mills",
          "id": "14646350",
          "pb": "3:31.54",
          "sb": "3:31.54",
          "nat": "GBR",
          "hasAvy": false
        },
        {
          "firstName": "Elliot",
          "lastName": "Giles",
          "id": "14457638",
          "pb": "3:31.56",
          "sb": "3:31.56",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Matthew",
          "lastName": "Stonier",
          "id": "14843612",
          "pb": "3:32.50",
          "sb": "3:33.45",
          "nat": "GBR",
          "hasAvy": false
        },
        {
          "firstName": "Erik",
          "lastName": "Sowinski",
          "id": "14360557",
          "pb": "3:44.82",
          "sb": null,
          "nat": "USA",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "5000m Women": {
      "date": "2023-07-23T14:27",
      "blurb": "Predicted Finish and Times:\n\n1. Gudaf Tsegay (ETH): 14:20.00\n2. Sifan Hassan (NED): 14:23.00\n3. Beatrice Chebet (KEN): 14:35.00\n4. Alicia Monson (USA): 14:40.00\n5. Karoline Bjerkeli Grøvdal (NOR): 14:45.00\n6. Medina Eisa (ETH): 14:50.00\n7. Margaret Akidor (KEN): 14:55.00\n8. Teresiah Muthoni Gateri (KEN): 14:58.00\n9. Girmawit Gebrzihair (ETH): 15:00.00\n10. Mizan Alem (ETH): 15:02.00\n11. Elly Henes (USA): 15:05.00\n12. Josette Andrews (USA): 15:08.00\n13. Nadia Battocletti (ITA): 15:12.00\n14. Melknat Wudu (ETH): 15:15.00\n15. Maureen Koster (NED): 15:18.00\n16. Jessica Warner-Judd (GBR): 15:22.00\n17. Rose Davies (AUS): 15:25.00\n18. Amy-Eloise Markovc (GBR): 15:30.00\n19. Megan Keith (GBR): 15:35.00\n20. Werkuha Getachew (ETH): 15:40.00\n21. Birke Haylom (ETH): 15:45.00\n\nExplanation:\n\nBased on their recent performances and personal bests, Gudaf Tsegay is the clear favorite to win the Women's 5000m at the London Diamond League track meet. Tsegay has been dominant in the 2023 season, winning multiple races and setting impressive times in various distances. Her recent 10,000m performance of 29:29.73 shows her strength and endurance, indicating that she can handle the distance of the 5000m with ease. With a personal best of 14:13.32, Tsegay has the speed to outpace her competitors in the final stretch and secure the victory.\n\nSifan Hassan, the world record holder in the women's mile, is expected to finish in second place. While she hasn't competed in many 5000m races in 2023, her recent 10,000m performance of 29:37.80 shows that she is in excellent form and capable of running a fast time. With a personal best of 14:22.12, Hassan has the speed and endurance to challenge Tsegay for the win.\n\nBeatrice Chebet, the 23-year-old Kenyan, is predicted to finish in third place. Chebet has shown consistent performances in the 5000m, including a recent season's best of 14:36.52. While her personal best is slightly slower than Tsegay and Hassan, Chebet has the ability to stay with the leading pack and potentially make a move in the later stages of the race.\n\nAlicia Monson, the American athlete, is expected to finish in fourth place. While she hasn't shown the same level of dominance as Tsegay and Hassan, Monson has consistently performed well in the 5000m, with a recent season's best of 14:34.88. Her strong finish and competitive mindset make her a threat in any race.\n\nKaroline Bjerkeli Grøvdal, the Norwegian distance runner, is predicted to finish in fifth place. Grøvdal has had a mixed season, with some strong performances in the half marathon and 3000m, but a DNF in her most recent 5000m race. While her personal best of 14:31.07 is competitive, her inconsistency raises doubts about her ability to challenge the top contenders.\n\nThe remaining athletes are expected to finish in the order listed based on their recent performances and personal bests. While there may be some variation in the final times, the predicted order reflects the athletes' current form and capabilities.",
      "entrants": [
        {
          "firstName": "Gudaf",
          "lastName": "Tsegay",
          "id": "14595214",
          "pb": "14:13.32",
          "sb": null,
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Sifan",
          "lastName": "Hassan",
          "id": "14489606",
          "pb": "14:22.12",
          "sb": null,
          "nat": "NED",
          "hasAvy": true
        },
        {
          "firstName": "Karoline Bjerkeli",
          "lastName": "Grøvdal",
          "id": "14292573",
          "pb": "14:31.07",
          "sb": null,
          "nat": "NOR",
          "hasAvy": true
        },
        {
          "firstName": "Alicia",
          "lastName": "Monson",
          "id": "14708276",
          "pb": "14:31.11",
          "sb": "14:34.88",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Beatrice",
          "lastName": "Chebet",
          "id": "14749924",
          "pb": "14:34.55",
          "sb": "14:36.52",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Medina",
          "lastName": "Eisa",
          "id": "14985841",
          "pb": "14:40.02",
          "sb": "14:40.02",
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Josette",
          "lastName": "Andrews",
          "id": "14574966",
          "pb": "14:43.36",
          "sb": "14:43.36",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Margaret",
          "lastName": "Akidor",
          "id": "14798242",
          "pb": "14:44.83",
          "sb": "14:48.91",
          "nat": "KEN",
          "hasAvy": false
        },
        {
          "firstName": "Teresiah Muthoni",
          "lastName": "Gateri",
          "id": "14798246",
          "pb": "14:44.89",
          "sb": "14:57.56",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Girmawit",
          "lastName": "Gebrzihair",
          "id": "14848733",
          "pb": "14:46.12",
          "sb": "14:46.12",
          "nat": "ETH",
          "hasAvy": false
        },
        {
          "firstName": "Mizan",
          "lastName": "Alem",
          "id": "14848748",
          "pb": "14:46.20",
          "sb": null,
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Nadia",
          "lastName": "Battocletti",
          "id": "14700830",
          "pb": "14:46.29",
          "sb": "15:01.12",
          "nat": "ITA",
          "hasAvy": true
        },
        {
          "firstName": "Melknat",
          "lastName": "Wudu",
          "id": "14923882",
          "pb": "14:47.48",
          "sb": "14:47.48",
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Elly",
          "lastName": "Henes",
          "id": "14666149",
          "pb": "14:52.87",
          "sb": "14:54.20",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Amy-Eloise",
          "lastName": "Markovc",
          "id": "14404580",
          "pb": "14:56.60",
          "sb": "15:28.66",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Jessica",
          "lastName": "Warner-Judd",
          "id": "14336301",
          "pb": "14:57.19",
          "sb": "15:06.59",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Maureen",
          "lastName": "Koster",
          "id": "14372338",
          "pb": "15:00.64",
          "sb": "15:07.11",
          "nat": "NED",
          "hasAvy": true
        },
        {
          "firstName": "Rose",
          "lastName": "Davies",
          "id": "14517594",
          "pb": "15:07.49",
          "sb": "15:10.30",
          "nat": "AUS",
          "hasAvy": true
        },
        {
          "firstName": "Megan",
          "lastName": "Keith",
          "id": "14918707",
          "pb": "15:32.15",
          "sb": "15:32.15",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Werkuha",
          "lastName": "Getachew",
          "id": "14966550",
          "pb": null,
          "sb": null,
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Birke",
          "lastName": "Haylom",
          "id": "15009582",
          "pb": null,
          "sb": null,
          "nat": "ETH",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "110m Hurdles Men": {
      "date": "2023-07-23T14:53",
      "blurb": "Predicted Finish and Times:\n\n1. Grant Holloway (USA): 12.98\n2. Daniel Roberts (USA): 13.01\n3. Shunsuke Izumiya (JPN): 13.04\n4. Freddie Crittenden (USA): 13.19\n5. Hansle Parchment (JAM): 13.12\n6. Jamal Britt (USA): 13.14\n7. Trey Cunningham (USA): 13.23\n8. Tade Ojora (GBR): 13.26\n\nExplanation:\n\nBased on their performances leading up to the 2023 London Diamond League track meet, Grant Holloway is the clear favorite to win the Men's 110m Hurdles. With a personal best of 12.81 and a season's best of 12.98, Holloway has consistently shown his dominance in the event. His recent performances, including a time of 12.98 in Paris, demonstrate his ability to compete at a high level. Holloway's speed, technique, and consistency make him the top contender in this race.\n\nComing in second place is Daniel Roberts, who has also shown strong performances leading up to the event. With a personal best of 13.00 and a season's best of 13.01, Roberts has the speed and skill to challenge Holloway. His recent win in New York with a time of 13.01 further solidifies his position as a top contender. Roberts' ability to consistently perform at a high level makes him a strong candidate for second place.\n\nIn third place, we have Shunsuke Izumiya from Japan. With a personal best and season's best of 13.04, Izumiya has shown his potential in the event. His recent performances in Osaka, where he won with a time of 13.04, demonstrate his ability to compete against top athletes. While he may not have the same level of experience as Holloway and Roberts, Izumiya's speed and determination give him a good chance of securing a podium finish.\n\nFreddie Crittenden is predicted to finish in fourth place. With a personal best of 13.00 and a season's best of 13.19, Crittenden has been consistent in his performances. While he may not have achieved the same standout performances as the top three contenders, his strong finishes in various competitions, including a win in Phoenix with a time of 13.19, make him a solid choice for fourth place.\n\nHansle Parchment, the Jamaican athlete, is expected to finish in fifth place. With a personal best of 12.94 and a season's best of 13.12, Parchment has shown his capabilities in the event. However, his recent performances have not been as strong as some of the other competitors. While he did win in Kingston with a time of 13.12, his consistency and ability to challenge the top contenders are questionable.\n\nJamal Britt is predicted to finish in sixth place. With a personal best of 13.08 and a season's best of 13.14, Britt has shown promise in the event. However, his performances leading up to the event have not been as impressive as some of the other athletes. While he did win in Devonshire with a time of 12.99, his inconsistency and lack of standout performances put him at a disadvantage against the top contenders.\n\nTrey Cunningham is expected to finish in seventh place. With a personal best of 13.00 and a season's best of 13.23, Cunningham has the potential to challenge for a higher position. However, his recent performances have not been as strong as expected. While he did finish third in Atlanta with a time of 13.32, his inconsistency and inability to match the performances of the top contenders make it difficult for him to secure a higher place.\n\nLastly, Tade Ojora is predicted to finish in eighth place. With a personal best and season's best of 13.26, Ojora has shown promise in the event. However, his performances leading up to the event have not been as strong as some of the other athletes. While he did win in Manchester with a time of 13.16, his lack of standout performances and inconsistency put him at a disadvantage against the top contenders.\n\nOverall, Grant Holloway is the clear favorite to win the Men's 110m Hurdles based on his consistent performances and standout times. Daniel Roberts, Shunsuke Izumiya, and Freddie Crittenden are expected to challenge for the podium positions based on their strong performances and potential. Hansle Parchment, Jamal Britt, Trey Cunningham, and Tade Ojora have shown promise but lack the consistency and standout performances needed to contend with the top athletes in this race.",
      "entrants": [
        {
          "firstName": "Grant",
          "lastName": "Holloway",
          "id": "14516985",
          "pb": "12.81",
          "sb": "12.98",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Hansle",
          "lastName": "Parchment",
          "id": "14325570",
          "pb": "12.94",
          "sb": "13.12",
          "nat": "JAM",
          "hasAvy": true
        },
        {
          "firstName": "Freddie",
          "lastName": "Crittenden",
          "id": "14491556",
          "pb": "13.00",
          "sb": "13.19",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Trey",
          "lastName": "Cunningham",
          "id": "14675757",
          "pb": "13.00",
          "sb": "13.23",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Daniel",
          "lastName": "Roberts",
          "id": "14577558",
          "pb": "13.00",
          "sb": "13.01",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Shunsuke",
          "lastName": "Izumiya",
          "id": "14815041",
          "pb": "13.04",
          "sb": "13.04",
          "nat": "JPN",
          "hasAvy": true
        },
        {
          "firstName": "Jamal",
          "lastName": "Britt",
          "id": "14769264",
          "pb": "13.08",
          "sb": "13.14",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Tade",
          "lastName": "Ojora",
          "id": "14720966",
          "pb": "13.26",
          "sb": "13.26",
          "nat": "GBR",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "3000m Steeplechase Women": {
      "date": "2023-07-23T15:02",
      "blurb": "Predicted Finish and Times:\n\n1. Beatrice Chepkoech (KEN) - 9:02.50\n2. Jackline Chepkoech (KEN) - 9:05.00\n3. Zerfe Wondemagegn (ETH) - 9:07.50\n4. Kristlin Gear (USA) - 9:10.00\n5. Courtney Wayment (USA) - 9:12.50\n6. Elizabeth Bird (GBR) - 9:15.00\n7. Aimee Pratt (GBR) - 9:18.00\n8. Lea Meyer (GER) - 9:21.00\n9. Fancy Cherono (KEN) - 9:24.00\n10. Alicja Konieczek (POL) - 9:28.00\n11. Irene Sánchez-Escribano (ESP) - 9:30.00\n12. Michelle Finn (IRL) - 9:35.00\n13. Flavie Renouard (FRA) - 9:38.00\n14. Poppy Tank (GBR) - 9:45.00\n\nExplanation:\n\nBased on the athletes' performances and personal bests, Beatrice Chepkoech is the clear favorite to win the Women's 3000m Steeplechase at the 2023 London Diamond League track meet. She has consistently performed at a high level, with a personal best of 8:44.32 and a season's best of 9:05.98. Her recent victories and top placements in various races, including a first-place finish in the 3000m steeplechase in Lausanne, demonstrate her dominance in the event.\n\nJackline Chepkoech, a younger athlete, has shown great potential and improvement in her performances. With a personal best of 9:02.43 and a season's best of 9:04.07, she is expected to challenge Beatrice Chepkoech for the top spot. Her second-place finishes in several races, including the 3000m steeplechase in Firenze, indicate her ability to compete at a high level.\n\nZerfe Wondemagegn from Ethiopia has also been consistent in her performances, with a personal best and season's best of 9:04.61. While she hasn't achieved as many first-place finishes as the top contenders, her third-place finish in the 3000m steeplechase in Firenze shows her competitiveness.\n\nKristlin Gear from the USA has demonstrated strong performances, with a personal best and season's best of 9:12.81. Her first-place finish in the 3000m steeplechase in Eugene, along with consistent top placements, makes her a strong contender for a top-four finish.\n\nCourtney Wayment, also from the USA, has a personal best of 9:09.91 and a season's best of 9:11.41. While she hasn't achieved as many victories as some of the other athletes, her consistent top-eight finishes, including a fourth-place finish in Eugene, indicate her ability to compete at a high level.\n\nElizabeth Bird from Great Britain has a personal best of 9:07.87 but does not have a recorded season's best. Her recent fourth-place finish in the 1500m race in New York suggests that she may not be in her best form for the steeplechase event.\n\nAimee Pratt from Great Britain has a personal best of 9:15.64 and a season's best of 9:28.00. While she has achieved a first-place finish in the 3000m race in Bilbao, her slower season's best time compared to other athletes may impact her chances of finishing in the top positions.\n\nLea Meyer from Germany has a personal best of 9:15.35 and a season's best of 9:20.36. Her recent first-place finish in the 5000m race in Kassel shows her ability to compete at a high level. However, her slower season's best time compared to other athletes may affect her chances of finishing higher.\n\nFancy Cherono from Kenya has a personal best of 9:27.30 and a season's best of 9:32.93. While she hasn't achieved as many top placements as the top contenders, her recent third-place finish in the steeplechase event in Lucca demonstrates her ability to compete against strong competition.\n\nAlicja Konieczek from Poland has a personal best of 9:25.15 and a season's best of 9:25.51. Her recent second-place finish in the steeplechase event in Los Angeles indicates her competitiveness. However, her slower season's best time compared to other athletes may impact her chances of finishing higher.\n\nIrene Sánchez-Escribano from Spain has a personal best and season's best of 9:20.04. Her recent first-place finish in the steeplechase event in Barcelona shows her ability to perform well. However, her slower season's best time compared to other athletes may affect her chances of finishing higher.\n\nMichelle Finn from Ireland has a personal best of 9:29.25 and a season's best of 9:41.16. While she has achieved several second-place finishes, including in Karlsruhe and Decines, her slower season's best time compared to other athletes may impact her chances of finishing higher.\n\nFlavie Renouard from France has a personal best of 9:29.10 and a season's best of 9:29.10. Her recent third-place finish in the steeplechase event in Barcelona shows her competitiveness. However, her slower season's best time compared to other athletes may impact her chances of finishing higher.\n\nPoppy Tank from Great Britain has a personal best and season's best of 10:02.77. While she has achieved a first-place finish in the steeplechase event in Manchester, her slower season's best time compared to other athletes may impact her chances of finishing higher.\n\nOverall, Beatrice Chepkoech is expected to win the race due to her consistent performances, while Jackline Chepkoech, Zerfe Wondemagegn, and Kristlin Gear are likely to challenge for the top spots based on their recent performances and personal bests.",
      "entrants": [
        {
          "firstName": "Beatrice",
          "lastName": "Chepkoech",
          "id": "14383286",
          "pb": "8:44.32",
          "sb": "9:05.98",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Jackline",
          "lastName": "Chepkoech",
          "id": "14989892",
          "pb": "9:02.43",
          "sb": "9:04.07",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Zerfe",
          "lastName": "Wondemagegn",
          "id": "14894854",
          "pb": "9:04.61",
          "sb": "9:04.61",
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Elizabeth",
          "lastName": "Bird",
          "id": "14422252",
          "pb": "9:07.87",
          "sb": null,
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Courtney",
          "lastName": "Wayment",
          "id": "14617090",
          "pb": "9:09.91",
          "sb": "9:11.41",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Kristlin",
          "lastName": "Gear",
          "id": "14694660",
          "pb": "9:12.81",
          "sb": "9:12.81",
          "nat": "USA",
          "hasAvy": false
        },
        {
          "firstName": "Lea",
          "lastName": "Meyer",
          "id": "14509240",
          "pb": "9:15.35",
          "sb": "9:20.36",
          "nat": "GER",
          "hasAvy": false
        },
        {
          "firstName": "Aimee",
          "lastName": "Pratt",
          "id": "14527315",
          "pb": "9:15.64",
          "sb": "9:28.00",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Irene",
          "lastName": "Sánchez-Escribano",
          "id": "14438470",
          "pb": "9:20.04",
          "sb": "9:20.04",
          "nat": "ESP",
          "hasAvy": true
        },
        {
          "firstName": "Alicja",
          "lastName": "Konieczek",
          "id": "14424786",
          "pb": "9:25.15",
          "sb": "9:25.51",
          "nat": "POL",
          "hasAvy": true
        },
        {
          "firstName": "Fancy",
          "lastName": "Cherono",
          "id": "14798265",
          "pb": "9:27.30",
          "sb": "9:32.93",
          "nat": "KEN",
          "hasAvy": true
        },
        {
          "firstName": "Flavie",
          "lastName": "Renouard",
          "id": "14753918",
          "pb": "9:29.10",
          "sb": "9:29.10",
          "nat": "FRA",
          "hasAvy": false
        },
        {
          "firstName": "Michelle",
          "lastName": "Finn",
          "id": "14414945",
          "pb": "9:29.25",
          "sb": "9:41.16",
          "nat": "IRL",
          "hasAvy": true
        },
        {
          "firstName": "Poppy",
          "lastName": "Tank",
          "id": "14473353",
          "pb": "10:02.77",
          "sb": "10:02.77",
          "nat": "GBR",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "400m Men": {
      "date": "2023-07-23T15:19",
      "blurb": "Predicted Finish and Times:\n1. Wayde van Niekerk (RSA) - 43.85\n2. Bryce Deadmon (USA) - 44.10\n3. Ryan Willie (USA) - 44.20\n4. Vernon Norwood (USA) - 44.40\n5. Matthew Hudson-Smith (GBR) - 44.60\n6. Leungo Scotch (BOT) - 44.80\n7. Alex Haydock-Wilson (GBR) - 45.10\n8. Liemarvin Bonevacia (NED) - 45.30\n\nExplanation:\n\nBased on the performances and times throughout the season, it is predicted that Wayde van Niekerk will finish first in the Men's 400m at the 2023 London Diamond League track meet. Van Niekerk has consistently shown strong performances, with a season's best of 44.08 and a personal best of 43.03. His recent performances, including a first-place finish with a time of 44.08 at the Stadion Śląski in Chorzów, Poland, demonstrate his current form and ability to compete at a high level. Van Niekerk's experience and success in the event make him the favorite to win.\n\nBryce Deadmon is predicted to finish second with a time of 44.10. Deadmon has shown consistent performances throughout the season, with a season's best of 44.22. Although he has not yet matched the times of van Niekerk, Deadmon's recent first-place finish with a time of 44.22 at the Hayward Field in Eugene, Oregon, indicates that he is in good form and capable of challenging for the top spot.\n\nRyan Willie is expected to finish third with a time of 44.20. Despite being a relatively young athlete at 21 years old, Willie has demonstrated impressive performances throughout the season, including a personal best and season's best of 44.25. His consistency and ability to compete at a high level make him a strong contender for a podium finish.\n\nVernon Norwood is predicted to finish fourth with a time of 44.40. Norwood has consistently performed well this season, with a season's best of 44.39. While his times are slightly slower than the top contenders, Norwood's recent first-place finish with a time of 44.43 at the Hayward Field in Eugene, Oregon, shows that he is capable of competing at a high level and challenging for a top finish.\n\nMatthew Hudson-Smith is expected to finish fifth with a time of 44.60. Hudson-Smith has had a solid season, with a season's best of 44.92. However, he has not shown the same level of consistency and standout performances as the top contenders. While he has the potential to challenge for a higher position, his recent fifth-place finish with a time of 44.92 at the Bislett Stadion in Oslo, Norway, suggests that he may not be in peak form.\n\nLeungo Scotch is predicted to finish sixth with a time of 44.80. Scotch has shown strong performances throughout the season, including a personal best and season's best of 44.82. However, he has not consistently matched the times of the top contenders, and his recent sixth-place finish with a time of 44.88 at the Stadion Śląski in Chorzów, Poland, indicates that he may struggle to challenge for a higher position.\n\nAlex Haydock-Wilson is expected to finish seventh with a time of 45.10. While Haydock-Wilson has shown promise with his performances this season, including a season's best of 45.25, he has not consistently competed at the same level as the top contenders. His recent fourth-place finish with a time of 46.10 at the Stade Delort in Marseille, France, suggests that he may struggle to compete with the faster athletes in this race.\n\nLiemarvin Bonevacia is predicted to finish eighth with a time of 45.30. Bonevacia has had a solid season, with a season's best of 45.06. However, he has not shown the same level of consistency and standout performances as the top contenders. His recent fifth-place finish with a time of 45.06 at the Stadion Śląski in Chorzów, Poland, suggests that he may struggle to challenge for a higher position.\n\nOverall, Wayde van Niekerk is the clear favorite to win the Men's 400m at the 2023 London Diamond League track meet based on his consistent and standout performances throughout the season. However, Bryce Deadmon, Ryan Willie, and Vernon Norwood are strong contenders who have shown the ability to challenge for a podium finish.",
      "entrants": [
        {
          "firstName": "Wayde",
          "lastName": "van Niekerk",
          "id": "14417677",
          "pb": "43.03",
          "sb": "44.08",
          "nat": "RSA",
          "hasAvy": true
        },
        {
          "firstName": "Bryce",
          "lastName": "Deadmon",
          "id": "14596460",
          "pb": "44.22",
          "sb": "44.22",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Ryan",
          "lastName": "Willie",
          "id": "14802726",
          "pb": "44.25",
          "sb": "44.25",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Matthew",
          "lastName": "Hudson-Smith",
          "id": "14407278",
          "pb": "44.35",
          "sb": "44.92",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Vernon",
          "lastName": "Norwood",
          "id": "14490237",
          "pb": "44.35",
          "sb": "44.39",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Liemarvin",
          "lastName": "Bonevacia",
          "id": "14427350",
          "pb": "44.48",
          "sb": "45.06",
          "nat": "NED",
          "hasAvy": true
        },
        {
          "firstName": "Leungo",
          "lastName": "Scotch",
          "id": "14643510",
          "pb": "44.82",
          "sb": "44.82",
          "nat": "BOT",
          "hasAvy": true
        },
        {
          "firstName": "Alex",
          "lastName": "Haydock-Wilson",
          "id": "14735578",
          "pb": "45.08",
          "sb": "45.25",
          "nat": "GBR",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "200m Men": {
      "date": "2023-07-23T15:29",
      "blurb": "Predicted Finish and Times:\n\n1. Noah Lyles (USA) - 19.67\n2. Erriyon Knighton (USA) - 19.72\n3. Zharnel Hughes (GBR) - 20.14\n4. Joseph Fahnbulleh (LBR) - 20.14\n5. Letsile Tebogo (BOT) - 19.87\n6. Alexander Ogando (DOM) - 19.99\n7. Jona Efoloko (GBR) - 20.49\n\nExplanation:\n\nBased on the performances and season's best times, Noah Lyles is the standout athlete in this race. With a personal best of 19.31 and a season's best of 19.67, Lyles has consistently performed at a high level throughout the season. His recent victories in the 200m at the Kingston and Paris Diamond League meets, as well as his strong performances in the 100m, indicate that he is in top form.\n\nErriyon Knighton, the young American sprinter, has shown great potential this season. With a personal best of 19.49 and a season's best of 19.72, Knighton has consistently challenged Lyles in the 200m. His recent victory in the 200m at the Manchester Diamond League meet, where he ran a blistering time of 19.77, demonstrates his ability to compete at a high level.\n\nZharnel Hughes, representing Great Britain, has a personal best of 20.02 and a season's best of 20.14. While his performances have been solid, he has not been able to match the times set by Lyles and Knighton. However, Hughes' experience and consistency make him a strong contender for a podium finish.\n\nJoseph Fahnbulleh, from Liberia, has a personal best of 19.83 and a season's best of 20.14. While Fahnbulleh has shown potential with his performances earlier in the season, including a third-place finish in the 200m at the Oslo Diamond League meet, he has not been able to consistently match the times set by Lyles and Knighton.\n\nLetsile Tebogo, representing Botswana, has a personal best and season's best of 19.87. Tebogo's recent victory in the 200m at the Lignano Sabbiadoro meet, where he ran a time of 19.99, shows that he has the potential to challenge the top athletes in this race.\n\nAlexander Ogando, from the Dominican Republic, has a personal best of 19.91 and a season's best of 19.99. While Ogando has had some strong performances this season, including victories in the 200m at the San Salvador and Székesfehérvár meets, he has not consistently matched the times set by the top contenders.\n\nJona Efoloko, representing Great Britain, has a personal best of 20.48 and a season's best of 20.49. While Efoloko has shown promise in the past, his performances this season have not been at the same level as the top contenders in this race.\n\nIn conclusion, based on their performances and season's best times, Noah Lyles is predicted to win the Men's 200m at the 2023 London Diamond League track meet. Erriyon Knighton is expected to finish in second place, followed closely by Zharnel Hughes and Joseph Fahnbulleh. Letsile Tebogo, Alexander Ogando, and Jona Efoloko are expected to round out the field. However, as with any race, unexpected performances and factors can always come into play, so it will be exciting to see how the race unfolds.",
      "entrants": [
        {
          "firstName": "Noah",
          "lastName": "Lyles",
          "id": "14536762",
          "pb": "19.31",
          "sb": "19.67",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Erriyon",
          "lastName": "Knighton",
          "id": "14897541",
          "pb": "19.49",
          "sb": "19.72",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Joseph",
          "lastName": "Fahnbulleh",
          "id": "14803230",
          "pb": "19.83",
          "sb": "20.14",
          "nat": "LBR",
          "hasAvy": true
        },
        {
          "firstName": "Letsile",
          "lastName": "Tebogo",
          "id": "14883897",
          "pb": "19.87",
          "sb": "19.87",
          "nat": "BOT",
          "hasAvy": true
        },
        {
          "firstName": "Alexander",
          "lastName": "Ogando",
          "id": "14912251",
          "pb": "19.91",
          "sb": "19.99",
          "nat": "DOM",
          "hasAvy": true
        },
        {
          "firstName": "Zharnel",
          "lastName": "Hughes",
          "id": "14414524",
          "pb": "20.02",
          "sb": "20.14",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Jona",
          "lastName": "Efoloko",
          "id": "14595067",
          "pb": "20.48",
          "sb": "20.49",
          "nat": "GBR",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "100m Women": {
      "date": "2023-07-23T15:40",
      "blurb": "Predicted Finish and Times:\n1. Shericka Jackson - 10.65\n2. Sha'Carri Richardson - 10.71\n3. Marie-Josée Ta Lou - 10.75\n4. Aleia Hobbs - 10.81\n5. Twanisha Terry - 10.82\n6. Dina Asher-Smith - 10.83\n7. Daryll Neita - 10.90\n8. Anthonique Strachan - 10.92\n\nExplanation:\n\nBased on the athletes' performances leading up to the London Diamond League track meet, Shericka Jackson is predicted to finish first with a time of 10.65. Jackson has consistently performed well throughout the season, with multiple first-place finishes and impressive times in the 100m. Her personal best and season's best time of 10.65 further solidify her position as the top contender in this race.\n\nSha'Carri Richardson is expected to finish second with a time of 10.71. While Richardson has shown great potential and impressive performances, including a first-place finish with a time of 10.71, she falls slightly short of Jackson's consistency and personal best time. However, Richardson's speed and determination could still pose a challenge to Jackson.\n\nMarie-Josée Ta Lou is predicted to finish third with a time of 10.75. Ta Lou has had a solid season, with consistent first-place finishes and a season's best time of 10.75. While her personal best time is slightly slower than Jackson and Richardson, Ta Lou's consistent performances make her a strong contender for a podium finish.\n\nAleia Hobbs is expected to finish fourth with a time of 10.81. Hobbs has shown good form throughout the season, with multiple first-place finishes and a season's best time of 10.81. However, her personal best time is slightly slower than the top three contenders, placing her just outside the podium positions.\n\nTwanisha Terry is predicted to finish fifth with a time of 10.82. Terry has shown promise with consistent performances and a season's best time of 10.82. While her personal best time is on par with Ta Lou, her performances have been less consistent, placing her slightly lower in the predicted rankings.\n\nDina Asher-Smith is expected to finish sixth with a time of 10.83. Asher-Smith has had a decent season, with a season's best time of 10.98. However, her performances have not been as strong as the top contenders, placing her lower in the predicted rankings.\n\nDaryll Neita is predicted to finish seventh with a time of 10.90. Neita has shown good form in some races, but her performances have been inconsistent, with a season's best time of 10.97. Her slower personal best time and lack of standout performances compared to the top contenders place her lower in the predicted rankings.\n\nAnthonique Strachan is expected to finish eighth with a time of 10.92. While Strachan has had some decent performances, her season's best time of 10.92 is slower than the top contenders. Additionally, her inconsistency in performances and lack of standout performances compared to the top contenders place her lower in the predicted rankings.\n\nOverall, Shericka Jackson's consistent performances and impressive personal best time make her the top contender for the Women's 100m at the 2023 London Diamond League track meet. However, Sha'Carri Richardson, Marie-Josée Ta Lou, and Aleia Hobbs are all strong contenders and could challenge Jackson for the top spot. The predicted rankings are based on an analysis of the athletes' performances leading up to the event, taking into account their personal best times, season's best times, and consistency in performances.",
      "entrants": [
        {
          "firstName": "Shericka",
          "lastName": "Jackson",
          "id": "14325599",
          "pb": "10.65",
          "sb": "10.65",
          "nat": "JAM",
          "hasAvy": true
        },
        {
          "firstName": "Sha'Carri",
          "lastName": "Richardson",
          "id": "14717691",
          "pb": "10.71",
          "sb": "10.71",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Marie-Josée",
          "lastName": "Ta Lou",
          "id": "14415994",
          "pb": "10.72",
          "sb": "10.75",
          "nat": "CIV",
          "hasAvy": true
        },
        {
          "firstName": "Aleia",
          "lastName": "Hobbs",
          "id": "14430847",
          "pb": "10.81",
          "sb": "10.86",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Twanisha",
          "lastName": "Terry",
          "id": "14553598",
          "pb": "10.82",
          "sb": "10.99",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Dina",
          "lastName": "Asher-Smith",
          "id": "14378282",
          "pb": "10.83",
          "sb": "10.98",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Daryll",
          "lastName": "Neita",
          "id": "14476603",
          "pb": "10.90",
          "sb": "10.97",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Anthonique",
          "lastName": "Strachan",
          "id": "14368117",
          "pb": "10.92",
          "sb": "10.92",
          "nat": "BAH",
          "hasAvy": true
        }
      ],
      "isClosed": true
    },
    "800m Women": {
      "date": "2023-07-23T15:51",
      "blurb": "Predicted Finish and Times:\n\n1. Keely Hodgkinson (GBR) - 1:55.50\n2. Natoya Goule-Toppin (JAM) - 1:56.00\n3. Jemma Reekie (GBR) - 1:57.00\n4. Halimah Nakaayi (UGA) - 1:57.50\n5. Anita Horvat (SLO) - 1:58.00\n6. Catriona Bisset (AUS) - 1:58.50\n7. Sage Hurta-Klecker (USA) - 1:59.00\n8. Raevyn Rogers (USA) - 1:59.50\n9. Diribe Welteji (ETH) - 2:00.00\n10. Rénelle Lamote (FRA) - 2:00.50\n11. Aneta Lemiesz (POL) - 2:05.00\n\nExplanation:\n\nBased on the performances and data provided, Keely Hodgkinson is the clear favorite to win the Women's 800m at the London Diamond League track meet. With a season's best of 1:55.77 and consistently strong performances throughout the year, including a standout time of 1:55.77 in the Paris Diamond League, Hodgkinson has proven her dominance in the event. Her ability to consistently run under 2 minutes and her recent victory against strong competition make her the top pick for first place.\n\nNatoya Goule-Toppin, with a season's best of 1:57.90, is predicted to finish in second place. While she has shown consistent performances throughout the season, including a win in Kingston, Jamaica, her times have not been as impressive as Hodgkinson's. However, Goule-Toppin's experience and strong finishing kick could give her an edge over the other competitors.\n\nJemma Reekie, with a season's best of 1:58.93, is expected to finish in third place. While she has had some strong performances, including a win in Chorzów, Poland, her times have not been as consistent or as fast as Hodgkinson and Goule-Toppin. Reekie will need to improve her performances and potentially rely on her tactical race skills to secure a podium finish.\n\nHalimah Nakaayi, the defending world champion, is predicted to finish in fourth place. While she has a personal best of 1:57.78, her season's best of 1:57.78 indicates that she has not been in top form this year. Nakaayi will need to improve her times and regain her championship-winning form to challenge for a higher position.\n\nAnita Horvat, with a season's best of 1:58.73, is predicted to finish in fifth place. Horvat has shown consistent performances throughout the season, including a win in Turku, Finland. Her ability to consistently run under 2 minutes makes her a strong contender for a top-five finish.\n\nCatriona Bisset, with a season's best of 1:58.32, is expected to finish in sixth place. While she has shown strong performances, including a win in Brisbane, Australia, her times have not been as fast or consistent as the top contenders. Bisset will need to improve her performances to challenge for a higher position.\n\nSage Hurta-Klecker, with a season's best of 1:58.09, is predicted to finish in seventh place. While she has shown some strong performances, including a win in Eugene, Oregon, her times have been slightly slower and less consistent than the top contenders. Hurta-Klecker will need to improve her performances and potentially rely on her tactical race skills to secure a top-seven finish.\n\nRaevyn Rogers, with a season's best of 1:59.83, is expected to finish in eighth place. While she has shown some strong performances, including a win in Eugene, Oregon, her times have not been as fast or consistent as the top contenders. Rogers will need to improve her performances to challenge for a higher position.\n\nDiribe Welteji, despite not having a recorded season's best time, is predicted to finish in ninth place. While she has shown some strong performances, including a win in Ostrava, Czech Republic, her lack of consistent times and limited data make it difficult to predict her exact performance. Welteji will need to prove herself against strong competition to secure a top-ten finish.\n\nRénelle Lamote, with a season's best of 1:59.30, is expected to finish in tenth place. While she has shown some strong performances, including a win in Chorzów, Poland, her times have not been as fast or consistent as the top contenders. Lamote will need to improve her performances to challenge for a higher position.\n\nAneta Lemiesz, with a personal best of 1:59.93, is predicted to finish in eleventh place. While she has shown some strong performances in the past, her lack of recent data and slower times compared to the other competitors make it difficult to predict her exact performance. Lemiesz will need to prove herself against strong competition to secure a top-ten finish.",
      "entrants": [
        {
          "firstName": "Keely",
          "lastName": "Hodgkinson",
          "id": "14642894",
          "pb": "1:55.77",
          "sb": "1:55.77",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Natoya",
          "lastName": "Goule-Toppin",
          "id": "14285696",
          "pb": "1:56.15",
          "sb": "1:57.90",
          "nat": "JAM",
          "hasAvy": true
        },
        {
          "firstName": "Raevyn",
          "lastName": "Rogers",
          "id": "14378260",
          "pb": "1:56.81",
          "sb": "1:59.83",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Jemma",
          "lastName": "Reekie",
          "id": "14533469",
          "pb": "1:56.90",
          "sb": "1:58.93",
          "nat": "GBR",
          "hasAvy": true
        },
        {
          "firstName": "Diribe",
          "lastName": "Welteji",
          "id": "14848719",
          "pb": "1:57.02",
          "sb": null,
          "nat": "ETH",
          "hasAvy": true
        },
        {
          "firstName": "Halimah",
          "lastName": "Nakaayi",
          "id": "14431159",
          "pb": "1:57.78",
          "sb": "1:57.78",
          "nat": "UGA",
          "hasAvy": true
        },
        {
          "firstName": "Rénelle",
          "lastName": "Lamote",
          "id": "14424718",
          "pb": "1:57.84",
          "sb": "1:59.30",
          "nat": "FRA",
          "hasAvy": true
        },
        {
          "firstName": "Sage",
          "lastName": "Hurta-Klecker",
          "id": "14478094",
          "pb": "1:57.85",
          "sb": "1:58.09",
          "nat": "USA",
          "hasAvy": true
        },
        {
          "firstName": "Catriona",
          "lastName": "Bisset",
          "id": "14463325",
          "pb": "1:58.09",
          "sb": "1:58.32",
          "nat": "AUS",
          "hasAvy": true
        },
        {
          "firstName": "Anita",
          "lastName": "Horvat",
          "id": "14472475",
          "pb": "1:58.73",
          "sb": "1:58.73",
          "nat": "SLO",
          "hasAvy": true
        },
        {
          "firstName": "Aneta",
          "lastName": "Lemiesz",
          "id": "14294016",
          "pb": "1:59.93",
          "sb": null,
          "nat": "POL",
          "hasAvy": false
        }
      ],
      "isClosed": true
    }
  }
}